-- Radar values are stored as stream, voltage, air, freeze, chaos.
return {
	StepsType_Dance_Single= {
--DDR A
["愛言葉"] = {
	Beginner={21,22,7,26,0},
	Easy={34,22,18,26,0},
	Medium={43,34,23,26,7},
	Hard={63,45,21,25,28},
},
["天ノ弱"] = {
	Beginner={20,25,0,0,0},
	Easy={36,33,3,12,0},
	Medium={56,50,25,6,7},
	Hard={80,67,41,4,24},
},
["ありふれたせかいせいふく"]={
	Beginner={26,25,3,16,0},
	Easy={40,37,34,24,5},
	Medium={58,50,30,34,20},
	Hard={87,75,34,25,95},
},
["いーあるふぁんくらぶ"]={
	Beginner={14,18,1,11,0},
	Easy={26,24,5,17,0},
	Medium={45,42,27,49,6},
	Hard={67,66,10,45,32},
},
["イーディーエム・ジャンパーズ"]={
	Beginner={12,11,1,20,9},
	Easy={25,22,18,61,0},
	Medium={44,44,23,51,9},
	Hard={59,50,23,67,44},
},
["色は匂へど散りぬるを"]={
	Beginner={18,22,0,40,0},
	Easy={32,22,5,16,0},
	Medium={44,34,30,20,8},
	Hard={53,57,12,66,20},
},
["エイリアンエイリアン"]={
	Beginner={22,19,0,18,0},
	Easy={33,25,1,20,0},
	Medium={57,44,1,39,15},
	Hard={78,76,32,36,40},
},
["エキサイティング!!も・ちゃ・ちゃ☆"]={
	Beginner={25,31,12,31,0},
	Easy={41,31,21,30,4},
	Medium={54,54,40,15,22},
	Hard={71,62,50,13,43},
},
["おねがいダーリン"]={
	Beginner={11,14,1,12,0},
	Easy={21,22,5,13,0},
	Medium={51,52,0,31,7},
	Hard={73,59,10,30,28},
},
["朧"]={
	Beginner={17,18,0,0,0},
	Easy={32,24,3,68,0},
	Medium={45,43,25,80,7},
	Hard={61,49,29,53,20},
	Challenge={73,74,27,50,69},
},
["朧 (dj TAKA Remix)"]={
	Beginner={20,18,3,28,0},
	Easy={29,24,16,39,0},
	Medium={45,43,32,32,5},
	Hard={67,55,25,31,37},
},
["きゅん×きゅんばっきゅん☆LOVE"]={
	Beginner={21,20,0,3,0},
	Easy={31,27,0,5,0},
	Medium={60,48,1,11,16},
	Hard={73,55,25,19,26},
},
["ACE FOR ACES"] = {
	Beginner={18,25,3,22,0},
	Easy={50,41,14,42,1},
	Medium={76,80,27,31,79},
	Hard={113,159,36,19,106},
	Challenge={172,260,80,28,175},
},
["ALGORITHM"] = {
	Beginner={28,21,7,11,0},
	Easy={36,32,54,20,3},
	Medium={57,43,29,9,24},
	Hard={76,86,41,33,102},
},
["ALL MY HEART -この恋に、わたしの全てを賭ける-"] = {
	Beginner={22,20,0,4,0},
	Easy={34,26,1,6,0},
	Medium={56,46,21,8,12},
	Hard={78,66,12,17,54},
},
["Angelic Jelly"] = {
	Beginner={21,30,9,15,0},
	Easy={37,30,1,22,0},
	Medium={69,61,23,13,21},
	Hard={91,91,23,8,55},
},
["ANNIVERSARY ∴∵∴ ←↓↑→"]={
	Beginner={23,29,1,25,0},
	Easy={45,37,1,18,1},
	Medium={70,59,16,37,20},
	Hard={114,109,25,28,103},
},
["ENDYMION"] ={
	Beginner={45,54,16,42,1},
	Easy={78,104,40,42,20},
	Medium = {97,110,54,52,65},
	Hard = {154,124,61,52,105},
	Challenge={198,158,106,43,115},
},
--Other songs, probably 2014 and below
["はなまるぴっぴはよいこだけ"]
= {
Beginner= {18, 21, 0, 24, 0},
Easy= {37, 28, 3, 28, 0},
Medium= {49, 50, 56, 12, 9},
Hard= {65, 64, 27, 10, 26},
Challenge= {0, 0, 0, 0, 0},
},
["TSUBASA"]
= {
Beginner= {23, 25, 0, 4, 0},
Easy= {31, 25, 3, 12, 0},
Medium= {51, 50, 20, 28, 12},
Hard= {76, 69, 18, 18, 60},
Challenge= {0, 0, 0, 0, 0},
},
["妖隠し -あやかしかくし-"]
= {
Beginner= {19, 17, 5, 0, 4},
Easy= {39, 35, 1, 21, 30},
Medium= {72, 52, 23, 24, 102},
Hard= {103, 74, 5, 27, 120},
Challenge= {0, 0, 0, 0, 0},
},
["ホメ猫☆センセーション"]
= {
Beginner= {31, 33, 1, 13, 0},
Easy= {34, 33, 1, 13, 0},
Medium= {61, 66, 27, 14, 6},
Hard= {91, 66, 41, 19, 34},
Challenge= {0, 0, 0, 0, 0},
},
["Scarlet Moon"]
= {
Beginner= {15, 15, 1, 22, 0},
Easy= {31, 30, 3, 17, 0},
Medium= {47, 44, 5, 16, 5},
Hard= {73, 60, 27, 9, 30},
Challenge= {0, 0, 0, 0, 0},
},
["Struggle"]
= {
Beginner= {29, 22, 0, 0, 0},
Easy= {48, 30, 9, 9, 0},
Medium= {60, 52, 12, 9, 9},
Hard= {87, 60, 34, 23, 37},
Challenge= {0, 0, 0, 0, 0},
},
["AWAKE"]
= {
Beginner= {23, 22, 1, 26, 0},
Easy= {32, 30, 1, 31, 0},
Medium= {62, 52, 21, 41, 16},
Hard= {81, 67, 34, 51, 35},
Challenge= {125, 110, 30, 50, 105},
},
["朝色の紙飛行機"]
= {
Beginner= {20, 21, 1, 21, 0},
Easy= {28, 21, 1, 80, 0},
Medium= {43, 43, 16, 54, 12},
Hard= {68, 87, 27, 49, 73},
Challenge= {0, 0, 0, 0, 0},
},
["M.A.Y.U."]
= {
Beginner= {21, 21, 1, 0, 0},
Easy= {34, 21, 25, 30, 0},
Medium= {44, 37, 32, 20, 9},
Hard= {76, 58, 41, 20, 89},
Challenge= {0, 0, 0, 0, 0},
},
["女言葉の消失"]
= {
Beginner= {18, 17, 9, 24, 0},
Easy= {32, 28, 18, 35, 0},
Medium= {50, 39, 18, 42, 15},
Hard= {67, 56, 36, 18, 53},
Challenge= {0, 0, 0, 0, 0},
},
["Go↓Go↑Girls&Boys!"]
= {
Beginner= {19, 19, 0, 30, 0},
Easy= {31, 26, 0, 12, 0},
Medium= {46, 39, 14, 29, 6},
Hard= {55, 52, 23, 32, 17},
Challenge= {0, 0, 0, 0, 0},
},
["幻想系世界修復少女"]
= {
Beginner= {22, 23, 0, 0, 0},
Easy= {43, 31, 7, 15, 0},
Medium= {66, 56, 9, 31, 14},
Hard= {78, 64, 47, 51, 27},
Challenge= {0, 0, 0, 0, 0},
},
["バンブーソード・ガール"]
= {
Beginner= {15, 17, 0, 0, 0},
Easy= {46, 34, 16, 11, 0},
Medium= {70, 69, 41, 22, 18},
Hard= {111, 102, 29, 30, 88},
Challenge= {0, 0, 0, 0, 0},
},
["セツナトリップ"]
= {
Beginner= {17, 18, 0, 8, 0},
Easy= {26, 24, 7, 17, 0},
Medium= {55, 48, 34, 13, 18},
Hard= {89, 72, 14, 17, 100},
Challenge= {0, 0, 0, 0, 0},
},
["ラクガキスト"]
= {
Beginner= {35, 33, 3, 0, 0},
Easy= {54, 33, 3, 1, 0},
Medium= {63, 49, 72, 1, 6},
Hard= {93, 66, 18, 1, 37},
Challenge= {134, 116, 25, 1, 103},
},
["回レ!雪月花"]
= {
Beginner= {19, 20, 1, 0, 0},
Easy= {31, 26, 10, 21, 0},
Medium= {46, 40, 49, 23, 7},
Hard= {68, 53, 27, 16, 26},
Challenge= {76, 73, 65, 24, 67},
},
["激アツ☆マジヤバ☆チアガール"]
= {
Beginner= {14, 21, 0, 16, 0},
Easy= {36, 28, 0, 32, 0},
Medium= {50, 42, 23, 65, 6},
Hard= {74, 70, 27, 32, 43},
Challenge= {0, 0, 0, 0, 0},
},
["neko*neko"]
= {
Beginner= {11, 10, 0, 9, 0},
Easy= {24, 20, 5, 25, 0},
Medium= {48, 40, 3, 48, 14},
Hard= {67, 46, 20, 51, 44},
Challenge= {0, 0, 0, 0, 0},
},
["夏色DIARY -DDR mix-"]
= {
Beginner= {19, 26, 1, 19, 0},
Easy= {37, 26, 9, 20, 0},
Medium= {70, 53, 21, 16, 27},
Hard= {104, 80, 27, 11, 100},
Challenge= {0, 0, 0, 0, 0},
},
["パ→ピ→プ→Yeah!"]
= {
Beginner= {12, 26, 0, 0, 0},
Easy= {17, 26, 9, 27, 0},
Medium= {54, 53, 36, 20, 16},
Hard= {66, 66, 38, 21, 45},
Challenge= {0, 0, 0, 0, 0},
},
["8000000"]
= {
Beginner= {18, 23, 0, 0, 0},
Easy= {35, 31, 16, 6, 0},
Medium= {57, 62, 47, 5, 7},
Hard= {87, 93, 10, 5, 91},
Challenge= {0, 0, 0, 0, 0},
},
["天空の華"]
= {
Beginner= {19, 20, 0, 9, 0},
Easy= {30, 33, 3, 13, 0},
Medium= {62, 53, 10, 16, 27},
Hard= {113, 110, 47, 11, 105},
Challenge= {0, 0, 0, 0, 0},
},
["Sakura Mirage"]
= {
Beginner= {20, 23, 3, 27, 0},
Easy= {46, 46, 14, 34, 3},
Medium= {62, 62, 34, 40, 23},
Hard= {81, 93, 52, 40, 46},
Challenge= {0, 0, 0, 0, 0},
},
["In The Breeze"]
= {
Beginner= {10, 23, 1, 0, 0},
Easy= {23, 23, 9, 19, 0},
Medium= {43, 46, 27, 19, 13},
Hard= {57, 52, 21, 26, 57},
Challenge= {0, 0, 0, 0, 0},
},
["Summer fantasy (Darwin remix)"]
= {
Beginner= {18, 22, 1, 0, 0},
Easy= {39, 37, 20, 29, 0},
Medium= {54, 44, 63, 31, 8},
Hard= {72, 59, 69, 32, 22},
Challenge= {-1, -1, -1, -1, -1},
},
["ドーパミン"]
= {
Beginner= {33, 27, 3, 20, 0},
Easy= {59, 55, 25, 8, 15},
Medium= {75, 90, 10, 18, 61},
Hard= {144, 123, 18, 1, 120},
Challenge= {0, 0, 0, 0, 0},
},
["突撃!ガラスのニーソ姫!"]
= {
Beginner= {30, 30, 9, 19, 0},
Easy= {41, 30, 30, 61, 0},
Medium= {61, 61, 20, 59, 21},
Hard= {83, 103, 43, 44, 84},
Challenge= {0, 0, 0, 0, 0},
},
["爆なな☆てすとロイヤー"]
= {
Beginner= {25, 25, 0, 4, 0},
Easy= {46, 33, 9, 19, 0},
Medium= {64, 66, 9, 20, 15},
Hard= {86, 75, 41, 18, 36},
Challenge= {0, 0, 0, 0, 0},
},
["ビビットストリーム"]
= {
Beginner= {26, 30, 3, 31, 0},
Easy= {39, 30, 20, 30, 0},
Medium= {60, 53, 14, 53, 13},
Hard= {81, 68, 23, 34, 32},
Challenge= {0, 0, 0, 0, 0},
},
["チョコレートスマイル"]
= {
Beginner= {15, 24, 1, 0, 0},
Easy= {29, 32, 10, 19, 0},
Medium= {46, 48, 25, 49, 5},
Hard= {62, 65, 76, 26, 15},
Challenge= {0, 0, 0, 0, 0},
},
["Starlight Fantasia (Endorphins Mix)"]
= {
Beginner= {25, 24, 9, 25, 0},
Easy= {43, 42, 21, 73, 7},
Medium= {66, 66, 16, 41, 51},
Hard= {107, 116, 38, 34, 113},
Challenge= {0, 0, 0, 0, 0},
},
["HEART BEAT FORMULA (Vinyl Mix)"]
= {
Beginner= {20, 19, 14, 40, 0},
Easy= {49, 38, 1, 55, 17},
Medium= {62, 47, 0, 42, 72},
Hard= {80, 67, 5, 32, 103},
Challenge= {0, 0, 0, 0, 0},
},
["PRANA+REVOLUTIONARY ADDICT (U1 DJ Mix)"]
= {
Beginner= {33, 31, 1, 1, 0},
Easy= {56, 47, 25, 19, 10},
Medium= {80, 62, 36, 9, 36},
Hard= {140, 113, 58, 10, 106},
Challenge= {0, 0, 0, 0, 0},
},
["乙女繚乱 舞い咲き誇れ"]
= {
Beginner= {22, 26, 3, 31, 0},
Easy= {37, 34, 5, 37, 0},
Medium= {58, 52, 21, 35, 13},
Hard= {75, 69, 41, 37, 27},
Challenge= {0, 0, 0, 0, 0},
},
["ミライプリズム"]
= {
Beginner= {15, 17, 7, 17, 0},
Easy= {26, 23, 10, 27, 0},
Medium= {40, 34, 9, 68, 10},
Hard= {50, 46, 40, 86, 21},
Challenge= {0, 0, 0, 0, 0},
},
["滅亡天使 † にこきゅっぴん"]
= {
Beginner= {31, 33, 0, 3, 0},
Easy= {37, 33, 7, 18, 0},
Medium= {51, 50, 56, 15, 5},
Hard= {71, 66, 41, 16, 23},
Challenge= {0, 0, 0, 0, 0},
},
["Over The “Period”"]
= {
Beginner= {38, 32, 7, 73, 0},
Easy= {63, 107, 38, 85, 95},
Medium= {91, 107, 45, 62, 119},
Hard= {132, 123, 65, 52, 141},
Challenge= {0, 0, 0, 0, 0},
},
["MAX.(period)"]
= {
Beginner= {-1, -1, -1, -1, -1},
Easy= {76, -1, -1, -1, -1},
Medium= {88, 101, 25, 4, 17},
Hard= {152, 101, -1, -1, -1},
Challenge= {164, 101, 58, 24, 85},
},
["EGOISM 440"]
= {
Beginner= {54, 56, 9, 1, 2},
Easy= {59, 70, 9, 11, 8},
Medium= {88, 106, 10, 16, 40},
Hard= {152, 135, 10, 21, 120},
Challenge= {226, 142, 18, 5, 140},
},
["chaos eater"]
= {
Beginner= {34, 30, 7, 14, 0},
Easy= {47, 30, 29, 15, 0},
Medium= {73, 61, 32, 13, 28},
Hard= {109, 107, 52, 15, 102},
Challenge= {0, 0, 0, 0, 0},
},
["Destination"]
= {
Beginner= {23, 30, 1, 28, 0},
Easy= {45, 42, 20, 49, 11},
Medium= {68, 84, 21, 60, 80},
Hard= {91, 107, 27, 61, 111},
Challenge= {0, 0, 0, 0, 0},
},
["HAPPY☆LUCKY☆YEAPPY"]
= {
Beginner= {35, 35, 3, 17, 0},
Easy= {54, 53, 47, 24, 3},
Medium= {75, 71, 50, 32, 25},
Hard= {111, 121, 47, 21, 102},
Challenge= {0, 0, 0, 0, 0},
},
["Samurai Shogun vs. Master Ninja"]
= {
Beginner= {22, 32, 3, 16, 0},
Easy= {39, 32, 0, 19, 0},
Medium= {64, 64, 18, 19, 6},
Hard= {112, 86, 60, 17, 36},
Challenge= {0, 0, 0, 0, 0},
},
["Sand Blow"]
= {
Beginner= {24, 27, 0, 27, 0},
Easy= {42, 54, 16, 26, 4},
Medium= {71, 54, 29, 18, 40},
Hard= {95, 88, 49, 29, 103},
Challenge= {0, 0, 0, 0, 0},
},
["POSSESSION(EDP Live Mix)"]
= {
Beginner= {25, 23, 3, 35, 0},
Easy= {54, 46, 7, 62, 19},
Medium= {81, 61, 61, 64, 67},
Hard= {119, 111, 103, 45, 106},
Challenge= {0, 0, 0, 0, 0},
},
["Truare!"]
= {
Beginner= {30, 30, 3, 6, 0},
Easy= {48, 30, 41, 9, 0},
Medium= {73, 68, 41, 9, 63},
Hard= {103, 91, 52, 9, 105},
Challenge= {0, 0, 0, 0, 0},
},
["クリムゾンゲイト"]
= {
Beginner= {21, 24, 1, 11, 0},
Easy= {38, 32, 9, 25, 0},
Medium= {58, 49, 9, 15, 11},
Hard= {87, 82, 41, 12, 46},
Challenge= {0, 0, 0, 0, 0},
},
["海神"]
= {
Beginner= {20, 26, 5, 18, 0},
Easy= {37, 39, 18, 92, 2},
Medium= {62, 58, 9, 53, 30},
Hard= {93, 102, 7, 65, 105},
Challenge= {0, 0, 0, 0, 0},
},
["FUNKY SUMMER BEACH"]
= {
Beginner= {20, 25, 10, 21, 0},
Easy= {35, 25, 14, 29, 0},
Medium= {58, 50, 10, 19, 20},
Hard= {87, 88, 52, 5, 100},
Challenge= {0, 0, 0, 0, 0},
},
["Plan 8"]
= {
Beginner= {28, 35, 7, 27, 0},
Easy= {47, 35, 18, 55, 0},
Medium= {67, 70, 29, 76, 14},
Hard= {86, 111, 27, 76, 47},
Challenge= {0, 0, 0, 0, 0},
},
["Remain"]
= {
Beginner= {23, 26, 5, 13, 0},
Easy= {32, 32, 14, 9, 0},
Medium= {54, 72, 23, 9, 40},
Hard= {80, 115, 27, 9, 104},
Challenge= {0, 0, 0, 0, 0},
},
["Electronic or Treat!"]
= {
Beginner= {25, 22, 7, 7, 0},
Easy= {45, 30, 9, 44, 0},
Medium= {74, 60, 16, 36, 50},
Hard= {98, 107, 63, 32, 103},
Challenge= {0, 0, 0, 0, 0},
},
["エンドルフィン"]
= {
Beginner= {31, 26, 5, 12, 0},
Easy= {48, 33, 30, 9, 6},
Medium= {71, 66, 12, 16, 70},
Hard= {115, 102, 38, 17, 107},
Challenge= {0, 0, 0, 0, 0},
},
["Starlight Fantasia"]
= {
Beginner= {22, 24, 9, 20, 0},
Easy= {41, 37, 12, 78, 4},
Medium= {60, 55, 12, 60, 30},
Hard= {81, 98, 30, 60, 101},
Challenge= {0, 0, 0, 0, 0},
},
["Dance Partay"]
= {
Beginner= {15, 16, 3, 0, 0},
Easy= {25, 22, 0, 68, 0},
Medium= {42, 39, 18, 31, 6},
Hard= {56, 44, 36, 34, 23},
Challenge= {73, 56, 20, 15, 78},
},
["One Sided Love"]
= {
Beginner= {15, 17, 1, 0, 0},
Easy= {21, 23, 3, 0, 0},
Medium= {44, 34, 16, 0, 7},
Hard= {60, 46, 27, 0, 23},
Challenge= {66, 46, 74, 92, 29},
},
["The Lonely Streets"]
= {
Beginner= {11, 14, 3, 0, 0},
Easy= {19, 19, 14, 0, 0},
Medium= {36, 38, 29, 10, 11},
Hard= {50, 47, 56, 10, 37},
Challenge= {62, 67, 41, 43, 72},
},
["Dreamin'"]
= {
Beginner= {14, 21, 5, 0, 0},
Easy= {19, 21, 14, 42, 0},
Medium= {32, 37, 32, 87, 2},
Hard= {48, 42, 50, 37, 23},
Challenge= {70, 53, 14, 20, 69},
},
["starmine"]
= {
Beginner= {23, 22, 3, 0, 0},
Easy= {40, 30, 10, 22, 0},
Medium= {62, 60, 38, 27, 22},
Hard= {92, 90, 63, 28, 72},
Challenge= {0, 0, 0, 0, 0},
},
["SPECIAL SUMMER CAMPAIGN!"]
= {
Beginner= {19, 20, 3, 0, 0},
Easy= {39, 41, 60, 15, 0},
Medium= {60, 56, 50, 20, 20},
Hard= {99, 98, 41, 31, 100},
Challenge= {0, 0, 0, 0, 0},
},
["阿波おどり -Awaodori- やっぱり踊りはやめられない"]
= {
Beginner= {27, 20, 3, 0, 0},
Easy= {45, 34, 32, 86, 7},
Medium= {63, 54, 30, 18, 43},
Hard= {91, 81, 5, 10, 103},
Challenge= {0, 0, 0, 0, 0},
},
["灼熱Beach Side Bunny"]
= {
Beginner= {25, 25, 16, 0, 0},
Easy= {41, 38, 70, 62, 1},
Medium= {68, 63, 104, 13, 40},
Hard= {97, 101, 128, 16, 103},
Challenge= {0, 0, 0, 0, 0},
},
["Cleopatrysm"]
= {
Beginner= {30, 31, 3, 9, 0},
Easy= {41, 31, 12, 18, 0},
Medium= {59, 55, 25, 20, 17},
Hard= {95, 94, 20, 19, 82},
Challenge= {0, 0, 0, 0, 0},
},
["御千手メディテーション"]
= {
Beginner= {25, 30, 7, 17, 0},
Easy= {44, 46, 27, 31, 4},
Medium= {63, 68, 21, 38, 36},
Hard= {93, 92, 18, 33, 101},
Challenge= {0, 0, 0, 0, 0},
},
["KHAMEN BREAK"]
= {
Beginner= {22, 21, 5, 21, 0},
Easy= {37, 35, 12, 42, 0},
Medium= {63, 64, 16, 37, 23},
Hard= {96, 100, 29, 38, 103},
Challenge= {0, 0, 0, 0, 0},
},
["Follow Tomorrow"]
= {
Beginner= {18, 17, 0, 4, 0},
Easy= {25, 23, 7, 52, 0},
Medium= {45, 40, 27, 16, 9},
Hard= {63, 52, 12, 10, 43},
Challenge= {0, 0, 0, 0, 0},
},
["FUJIMORI -祭- FESTIVAL"]
= {
Beginner= {24, 26, 1, 3, 0},
Easy= {34, 26, 9, 13, 0},
Medium= {54, 46, 41, 25, 10},
Hard= {74, 72, 36, 16, 37},
Challenge= {0, 0, 0, 0, 0},
},
["Adularia"]
= {
Beginner= {23, 30, 0, 8, 0},
Easy= {31, 30, 5, 38, 0},
Medium= {50, 60, 32, 41, 11},
Hard= {73, 82, 20, 51, 52},
Challenge= {0, 0, 0, 0, 0},
},
["Nostalgia Is Lost"]
= {
Beginner= {20, 21, 0, 19, 0},
Easy= {38, 35, 18, 37, 1},
Medium= {62, 57, 20, 48, 18},
Hard= {96, 93, 40, 34, 97},
Challenge= {0, 0, 0, 0, 0},
},
["JOMANDA"]
= {
Beginner= {23, 30, 0, 33, 4},
Easy= {40, 37, 3, 50, 9},
Medium= {62, 68, 1, 65, 71},
Hard= {79, 90, 14, 54, 107},
Challenge= {104, 110, 25, 34, 119},
},
["嘆きの樹"]
= {
Beginner= {22, 26, 7, 30, 0},
Easy= {46, 40, 29, 59, 8},
Medium= {72, 53, 21, 33, 35},
Hard= {114, 103, 94, 23, 105},
Challenge= {144, 116, 87, 42, 111},
},
["Habibe (Antuh muhleke)"]
= {
Beginner= {20, 23, 12, 0, 0},
Easy= {27, 23, 20, 19, 0},
Medium= {57, 47, 56, 0, 23},
Hard= {77, 60, 54, 0, 57},
Challenge= {0, 0, 0, 0, 0},
},
["SUPER HERO"]
= {
Beginner= {24, 30, 16, 4, 0},
Easy= {31, 30, 20, 9, 0},
Medium= {53, 52, 45, 7, 10},
Hard= {69, 60, 56, 8, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Party Lights (Tommie Sunshine's Brooklyn Fire Remix)"]
= {
Beginner= {17, 16, 0, 0, 0},
Easy= {33, 21, 1, 32, 0},
Medium= {46, 43, 5, 72, 10},
Hard= {54, 54, 0, 30, 29},
Challenge= {0, 0, 0, 0, 0},
},
["Idola"]
= {
Beginner= {20, 25, 1, 12, 0},
Easy= {43, 58, 25, 45, 2},
Medium= {66, 67, 45, 64, 17},
Hard= {98, 108, 25, 43, 99},
Challenge= {104, 117, 47, 58, 102},
},
["ドキドキ☆流星トラップガール!!"]
= {
Beginner= {23, 23, 5, 4, 0},
Easy= {36, 23, 18, 17, 0},
Medium= {56, 46, 30, 9, 15},
Hard= {87, 81, 34, 18, 101},
Challenge= {0, 0, 0, 0, 0},
},
["second spring storm"]
= {
Beginner= {21, 16, 1, 0, 0},
Easy= {34, 27, 12, 25, 1},
Medium= {54, 43, 32, 59, 19},
Hard= {80, 70, 87, 15, 100},
Challenge= {0, 0, 0, 0, 0},
},
["Strobe♡Girl"]
= {
Beginner= {25, 23, 5, 0, 0},
Easy= {46, 39, 12, 23, 1},
Medium= {56, 55, 50, 32, 12},
Hard= {83, 94, 65, 53, 47},
Challenge= {0, 0, 0, 0, 0},
},
["IMANOGUILTS"]
= {
Beginner= {28, 30, 1, 26, 9},
Easy= {50, 45, 43, 30, 30},
Medium= {75, 60, 36, 8, 59},
Hard= {107, 90, 30, 8, 105},
Challenge= {119, 103, -1, -1, -1},
},
["ちゅ～いん☆バニー"]
= {
Beginner= {19, 22, 1, 0, 0},
Easy= {31, 30, 10, 30, 0},
Medium= {47, 44, 27, 36, 7},
Hard= {63, 52, 41, 24, 20},
Challenge= {75, 75, 105, 32, 42},
},
["Din Don Dan"]
= {
Beginner= {16, 17, 0, 0, 0},
Easy= {31, 23, 5, 7, 0},
Medium= {44, 40, 40, 16, 7},
Hard= {62, 52, 25, 20, 43},
Challenge= {73, 58, 29, 16, 52},
},
["ヤマトなでなで♡かぐや姫"]
= {
Beginner= {18, 20, 0, 8, 0},
Easy= {34, 33, 21, 67, 0},
Medium= {43, 46, 29, 51, 5},
Hard= {60, 53, 27, 52, 18},
Challenge= {80, 86, 29, 94, 72},
},
["Elysium"]
= {
Beginner= {14, 11, 0, 0, 0},
Easy= {34, 23, 7, 15, 0},
Medium= {49, 36, 7, 59, 12},
Hard= {57, 54, 10, 93, 25},
Challenge= {83, 72, 16, 57, 100},
},
["恋はどう？モロ◎波動OK☆方程式!!"]
= {
Beginner= {25, 29, 1, 0, 0},
Easy= {43, 38, 10, 34, 0},
Medium= {64, 68, 16, 27, 10},
Hard= {91, 97, 25, 39, 32},
Challenge= {0, 0, 0, 0, 0},
},
["デッドボヲルdeホームラン"]
= {
Beginner= {22, 24, 3, 0, 0},
Easy= {33, 30, 30, 26, 0},
Medium= {49, 48, 45, 61, 11},
Hard= {76, 78, 32, 30, 77},
Challenge= {0, 0, 0, 0, 0},
},
["轟け!恋のビーンボール!!"]
= {
Beginner= {28, 30, 1, 14, 0},
Easy= {40, 30, 54, 13, 0},
Medium= {64, 60, 72, 15, 19},
Hard= {108, 110, 58, 6, 101},
Challenge= {0, 0, 0, 0, 0},
},
["星屑のキロク"]
= {
Beginner= {18, 22, 3, 12, 0},
Easy= {38, 37, 9, 60, 1},
Medium= {53, 45, 21, 87, 12},
Hard= {65, 60, 27, 88, 23},
Challenge= {0, 0, 0, 0, 0},
},
["マインド・ゲーム"]
= {
Beginner= {23, 22, 0, 0, 0},
Easy= {41, 30, 38, 43, 0},
Medium= {58, 60, 54, 47, 14},
Hard= {88, 82, 23, 35, 64},
Challenge= {0, 0, 0, 0, 0},
},
["野球の遊び方　そしてその歴史　～決定版～"]
= {
Beginner= {23, 17, 5, 4, 0},
Easy= {32, 29, 38, 37, 0},
Medium= {44, 46, 43, 37, 9},
Hard= {70, 76, 69, 28, 63},
Challenge= {0, 0, 0, 0, 0},
},
["ÆTHER"]
= {
Beginner= {36, 54, 14, 15, 0},
Easy= {62, 68, 36, 31, 3},
Medium= {92, 104, 56, 23, 15},
Hard= {132, 111, 87, 13, 45},
Challenge= {0, 0, 0, 0, 0},
},
["Daily Lunch Special"]
= {
Beginner= {25, 34, 0, 12, 0},
Easy= {40, 42, 5, 65, 0},
Medium= {58, 59, 10, 89, 14},
Hard= {88, 85, 50, 73, 51},
Challenge= {0, 0, 0, 0, 0},
},
["Dispersion Star"]
= {
Beginner= {20, 22, 0, 16, 0},
Easy= {34, 30, 1, 37, 0},
Medium= {56, 44, 0, 51, 14},
Hard= {75, 89, 10, 51, 55},
Challenge= {0, 0, 0, 0, 0},
},
["Do The Evolution"]
= {
Beginner= {17, 18, 1, 0, 0},
Easy= {25, 24, 9, 23, 0},
Medium= {40, 43, 18, 47, 5},
Hard= {54, 49, 30, 55, 17},
Challenge= {0, 0, 0, 0, 0},
},
["Engraved Mark"]
= {
Beginner= {24, 31, 7, 0, 0},
Easy= {45, 46, 20, 51, 5},
Medium= {76, 62, 25, 20, 30},
Hard= {101, 112, 16, 21, 102},
Challenge= {0, 0, 0, 0, 0},
},
["esrev:eR"]
= {
Beginner= {21, 25, 0, 26, 0},
Easy= {33, 25, 9, 68, 0},
Medium= {53, 51, 10, 49, 12},
Hard= {81, 64, 20, 60, 74},
Challenge= {0, 0, 0, 0, 0},
},
["HYENA"]
= {
Beginner= {26, 28, 3, 0, 0},
Easy= {38, 28, 7, 53, 0},
Medium= {56, 56, 25, 65, 15},
Hard= {81, 85, 23, 43, 70},
Challenge= {0, 0, 0, 0, 0},
},
["PUNISHER"]
= {
Beginner= {23, 22, 9, 22, 0},
Easy= {37, 30, 21, 58, 0},
Medium= {64, 52, 23, 35, 22},
Hard= {87, 75, 25, 33, 75},
Challenge= {0, 0, 0, 0, 0},
},
["Romancing Layer"]
= {
Beginner= {25, 25, 0, 0, 0},
Easy= {36, 31, 23, 46, 1},
Medium= {58, 50, 10, 26, 20},
Hard= {92, 75, 18, 24, 101},
Challenge= {0, 0, 0, 0, 0},
},
["SABER WING (satellite silhouette remix)"]
= {
Beginner= {16, 17, 1, 9, 0},
Easy= {25, 22, 3, 28, 0},
Medium= {47, 40, 3, 42, 20},
Hard= {69, 68, 5, 27, 77},
Challenge= {95, 91, 36, 16, 105},
},
["Stella Sinistra"]
= {
Beginner= {26, 28, 1, 19, 0},
Easy= {36, 28, 43, 36, 0},
Medium= {57, 58, 65, 52, 41},
Hard= {75, 87, 60, 59, 101},
Challenge= {0, 0, 0, 0, 0},
},
["Squeeze"]
= {
Beginner= {25, 25, 1, 10, 1},
Easy= {36, 25, 23, 69, 4},
Medium= {51, 43, 30, 51, 23},
Hard= {90, 81, 25, 34, 107},
Challenge= {0, 0, 0, 0, 0},
},
["True Blue"]
= {
Beginner= {21, 27, 10, 8, 0},
Easy= {37, 40, 21, 97, 1},
Medium= {63, 54, 23, 44, 24},
Hard= {101, 104, 29, 41, 104},
Challenge= {0, 0, 0, 0, 0},
},
["VEGA"]
= {
Beginner= {21, 23, 3, 5, 0},
Easy= {49, 39, 14, 24, 1},
Medium= {75, 63, 25, 30, 24},
Hard= {100, 95, 54, 36, 80},
Challenge= {0, 0, 0, 0, 0},
},
["IX"]
= {
Beginner= {36, 41, 3, 27, 0},
Easy= {58, 62, 23, 37, 7},
Medium= {86, 102, 21, 46, 54},
Hard= {147, 134, 32, 30, 111},
Challenge= {147, 139, 67, 48, 117},
},
["MITOれて！いばらきっしゅだ～りん"]
= {
Beginner= {20, 21, 0, 0, 0},
Easy= {39, 28, 10, 34, 0},
Medium= {55, 43, 40, 41, 8},
Hard= {79, 72, 63, 30, 39},
Challenge= {0, 0, 0, 0, 0},
},
["LoveLove DokiDoki"]
= {
Beginner= {15, 13, 5, 0, 0},
Easy= {42, 26, 14, 5, 0},
Medium= {61, 53, 32, 9, 21},
Hard= {78, 60, 32, 29, 43},
Challenge= {0, 0, 0, 0, 0},
},
["CAPTIVE"]
= {
Beginner= {20, 20, 0, 0, 0},
Easy= {31, 26, 7, 49, 0},
Medium= {44, 46, 32, 46, 3},
Hard= {64, 53, 52, 33, 18},
Challenge= {0, 0, 0, 0, 0},
},
["My HERO"]
= {
Beginner= {15, 17, 9, 17, 0},
Easy= {24, 23, 5, 14, 0},
Medium= {35, 34, 5, 23, 5},
Hard= {46, 46, 16, 48, 15},
Challenge= {0, 0, 0, 0, 0},
},
["ドリームキャッチャー"]
= {
Beginner= {30, 34, 5, 3, 0},
Easy= {37, 34, 30, 4, 0},
Medium= {63, 51, 52, 50, 4},
Hard= {74, 69, 78, 34, 13},
Challenge= {0, 0, 0, 0, 0},
},
["HAPPY☆きたかた"]
= {
Beginner= {15, 14, 5, 0, 0},
Easy= {27, 28, 1, 8, 0},
Medium= {49, 43, 18, 17, 6},
Hard= {63, 57, 50, 38, 18},
Challenge= {0, 0, 0, 0, 0},
},
["マーメイド"]
= {
Beginner= {17, 12, 5, 0, 0},
Easy= {35, 25, 5, 3, 0},
Medium= {46, 38, 20, 23, 13},
Hard= {65, 44, 27, 41, 28},
Challenge= {0, 0, 0, 0, 0},
},
["We are チャリンコエンジェルス"]
= {
Beginner= {19, 18, 0, 0, 0},
Easy= {27, 24, 0, 25, 0},
Medium= {42, 30, 0, 30, 5},
Hard= {55, 48, 30, 51, 19},
Challenge= {0, 0, 0, 0, 0},
},
["Everybody Say EDOGAWA"]
= {
Beginner= {11, 11, 9, 0, 0},
Easy= {31, 23, 5, 26, 0},
Medium= {44, 35, 32, 18, 6},
Hard= {61, 47, 38, 21, 20},
Challenge= {0, 0, 0, 0, 0},
},
["my cosmic world"]
= {
Beginner= {23, 23, 1, 3, 0},
Easy= {29, 23, 5, 13, 0},
Medium= {41, 28, 40, 21, 0},
Hard= {53, 46, 27, 18, 12},
Challenge= {0, 0, 0, 0, 0},
},
["Determination"]
= {
Beginner= {18, 19, 0, 0, 0},
Easy= {31, 38, 5, 41, 0},
Medium= {44, 47, 29, 85, 4},
Hard= {75, 76, 49, 52, 28},
Challenge= {0, 0, 0, 0, 0},
},
["川崎純情音頭"]
= {
Beginner= {18, 21, 3, 0, 0},
Easy= {27, 21, 7, 16, 0},
Medium= {40, 38, 40, 32, 5},
Hard= {56, 49, 14, 8, 17},
Challenge= {0, 0, 0, 0, 0},
},
["瞬間 I LOVE YOU"]
= {
Beginner= {15, 13, 3, 0, 0},
Easy= {40, 27, 10, 8, 0},
Medium= {57, 55, 14, 32, 13},
Hard= {70, 55, 54, 46, 24},
Challenge= {0, 0, 0, 0, 0},
},
["僕は君に恋をした"]
= {
Beginner= {20, 21, 1, 0, 0},
Easy= {32, 28, 10, 23, 0},
Medium= {47, 42, 21, 19, 6},
Hard= {67, 56, 18, 18, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Dong! Dong!"]
= {
Beginner= {37, 34, 0, 9, 0},
Easy= {43, 34, 0, 7, 0},
Medium= {63, 43, 40, 29, 2},
Hard= {75, 69, 81, 31, 28},
Challenge= {0, 0, 0, 0, 0},
},
["A to Z"]
= {
Beginner= {14, 16, 10, 0, 0},
Easy= {32, 32, 5, 34, 0},
Medium= {52, 64, 14, 71, 16},
Hard= {67, 64, 81, 49, 36},
Challenge= {0, 0, 0, 0, 0},
},
["ルシャナの気持ち"]
= {
Beginner= {18, 21, 0, 0, 0},
Easy= {34, 28, 0, 33, 0},
Medium= {43, 43, 25, 39, 2},
Hard= {64, 57, 32, 20, 17},
Challenge= {0, 0, 0, 0, 0},
},
["LUCKY-YO!!"]
= {
Beginner= {16, 13, 1, 0, 0},
Easy= {25, 18, 14, 21, 0},
Medium= {37, 32, 3, 23, 11},
Hard= {51, 37, 38, 29, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Boom! Boom! Miracle Emotion"]
= {
Beginner= {15, 19, 5, 9, 0},
Easy= {31, 25, 9, 15, 0},
Medium= {55, 51, 20, 6, 14},
Hard= {67, 58, 32, 12, 28},
Challenge= {0, 0, 0, 0, 0},
},
["ザッツ!KAIYODO"]
= {
Beginner= {20, 18, 7, 9, 0},
Easy= {31, 24, 10, 34, 0},
Medium= {43, 37, 38, 24, 7},
Hard= {60, 55, 27, 17, 23},
Challenge= {0, 0, 0, 0, 0},
},
["乙女の真骨頂"]
= {
Beginner= {23, 22, 1, 0, 0},
Easy= {34, 30, 12, 52, 0},
Medium= {47, 52, 23, 53, 5},
Hard= {67, 60, 38, 45, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Field on!"]
= {
Beginner= {15, 14, 1, 0, 0},
Easy= {33, 28, 3, 11, 0},
Medium= {56, 49, 14, 21, 9},
Hard= {69, 56, 21, 53, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Che Che Chelip～魔法のコトバ～"]
= {
Beginner= {18, 15, 1, 2, 0},
Easy= {27, 21, 1, 19, 0},
Medium= {40, 32, 18, 19, 3},
Hard= {51, 43, 5, 30, 15},
Challenge= {0, 0, 0, 0, 0},
},
["らいらら"]
= {
Beginner= {19, 19, 5, 12, 0},
Easy= {26, 25, 9, 43, 0},
Medium= {45, 38, 1, 30, 6},
Hard= {57, 51, 30, 50, 17},
Challenge= {0, 0, 0, 0, 0},
},
["HeartLatte"]
= {
Beginner= {15, 16, 1, 0, 0},
Easy= {26, 22, 3, 0, 0},
Medium= {43, 33, 7, 19, 10},
Hard= {65, 56, 7, 14, 46},
Challenge= {0, 0, 0, 0, 0},
},
["キライじゃないのぉ"]
= {
Beginner= {17, 23, 0, 35, 0},
Easy= {23, 23, 0, 38, 0},
Medium= {38, 35, 32, 80, 4},
Hard= {54, 47, 16, 63, 17},
Challenge= {0, 0, 0, 0, 0},
},
["ラブラブキュートなハピハピサンデー"]
= {
Beginner= {30, 20, 0, 0, 0},
Easy= {36, 27, 1, 2, 0},
Medium= {46, 41, 20, 2, 5},
Hard= {73, 55, 25, 1, 25},
Challenge= {0, 0, 0, 0, 0},
},
["ウッ－ウッーウマウマ(ﾟ∀ﾟ) (Speedcake Remix)"]
= {
Beginner= {16, 27, 0, 0, 0},
Easy= {36, 27, 18, 21, 0},
Medium= {50, 41, 43, 20, 6},
Hard= {66, 54, 43, 27, 23},
Challenge= {88, 82, 47, 21, 78},
},
["オリオンをなぞる"]
= {
Beginner= {14, 15, 0, 0, 0},
Easy= {31, 30, 18, 28, 0},
Medium= {46, 37, 34, 22, 6},
Hard= {63, 60, 14, 37, 20},
Challenge= {75, 60, 36, 6, 36},
},
["折れないハート"]
= {
Beginner= {13, 7, 1, 0, 0},
Easy= {25, 31, 1, 23, 0},
Medium= {52, 39, 14, 25, 4},
Hard= {66, 47, 38, 35, 15},
Challenge= {0, 0, 0, 0, 0},
},
["ジョジョ～その血の運命～"]
= {
Beginner= {15, 18, 0, 0, 0},
Easy= {25, 24, 9, 7, 0},
Medium= {52, 42, 18, 13, 16},
Hard= {68, 73, 40, 25, 51},
Challenge= {0, 0, 0, 0, 0},
},
["ずっとみつめていて (Ryu☆Remix)"]
= {
Beginner= {12, 13, 0, 0, 0},
Easy= {40, 26, 23, 27, 0},
Medium= {56, 40, 12, 22, 12},
Hard= {77, 53, 14, 20, 47},
Challenge= {104, 103, 3, 42, 102},
},
["つけまつける"]
= {
Beginner= {9, 8, 0, 0, 0},
Easy= {30, 24, 3, 13, 0},
Medium= {46, 36, 20, 25, 6},
Hard= {60, 42, 27, 30, 17},
Challenge= {61, 42, 54, 20, 17},
},
["ふりそでーしょん"]
= {
Beginner= {14, 16, 1, 0, 0},
Easy= {22, 25, 3, 14, 0},
Medium= {51, 50, 3, 21, 4},
Hard= {81, 66, 63, 24, 25},
Challenge= {0, 0, 0, 0, 0},
},
["マジLOVE1000%"]
= {
Beginner= {12, 10, 3, 0, 0},
Easy= {24, 21, 7, 68, 0},
Medium= {34, 32, 21, 77, 7},
Hard= {49, 43, 30, 32, 18},
Challenge= {31, 43, 78, 96, 16},
},
["ロンドンは夜8時 (LON 8PM - TYO 4AM)"]
= {
Beginner= {21, 22, 1, 23, 0},
Easy= {43, 37, 12, 16, 1},
Medium= {64, 52, 23, 15, 20},
Hard= {83, 60, 16, 0, 36},
Challenge= {0, 0, 0, 0, 0},
},
["ACROSS WORLD"]
= {
Beginner= {14, 15, 5, 0, 0},
Easy= {20, 23, 1, 54, 0},
Medium= {46, 38, 10, 2, 1},
Hard= {71, 61, 25, 2, 20},
Challenge= {82, 111, 81, 52, 70},
},
["BRIGHT STREAM"]
= {
Beginner= {13, 12, 1, 0, 0},
Easy= {21, 19, 1, 25, 0},
Medium= {37, 32, 14, 46, 3},
Hard= {51, 46, 30, 44, 10},
Challenge= {0, 0, 0, 0, 0},
},
["Burst The Gravity"]
= {
Beginner= {17, 18, 7, 15, 0},
Easy= {32, 24, 5, 25, 0},
Medium= {49, 43, 20, 27, 10},
Hard= {61, 49, 20, 27, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Choo Choo TRAIN"]
= {
Beginner= {8, 9, 0, 5, 0},
Easy= {18, 14, 1, 17, 0},
Medium= {31, 23, 7, 34, 3},
Hard= {40, 33, 20, 32, 15},
Challenge= {0, 0, 0, 0, 0},
},
["JOKER"]
= {
Beginner= {15, 13, 1, 0, 0},
Easy= {23, 20, 1, 27, 0},
Medium= {54, 40, 20, 7, 14},
Hard= {73, 53, 34, 29, 42},
Challenge= {84, 73, 96, 19, 94},
},
["LOVE & JOY -Risk Junk MIX-"]
= {
Beginner= {22, 22, 9, 0, 0},
Easy= {30, 30, 5, 12, 0},
Medium= {64, 44, 41, 25, 12},
Hard= {87, 82, 61, 21, 41},
Challenge= {0, 0, 0, 0, 0},
},
["Mickey Mouse March(Eurobeat Version)"]
= {
Beginner= {14, 18, 0, 0, 0},
Easy= {32, 25, 10, 15, 0},
Medium= {43, 44, 36, 21, 6},
Hard= {66, 56, 21, 6, 35},
Challenge= {0, 0, 0, 0, 0},
},
["Starry HEAVEN"]
= {
Beginner= {15, 15, 1, 0, 0},
Easy= {24, 23, 7, 24, 1},
Medium= {39, 39, 14, 33, 3},
Hard= {56, 63, 23, 32, 16},
Challenge= {67, 79, 74, 26, 38},
},
["お米の美味しい炊き方、そしてお米を食べることによるその効果。"]
= {
Beginner= {31, 23, 7, 25, 0},
Easy= {50, 39, 10, 26, 3},
Medium= {87, 63, 12, 18, 34},
Hard= {128, 105, 41, 10, 102},
Challenge= {0, 0, 0, 0, 0},
},
["からふるぱすてる"]
= {
Beginner= {23, 23, 1, 0, 0},
Easy= {44, 31, 9, 25, 0},
Medium= {66, 62, 41, 29, 15},
Hard= {93, 93, 20, 33, 46},
Challenge= {0, 0, 0, 0, 0},
},
["キケンな果実"]
= {
Beginner= {18, 21, 0, 17, 0},
Easy= {35, 28, 12, 57, 0},
Medium= {54, 43, 7, 56, 12},
Hard= {79, 79, 20, 34, 42},
Challenge= {0, 0, 0, 0, 0},
},
["晴天Bon Voyage"]
= {
Beginner= {23, 28, 1, 4, 0},
Easy= {37, 38, 3, 22, 1},
Medium= {51, 47, 16, 56, 6},
Hard= {64, 67, 27, 84, 16},
Challenge= {0, 0, 0, 0, 0},
},
["創世ノート"]
= {
Beginner= {13, 25, 9, 39, 0},
Easy= {42, 50, 20, 57, 2},
Medium= {57, 58, 25, 61, 14},
Hard= {81, 66, 58, 42, 39},
Challenge= {0, 0, 0, 0, 0},
},
["ちくわパフェだよ☆CKP"]
= {
Beginner= {22, 25, 3, 0, 0},
Easy= {36, 42, 1, 23, 1},
Medium= {51, 42, 20, 24, 4},
Hard= {64, 68, 45, 19, 15},
Challenge= {0, 0, 0, 0, 0},
},
["†渚の小悪魔ラヴリィ～レイディオ†"]
= {
Beginner= {22, 23, 0, 0, 0},
Easy= {44, 31, 16, 52, 0},
Medium= {69, 63, 23, 63, 18},
Hard= {109, 113, 54, 27, 86},
Challenge= {56, 55, 96, 49, 10},
},
["虹色の花"]
= {
Beginner= {16, 14, 5, 5, 0},
Easy= {34, 28, 9, 83, 0},
Medium= {54, 42, 52, 39, 9},
Hard= {73, 56, 41, 26, 25},
Challenge= {0, 0, 0, 0, 0},
},
["フー・フローツ"]
= {
Beginner= {25, 30, 1, 0, 0},
Easy= {39, 30, 5, 22, 0},
Medium= {60, 52, 27, 19, 15},
Hard= {79, 67, 30, 16, 40},
Challenge= {0, 0, 0, 0, 0},
},
["めうめうぺったんたん!!"]
= {
Beginner= {22, 30, 0, 31, 0},
Easy= {35, 30, 16, 24, 0},
Medium= {56, 46, 34, 24, 9},
Hard= {72, 84, 41, 24, 30},
Challenge= {0, 0, 0, 0, 0},
},
["ラキラキ"]
= {
Beginner= {14, 13, 12, 22, 0},
Easy= {47, 40, 30, 40, 4},
Medium= {64, 54, 18, 40, 22},
Hard= {82, 61, 21, 37, 63},
Challenge= {0, 0, 0, 0, 0},
},
["凛として咲く花の如く ～ひなビタ♪ edition～"]
= {
Beginner= {24, 27, 5, 33, 0},
Easy= {29, 27, 1, 39, 0},
Medium= {46, 40, 18, 63, 4},
Hard= {64, 54, 18, 66, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Ah La La La"]
= {
Beginner= {18, 16, 0, 0, 0},
Easy= {28, 21, 3, 57, 0},
Medium= {35, 27, 30, 45, 6},
Hard= {69, 48, 10, 20, 49},
Challenge= {0, 0, 0, 0, 0},
},
["Air Heroes"]
= {
Beginner= {21, 21, 1, 0, 0},
Easy= {54, 50, 32, 67, 7},
Medium= {65, 50, 21, 62, 20},
Hard= {103, 108, 25, 36, 100},
Challenge= {162, 108, 29, 56, 111},
},
["Another Phase"]
= {
Beginner= {24, 25, 3, 35, 0},
Easy= {53, 38, 3, 9, 9},
Medium= {64, 51, 14, 11, 40},
Hard= {122, 102, 30, 11, 109},
Challenge= {126, 102, 60, 11, 110},
},
["Back In Your Arms"]
= {
Beginner= {14, 10, 7, 0, 0},
Easy= {29, 21, 12, 36, 0},
Medium= {46, 38, 5, 36, 12},
Hard= {58, 43, 12, 42, 29},
Challenge= {0, 0, 0, 0, 0},
},
["Beautiful Dream"]
= {
Beginner= {19, 15, 3, 0, 0},
Easy= {45, 30, 23, 13, 0},
Medium= {51, 52, 18, 27, 9},
Hard= {69, 60, 45, 41, 22},
Challenge= {96, 110, 56, 64, 98},
},
["Blew My Mind"]
= {
Beginner= {25, 25, 0, 4, 0},
Easy= {57, 77, 23, 24, 2},
Medium= {83, 115, 29, 19, 24},
Hard= {131, 141, 81, 11, 83},
Challenge= {162, 200, 98, 23, 103},
},
["Bombay Bomb"]
= {
Beginner= {21, 18, 3, 0, 0},
Easy= {33, 30, 12, 58, 2},
Medium= {59, 42, 0, 0, 15},
Hard= {81, 54, 0, 0, 43},
Challenge= {0, 0, 0, 0, 0},
},
["Children of the Beat"]
= {
Beginner= {13, 13, 0, 0, 0},
Easy= {33, 26, 54, 28, 0},
Medium= {51, 46, 32, 60, 8},
Hard= {60, 53, 81, 44, 13},
Challenge= {72, 53, 72, 24, 23},
},
["Chinese Snowy Dance"]
= {
Beginner= {26, 28, 3, 36, 0},
Easy= {43, 43, 16, 80, 3},
Medium= {70, 65, 7, 62, 45},
Hard= {128, 108, 5, 58, 105},
Challenge= {0, 0, 0, 0, 0},
},
["Condor"]
= {
Beginner= {18, 23, 5, 0, 0},
Easy= {37, 35, 21, 49, 1},
Medium= {50, 41, 25, 48, 17},
Hard= {72, 70, 10, 27, 70},
Challenge= {95, 94, 32, 70, 104},
},
["Confession"]
= {
Beginner= {12, 12, 1, 11, 0},
Easy= {20, 25, 10, 40, 0},
Medium= {38, 37, 27, 56, 4},
Hard= {58, 50, 47, 74, 30},
Challenge= {89, 93, 52, 40, 101},
},
["Desert Journey"]
= {
Beginner= {15, 17, 14, 0, 0},
Easy= {27, 23, 14, 3, 0},
Medium= {43, 46, 29, 21, 7},
Hard= {68, 58, 16, 40, 46},
Challenge= {93, 87, 58, 26, 103},
},
["Diamond Night"]
= {
Beginner= {14, 16, 0, 22, 0},
Easy= {23, 22, 3, 32, 0},
Medium= {42, 33, 14, 42, 9},
Hard= {60, 50, 1, 43, 34},
Challenge= {78, 73, 14, 43, 100},
},
["Elemental Creation"]
= {
Beginner= {44, 54, 10, 36, 0},
Easy= {68, 111, 5, 29, 11},
Medium= {96, 131, 14, 29, 24},
Hard= {145, 145, 47, 23, 70},
Challenge= {165, 152, 49, 23, 96},
},
["Empathetic"]
= {
Beginner= {24, 22, 5, 42, 0},
Easy= {44, 37, 9, 21, 1},
Medium= {70, 60, 14, 24, 26},
Hard= {82, 82, 10, 24, 75},
Challenge= {0, 0, 0, 0, 0},
},
["escape"]
= {
Beginner= {23, 23, 0, 0, 0},
Easy= {33, 23, 5, 11, 0},
Medium= {46, 34, 38, 19, 8},
Hard= {59, 46, 49, 19, 20},
Challenge= {81, 52, 109, 25, 76},
},
["Everything I Need"]
= {
Beginner= {11, 15, 0, 0, 0},
Easy= {20, 15, 1, 72, 0},
Medium= {31, 27, 7, 113, 7},
Hard= {42, 35, 1, 89, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Find The Way"]
= {
Beginner= {18, 27, 3, 54, 0},
Easy= {36, 27, 16, 62, 0},
Medium= {57, 55, 12, 34, 16},
Hard= {75, 96, 30, 34, 43},
Challenge= {0, 0, 0, 0, 0},
},
["GAIA"]
= {
Beginner= {21, 22, 10, 8, 0},
Easy= {54, 51, 14, 36, 12},
Medium= {78, 74, 27, 24, 46},
Hard= {117, 109, 0, 0, 107},
Challenge= {0, 0, 0, 0, 0},
},
["heron"]
= {
Beginner= {21, 22, 0, 7, 0},
Easy= {40, 30, 7, 31, 0},
Medium= {57, 52, 69, 27, 9},
Hard= {81, 60, 60, 10, 37},
Challenge= {76, 75, 60, 21, 46},
},
["Hoping To Be Good"]
= {
Beginner= {17, 20, 3, 0, 0},
Easy= {23, 20, 3, 59, 0},
Medium= {40, 40, 7, 56, 8},
Hard= {59, 55, 0, 11, 40},
Challenge= {0, 0, 0, 0, 0},
},
["Magnetic"]
= {
Beginner= {22, 24, 0, 3, 0},
Easy= {46, 49, 7, 54, 7},
Medium= {66, 73, 12, 61, 50},
Hard= {97, 108, 18, 51, 105},
Challenge= {114, 102, 27, 68, 111},
},
["Monkey Business"]
= {
Beginner= {20, 23, 9, 0, 5},
Easy= {43, 46, 36, 36, 16},
Medium= {59, 80, 29, 67, 58},
Hard= {76, 97, 36, 29, 102},
Challenge= {122, 133, 30, 58, 133},
},
["New Generation"]
= {
Beginner= {24, 23, 14, 0, 0},
Easy= {40, 47, 9, 18, 3},
Medium= {69, 63, 9, 11, 19},
Hard= {95, 94, 5, 63, 66},
Challenge= {139, 113, 60, 25, 104},
},
["New Gravity"]
= {
Beginner= {22, 25, 5, 19, 0},
Easy= {42, 38, 14, 12, 0},
Medium= {58, 51, 5, 3, 19},
Hard= {73, 57, 16, 3, 39},
Challenge= {91, 89, 21, 3, 100},
},
["nightbird lost wing"]
= {
Beginner= {16, 14, 1, 0, 0},
Easy= {33, 29, 1, 39, 0},
Medium= {62, 51, 30, 36, 18},
Hard= {92, 74, 47, 26, 76},
Challenge= {0, 0, 0, 0, 0},
},
["PRANA"]
= {
Beginner= {28, 31, 9, 13, 0},
Easy= {50, 38, 10, 39, 7},
Medium= {69, 54, 38, 20, 33},
Hard= {91, 77, 60, 15, 70},
Challenge= {119, 112, 70, 17, 104},
},
["printemps"]
= {
Beginner= {23, 27, 0, 0, 0},
Easy= {32, 27, 3, 14, 0},
Medium= {50, 55, 18, 23, 13},
Hard= {74, 97, 20, 13, 76},
Challenge= {0, 0, 0, 0, 0},
},
["Qipchãq"]
= {
Beginner= {18, 18, 9, 9, 0},
Easy= {29, 25, 16, 25, 2},
Medium= {49, 43, 27, 40, 12},
Hard= {66, 50, 69, 35, 34},
Challenge= {0, 0, 0, 0, 0},
},
["RЁVOLUTIΦN"]
= {
Beginner= {20, 25, 0, 8, 0},
Easy= {44, 33, 3, 74, 0},
Medium= {64, 67, 58, 62, 10},
Hard= {94, 75, 43, 24, 38},
Challenge= {151, 117, 49, 24, 103},
},
["Right on time (Ryu☆Remix)"]
= {
Beginner= {20, 24, 0, 0, 0},
Easy= {36, 24, 61, 32, 0},
Medium= {52, 49, 38, 11, 16},
Hard= {77, 74, 78, 8, 85},
Challenge= {56, 49, 200, 17, 49},
},
["sola"]
= {
Beginner= {18, 16, 1, 2, 0},
Easy= {31, 22, 12, 34, 0},
Medium= {49, 44, 12, 66, 14},
Hard= {77, 56, 14, 25, 79},
Challenge= {0, 0, 0, 0, 0},
},
["Somehow You Found Me"]
= {
Beginner= {23, 30, 0, 0, 0},
Easy= {28, 30, 12, 0, 0},
Medium= {60, 52, 69, 9, 13},
Hard= {80, 67, 76, 0, 33},
Challenge= {136, 89, 45, 19, 101},
},
["south"]
= {
Beginner= {18, 17, 1, 0, 0},
Easy= {31, 23, 12, 13, 0},
Medium= {42, 40, 12, 22, 5},
Hard= {58, 40, 29, 47, 21},
Challenge= {58, 46, 125, 17, 49},
},
["Spanish Snowy Dance"]
= {
Beginner= {18, 30, 12, 0, 0},
Easy= {46, 37, 29, 73, 0},
Medium= {73, 60, 32, 16, 35},
Hard= {100, 89, 49, 68, 103},
Challenge= {141, 110, 54, 33, 107},
},
["Straight Oath"]
= {
Beginner= {19, 30, 3, 0, 0},
Easy= {43, 45, 18, 66, 2},
Medium= {59, 60, 30, 51, 14},
Hard= {86, 68, 38, 30, 42},
Challenge= {103, 110, 30, 72, 93},
},
["STULTI"]
= {
Beginner= {20, 27, 3, 78, 0},
Easy= {41, 48, 32, 65, 9},
Medium= {61, 62, 36, 82, 48},
Hard= {96, 90, 32, 56, 111},
Challenge= {0, 0, 0, 0, 0},
},
["Sucka Luva"]
= {
Beginner= {13, 9, 0, 0, 0},
Easy= {24, 19, 3, 12, 0},
Medium= {40, 39, 25, 9, 15},
Hard= {50, 44, 83, 9, 27},
Challenge= {0, 0, 0, 0, 0},
},
["Summer Fairytale"]
= {
Beginner= {14, 17, 7, 15, 0},
Easy= {23, 23, 7, 66, 0},
Medium= {33, 35, 25, 69, 2},
Hard= {38, 40, 29, 82, 6},
Challenge= {74, 64, 49, 28, 73},
},
["Sweet Rain"]
= {
Beginner= {24, 19, 5, 0, 0},
Easy= {35, 25, 10, 45, 0},
Medium= {53, 45, 27, 34, 16},
Hard= {75, 70, 25, 51, 53},
Challenge= {0, 0, 0, 0, 0},
},
["Synergy For Angels"]
= {
Beginner= {18, 20, 9, 37, 0},
Easy= {47, 40, 18, 30, 4},
Medium= {67, 46, 21, 28, 22},
Hard= {93, 86, 10, 22, 87},
Challenge= {0, 0, 0, 0, 0},
},
["Tell me what to do"]
= {
Beginner= {18, 18, 3, 0, 0},
Easy= {25, 24, 16, 3, 0},
Medium= {43, 42, 10, 100, 18},
Hard= {73, 60, 0, 7, 48},
Challenge= {88, 90, 14, 27, 100},
},
["The Island Song"]
= {
Beginner= {12, 14, 0, 0, 0},
Easy= {14, 14, 1, 28, 0},
Medium= {31, 28, 0, 40, 18},
Hard= {43, 38, 0, 6, 46},
Challenge= {77, 56, 45, 40, 106},
},
["THE REASON"]
= {
Beginner= {10, 11, 10, 0, 5},
Easy= {14, 15, 9, 46, 11},
Medium= {34, 42, 10, 36, 56},
Hard= {58, 50, 1, 21, 102},
Challenge= {79, 69, 124, 28, 115},
},
["The Wind of Gold"]
= {
Beginner= {26, 21, 1, 0, 0},
Easy= {43, 35, 30, 37, 0},
Medium= {56, 49, 36, 33, 24},
Hard= {87, 77, 74, 49, 100},
Challenge= {0, 0, 0, 0, 0},
},
["Top The Charts"]
= {
Beginner= {20, 20, 1, 0, 0},
Easy= {28, 26, 3, 16, 0},
Medium= {49, 40, 14, 29, 5},
Hard= {65, 66, 52, 46, 28},
Challenge= {91, 73, 101, 34, 78},
},
["Triple Journey -TAG EDITION-"]
= {
Beginner= {26, 30, 12, 33, 0},
Easy= {50, 45, 9, 29, 6},
Medium= {81, 60, 14, 28, 37},
Hard= {135, 110, 34, 20, 106},
Challenge= {175, 110, 63, 18, 112},
},
["WILD SIDE"]
= {
Beginner= {20, 27, 16, 0, 0},
Easy= {41, 34, 20, 42, 0},
Medium= {55, 47, 29, 17, 14},
Hard= {64, 55, 27, 53, 30},
Challenge= {80, 68, 38, 49, 61},
},
["Windy Fairy"]
= {
Beginner= {18, 30, 0, 2, 0},
Easy= {39, 30, 5, 45, 0},
Medium= {58, 60, 32, 44, 13},
Hard= {94, 97, 10, 51, 100},
Challenge= {0, 0, 0, 0, 0},
},
["Wow Wow VENUS"]
= {
Beginner= {15, 12, 0, 0, 0},
Easy= {27, 26, 1, 84, 0},
Medium= {47, 45, 41, 48, 9},
Hard= {62, 58, 49, 35, 29},
Challenge= {0, 0, 0, 0, 0},
},
["You"]
= {
Beginner= {9, 9, 0, 9, 0},
Easy= {18, 11, 0, 72, 0},
Medium= {28, 20, 9, 111, 10},
Hard= {40, 36, 0, 95, 53},
Challenge= {0, 0, 0, 0, 0},
},
["ヘビーローテーション"]
= {
Beginner= {13, 14, 0, 0, 0},
Easy= {25, 29, 5, 41, 0},
Medium= {46, 44, 67, 56, 2},
Hard= {60, 58, 90, 64, 11},
Challenge= {0, 0, 0, 0, 0},
},
["女々しくて"]
= {
Beginner= {15, 17, 3, 0, 0},
Easy= {27, 23, 0, 13, 0},
Medium= {41, 29, 1, 35, 4},
Hard= {55, 83, 10, 35, 31},
Challenge= {50, 47, 105, 99, 55},
},
["COME BACK TO MY HEART"]
= {
Beginner= {15, 17, 0, 0, 0},
Easy= {28, 23, 3, 35, 0},
Medium= {43, 41, 23, 45, 6},
Hard= {56, 64, 23, 66, 33},
Challenge= {36, 23, 47, 51, 0},
},
["future gazer"]
= {
Beginner= {14, 17, 1, 10, 0},
Easy= {23, 22, 1, 29, 0},
Medium= {31, 28, 12, 70, 2},
Hard= {48, 45, 23, 59, 11},
Challenge= {42, 40, 72, 31, 28},
},
["LOVE & JOY"]
= {
Beginner= {20, 21, 1, 0, 0},
Easy= {36, 28, 1, 15, 0},
Medium= {56, 50, 45, 22, 7},
Hard= {71, 50, 65, 10, 23},
Challenge= {0, 0, 0, 0, 0},
},
["STRAIGHT JET"]
= {
Beginner= {16, 19, 0, 4, 0},
Easy= {28, 25, 1, 25, 0},
Medium= {41, 31, 25, 66, 2},
Hard= {60, 51, 25, 71, 20},
Challenge= {0, 0, 0, 0, 0},
},
["アルストロメリア (walk with you remix)"]
= {
Beginner= {20, 18, 3, 36, 0},
Easy= {34, 24, 7, 58, 0},
Medium= {47, 49, 29, 51, 7},
Hard= {63, 61, 10, 36, 28},
Challenge= {73, 74, 38, 21, 67},
},
["紅焔"]
= {
Beginner= {19, 14, 1, 8, 0},
Easy= {35, 28, 5, 27, 0},
Medium= {54, 50, 43, 46, 8},
Hard= {74, 58, 36, 30, 34},
Challenge= {113, 101, 74, 30, 102},
},
["雫"]
= {
Beginner= {18, 17, 0, 0, 0},
Easy= {24, 26, 0, 49, 0},
Medium= {56, 61, 9, 38, 6},
Hard= {74, 69, 29, 69, 26},
Challenge= {0, 0, 0, 0, 0},
},
["隅田川夏恋歌"]
= {
Beginner= {18, 22, 3, 9, 0},
Easy= {31, 30, 5, 15, 0},
Medium= {63, 52, 23, 12, 11},
Hard= {86, 60, 14, 0, 31},
Challenge= {108, 110, 85, 20, 90},
},
["天上の星～黎明記～"]
= {
Beginner= {19, 20, 0, 0, 0},
Easy= {31, 26, 1, 21, 0},
Medium= {44, 46, 10, 36, 6},
Hard= {64, 87, 16, 105, 34},
Challenge= {0, 0, 0, 0, 0},
},
["ビューティフル レシート"]
= {
Beginner= {22, 24, 1, 23, 0},
Easy= {41, 32, 20, 78, 0},
Medium= {55, 48, 38, 92, 9},
Hard= {68, 89, 36, 88, 34},
Challenge= {0, 0, 0, 0, 0},
},
["繚乱ヒットチャート"]
= {
Beginner= {17, 15, 1, 15, 0},
Easy= {34, 31, 5, 53, 0},
Medium= {50, 47, 21, 68, 3},
Hard= {75, 63, 32, 46, 25},
Challenge= {0, 0, 0, 0, 0},
},
["恋閃繚乱"]
= {
Beginner= {15, 17, 1, 0, 0},
Easy= {31, 29, 20, 56, 0},
Medium= {42, 35, 12, 48, 7},
Hard= {63, 46, 21, 17, 29},
Challenge= {94, 94, 50, 31, 103},
},
["Amalgamation"]
= {
Beginner= {28, 27, 7, 17, 0},
Easy= {49, 40, 36, 44, 4},
Medium= {64, 54, 14, 20, 21},
Hard= {85, 81, 23, 16, 73},
Challenge= {96, 100, 43, 20, 101},
},
["BRILLIANT 2U (AKBK MIX)"]
= {
Beginner= {23, 20, 0, 12, 0},
Easy= {48, 47, 36, 27, 2},
Medium= {75, 54, 27, 24, 37},
Hard= {118, 104, 63, 25, 105},
Challenge= {0, 0, 0, 0, 0},
},
["Chronos"]
= {
Beginner= {11, 10, 0, 44, 0},
Easy= {20, 15, 21, 78, 3},
Medium= {40, 42, 7, 78, 19},
Hard= {64, 58, 65, 35, 58},
Challenge= {94, 85, 80, 31, 105},
},
["Cosmic Hurricane"]
= {
Beginner= {16, 15, 1, 18, 0},
Easy= {34, 31, 3, 32, 0},
Medium= {52, 54, 29, 45, 7},
Hard= {78, 69, 14, 35, 37},
Challenge= {97, 104, 36, 82, 100},
},
["CRAZY♥LOVE"]
= {
Beginner= {21, 27, 14, 53, 0},
Easy= {35, 34, 14, 63, 0},
Medium= {76, 75, 50, 76, 51},
Hard= {95, 101, 87, 57, 100},
Challenge= {0, 0, 0, 0, 0},
},
["Diamond Dust"]
= {
Beginner= {14, 12, 1, 0, 0},
Easy= {29, 24, 3, 46, 0},
Medium= {36, 37, 41, 63, 4},
Hard= {50, 43, 43, 70, 25},
Challenge= {62, 61, 96, 41, 64},
},
["dreaming can make a wish come true"]
= {
Beginner= {15, 23, 3, 25, 0},
Easy= {23, 23, 5, 38, 0},
Medium= {43, 35, 14, 35, 5},
Hard= {56, 53, 23, 34, 20},
Challenge= {0, 0, 0, 0, 0},
},
["ever snow"]
= {
Beginner= {18, 18, 0, 0, 0},
Easy= {24, 24, 10, 29, 0},
Medium= {50, 42, 29, 23, 13},
Hard= {76, 60, 36, 18, 46},
Challenge= {0, 0, 0, 0, 0},
},
["Fever"]
= {
Beginner= {14, 22, 1, 0, 0},
Easy= {25, 22, 1, 11, 0},
Medium= {39, 33, 14, 33, 3},
Hard= {46, 38, 9, 68, 10},
Challenge= {0, 0, 0, 0, 0},
},
["Find You Again"]
= {
Beginner= {13, 25, 7, 29, 0},
Easy= {25, 25, 3, 33, 0},
Medium= {41, 37, 25, 21, 8},
Hard= {61, 62, 16, 32, 40},
Challenge= {0, 0, 0, 0, 0},
},
["FLOWER"]
= {
Beginner= {16, 21, 5, 51, 0},
Easy= {35, 28, 12, 70, 0},
Medium= {59, 50, 16, 16, 16},
Hard= {72, 57, 50, 17, 40},
Challenge= {97, 93, 69, 25, 103},
},
["Get Back Up!"]
= {
Beginner= {18, 12, 1, 0, 0},
Easy= {35, 25, 10, 50, 1},
Medium= {51, 45, 12, 30, 10},
Hard= {63, 57, 32, 32, 42},
Challenge= {0, 0, 0, 0, 0},
},
["Go For The Top"]
= {
Beginner= {31, 29, 5, 46, 0},
Easy= {49, 44, 38, 64, 6},
Medium= {74, 66, 30, 27, 56},
Hard= {106, 105, 23, 34, 109},
Challenge= {157, 108, 40, 30, 129},
},
["Haunted Rhapsody"]
= {
Beginner= {20, 19, 3, 0, 0},
Easy= {26, 19, 21, 34, 0},
Medium= {41, 51, 9, 51, 3},
Hard= {69, 64, 1, 39, 39},
Challenge= {0, 0, 0, 0, 0},
},
["HEART BEAT FORMULA"]
= {
Beginner= {20, 19, 3, 29, 0},
Easy= {51, 47, 0, 21, 0},
Medium= {66, 47, 3, 38, 11},
Hard= {89, 76, 18, 23, 27},
Challenge= {0, 0, 0, 0, 0},
},
["HEARTBREAK (Sound Slektaz remix)"]
= {
Beginner= {14, 18, 0, 2, 0},
Easy= {24, 24, 3, 38, 0},
Medium= {35, 30, 21, 57, 0},
Hard= {51, 55, 43, 41, 14},
Challenge= {0, 0, 0, 0, 0},
},
["I/O"]
= {
Beginner= {17, 18, 1, 0, 0},
Easy= {28, 25, 0, 24, 0},
Medium= {47, 43, 18, 42, 5},
Hard= {72, 62, 27, 22, 50},
Challenge= {0, 0, 0, 0, 0},
},
["In The Air"]
= {
Beginner= {20, 17, 10, 0, 0},
Easy= {33, 23, 0, 55, 0},
Medium= {44, 34, 5, 83, 5},
Hard= {68, 46, 0, 13, 30},
Challenge= {0, 0, 0, 0, 0},
},
["IN THE ZONE"]
= {
Beginner= {11, 15, 1, 14, 0},
Easy= {18, 15, 7, 25, 0},
Medium= {41, 36, 18, 38, 7},
Hard= {55, 46, 40, 30, 21},
Challenge= {0, 0, 0, 0, 0},
},
["KEEP ON MOVIN' (Y&Co. DJ BOSS remix)"]
= {
Beginner= {14, 15, 0, 0, 0},
Easy= {37, 31, 38, 55, 1},
Medium= {55, 42, 29, 44, 18},
Hard= {87, 85, 45, 10, 102},
Challenge= {0, 0, 0, 0, 0},
},
["Let's Get Away"]
= {
Beginner= {14, 12, 5, 34, 0},
Easy= {21, 25, 5, 28, 0},
Medium= {41, 50, 16, 22, 5},
Hard= {52, 50, 25, 19, 14},
Challenge= {0, 0, 0, 0, 0},
},
["London EVOLVED ver.A"]
= {
Beginner= {25, 39, 5, 9, 0},
Easy= {46, 78, 7, 17, 2},
Medium= {66, 133, 21, 2, 33},
Hard= {85, 177, 20, 4, 96},
Challenge= {132, 177, 54, 2, 105},
},
["London EVOLVED ver.B"]
= {
Beginner= {28, 52, 14, 4, 0},
Easy= {51, 52, 14, 10, 0},
Medium= {68, 78, 29, 35, 6},
Hard= {87, 102, 27, 48, 14},
Challenge= {135, 129, 67, 64, 73},
},
["London EVOLVED ver.C"]
= {
Beginner= {28, 49, 9, 7, 0},
Easy= {51, 49, 16, 11, 0},
Medium= {69, 74, 36, 2, 5},
Hard= {87, 99, 25, 1, 15},
Challenge= {148, 124, 60, 1, 72},
},
["LOVE IS THE POWER -Re:born-"]
= {
Beginner= {16, 20, 1, 2, 0},
Easy= {30, 25, 3, 10, 1},
Medium= {40, 31, 1, 23, 6},
Hard= {52, 57, 5, 26, 39},
Challenge= {0, 0, 0, 0, 0},
},
["MAGIC PARADE"]
= {
Beginner= {10, 15, 0, 17, 0},
Easy= {20, 15, 1, 0, 0},
Medium= {40, 31, 16, 0, 8},
Hard= {60, 42, 5, 6, 39},
Challenge= {0, 0, 0, 0, 0},
},
["Mermaid girl"]
= {
Beginner= {16, 17, 1, 8, 0},
Easy= {30, 23, 0, 12, 0},
Medium= {43, 34, 52, 5, 5},
Hard= {61, 46, 18, 0, 40},
Challenge= {63, 46, 49, 0, 41},
},
["message"]
= {
Beginner= {15, 12, 1, 0, 0},
Easy= {31, 25, 5, 15, 0},
Medium= {47, 31, 12, 32, 6},
Hard= {62, 50, 25, 46, 23},
Challenge= {0, 0, 0, 0, 0},
},
["NEPHILIM DELTA"]
= {
Beginner= {31, 36, 7, 8, 0},
Easy= {55, 45, 14, 28, 1},
Medium= {89, 73, 7, 16, 29},
Hard= {122, 73, 14, 19, 53},
Challenge= {0, 0, 0, 0, 0},
},
["New Beginning"]
= {
Beginner= {18, 18, 0, 3, 0},
Easy= {31, 24, 1, 6, 0},
Medium= {46, 37, 12, 50, 7},
Hard= {63, 55, 18, 36, 23},
Challenge= {63, 55, 40, 36, 23},
},
["New York EVOLVED (Type A)"]
= {
Beginner= {18, 29, 5, 32, 1},
Easy= {41, 39, 36, 39, 5},
Medium= {75, 88, 45, 63, 60},
Hard= {99, 114, 58, 75, 104},
Challenge= {0, 0, 0, 0, 0},
},
["New York EVOLVED (Type B)"]
= {
Beginner= {19, 24, 3, 26, 0},
Easy= {39, 49, 23, 25, 3},
Medium= {66, 74, 30, 25, 53},
Hard= {86, 99, 41, 30, 103},
Challenge= {0, 0, 0, 0, 0},
},
["New York EVOLVED (Type C)"]
= {
Beginner= {19, 24, 3, 14, 2},
Easy= {39, 42, 29, 11, 9},
Medium= {66, 60, 34, 11, 59},
Hard= {85, 91, 47, 21, 105},
Challenge= {0, 0, 0, 0, 0},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE1)"]
= {
Beginner= {33, 43, 3, 26, 2},
Easy= {50, 75, 14, 36, 13},
Medium= {69, 88, 20, 34, 44},
Hard= {87, 88, 41, 40, 97},
Challenge= {0, 0, 0, 0, 0},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE2)"]
= {
Beginner= {33, 43, 3, 26, 2},
Easy= {50, 75, 14, 36, 14},
Medium= {69, 88, 20, 34, 45},
Hard= {81, 88, 96, 16, 88},
Challenge= {0, 0, 0, 0, 0},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE3)"]
= {
Beginner= {33, 44, 3, 25, 2},
Easy= {51, 77, 14, 38, 15},
Medium= {71, 90, 20, 36, 51},
Hard= {87, 90, 34, 89, 100},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA (kskst mix)"]
= {
Beginner= {27, 31, 5, 4, 0},
Easy= {57, 55, 34, 21, 9},
Medium= {90, 63, 34, 20, 39},
Hard= {143, 113, 61, 28, 103},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA Revolution"]
= {
Beginner= {37, 54, 3, 2, 0},
Easy= {62, 104, 34, 38, 7},
Medium= {92, 104, 30, 29, 17},
Hard= {142, 158, 58, 28, 60},
Challenge= {168, 158, 89, 42, 100},
},
["Private Eye"]
= {
Beginner= {14, 26, 1, 0, 0},
Easy= {20, 26, 7, 60, 0},
Medium= {41, 40, 9, 81, 5},
Hard= {56, 53, 20, 85, 15},
Challenge= {0, 0, 0, 0, 0},
},
["Programmed Universe"]
= {
Beginner= {17, 22, 0, 0, 0},
Easy= {29, 38, 7, 37, 1},
Medium= {45, 50, 30, 70, 16},
Hard= {65, 77, 23, 40, 70},
Challenge= {0, 0, 0, 0, 0},
},
["PUT YOUR FAITH IN ME (DA's Twinkly Disco Remix)"]
= {
Beginner= {10, 9, 1, 12, 0},
Easy= {28, 23, 14, 52, 0},
Medium= {42, 38, 23, 37, 9},
Hard= {77, 57, 38, 63, 100},
Challenge= {0, 0, 0, 0, 0},
},
["REBORN MAGIC"]
= {
Beginner= {17, 17, 1, 0, 0},
Easy= {27, 23, 5, 42, 0},
Medium= {42, 34, 18, 32, 4},
Hard= {51, 46, 21, 23, 15},
Challenge= {0, 0, 0, 0, 0},
},
["Rescue Me"]
= {
Beginner= {18, 18, 0, 0, 0},
Easy= {21, 24, 0, 0, 0},
Medium= {48, 42, 9, 0, 8},
Hard= {63, 54, 1, 0, 50},
Challenge= {0, 0, 0, 0, 0},
},
["Resurrection"]
= {
Beginner= {17, 17, 0, 19, 0},
Easy= {28, 23, 0, 59, 0},
Medium= {40, 29, 12, 81, 6},
Hard= {53, 46, 25, 61, 14},
Challenge= {0, 0, 0, 0, 0},
},
["REVOLUTIONARY ADDICT"]
= {
Beginner= {18, 21, 1, 11, 0},
Easy= {42, 36, 21, 51, 1},
Medium= {56, 51, 18, 49, 21},
Hard= {86, 73, 16, 69, 87},
Challenge= {125, 108, 54, 54, 115},
},
["Rhythms Inside"]
= {
Beginner= {11, 16, 0, 15, 0},
Easy= {18, 21, 3, 26, 0},
Medium= {34, 32, 10, 46, 4},
Hard= {45, 43, 29, 47, 13},
Challenge= {0, 0, 0, 0, 0},
},
["Seasons"]
= {
Beginner= {19, 20, 0, 0, 0},
Easy= {28, 28, 0, 17, 0},
Medium= {52, 41, 3, 26, 8},
Hard= {63, 49, 23, 78, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Seule"]
= {
Beginner= {15, 15, 0, 10, 0},
Easy= {28, 20, 1, 58, 0},
Medium= {43, 36, 0, 7, 17},
Hard= {56, 46, 3, 19, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Share The Love"]
= {
Beginner= {15, 19, 3, 23, 0},
Easy= {22, 26, 0, 96, 0},
Medium= {48, 39, 47, 10, 7},
Hard= {64, 59, 36, 18, 26},
Challenge= {0, 0, 0, 0, 0},
},
["SigSig"]
= {
Beginner= {21, 22, 0, 12, 0},
Easy= {38, 29, 9, 30, 0},
Medium= {55, 44, 60, 41, 6},
Hard= {68, 67, 60, 37, 19},
Challenge= {57, 44, 74, 40, 6},
},
["SILVER☆DREAM"]
= {
Beginner= {43, 30, 10, 17, 0},
Easy= {55, 46, 43, 49, 3},
Medium= {78, 61, 87, 37, 29},
Hard= {108, 92, 70, 64, 85},
Challenge= {0, 0, 0, 0, 0},
},
["snow prism"]
= {
Beginner= {18, 16, 1, 5, 0},
Easy= {31, 32, 3, 30, 0},
Medium= {49, 56, 56, 35, 10},
Hard= {75, 65, 23, 37, 35},
Challenge= {99, 107, 80, 28, 100},
},
["Something Special"]
= {
Beginner= {14, 11, 1, 0, 0},
Easy= {17, 15, 0, 22, 0},
Medium= {25, 19, 1, 46, 2},
Hard= {47, 31, 0, 13, 41},
Challenge= {0, 0, 0, 0, 0},
},
["Take A Step Forward"]
= {
Beginner= {16, 18, 1, 23, 0},
Easy= {35, 24, 9, 82, 0},
Medium= {42, 42, 0, 91, 12},
Hard= {61, 48, 18, 20, 20},
Challenge= {0, 0, 0, 0, 0},
},
["The Heavens Above"]
= {
Beginner= {16, 17, 0, 9, 0},
Easy= {34, 23, 10, 100, 0},
Medium= {43, 46, 7, 116, 9},
Hard= {59, 46, 7, 41, 26},
Challenge= {0, 0, 0, 0, 0},
},
["TIME"]
= {
Beginner= {12, 14, 3, 0, 0},
Easy= {24, 19, 1, 61, 0},
Medium= {39, 28, 0, 15, 7},
Hard= {47, 38, 0, 43, 19},
Challenge= {0, 0, 0, 0, 0},
},
["Tohoku EVOLVED"]
= {
Beginner= {46, 28, 1, 0, 0},
Easy= {68, 56, 5, 0, 1},
Medium= {101, 106, 3, 0, 30},
Hard= {162, 106, 50, 11, 100},
Challenge= {175, 106, 74, 26, 101},
},
["tokyoEVOLVED (TYPE1)"]
= {
Beginner= {25, 31, 9, 5, 0},
Easy= {49, 41, 14, 12, 0},
Medium= {76, 83, 34, 54, 33},
Hard= {119, 102, 50, 21, 91},
Challenge= {0, 0, 0, 0, 0},
},
["tokyoEVOLVED (TYPE2)"]
= {
Beginner= {21, 20, 3, 11, 0},
Easy= {43, 41, 23, 18, 2},
Medium= {72, 83, 29, 51, 25},
Hard= {113, 102, 76, 24, 93},
Challenge= {0, 0, 0, 0, 0},
},
["tokyoEVOLVED (TYPE3)"]
= {
Beginner= {19, 20, 5, 15, 0},
Easy= {38, 41, 9, 25, 1},
Medium= {69, 83, 29, 55, 33},
Hard= {106, 102, 83, 21, 91},
Challenge= {0, 0, 0, 0, 0},
},
["Tribe"]
= {
Beginner= {18, 17, 0, 4, 0},
Easy= {30, 23, 5, 30, 0},
Medium= {43, 34, 34, 55, 4},
Hard= {56, 51, 49, 29, 20},
Challenge= {79, 69, 32, 48, 69},
},
["TRIP MACHINE (xac nanoglide mix)"]
= {
Beginner= {23, 28, 0, 0, 0},
Easy= {40, 35, 25, 42, 3},
Medium= {72, 56, 27, 54, 34},
Hard= {113, 92, 41, 64, 102},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE EVOLUTION"]
= {
Beginner= {33, 30, 7, 2, 4},
Easy= {56, 46, 58, 15, 17},
Medium= {80, 61, 60, 18, 46},
Hard= {132, 103, 87, 15, 108},
Challenge= {164, 111, 105, 22, 115},
},
["TWINKLE♡HEART"]
= {
Beginner= {17, 23, 1, 21, 0},
Easy= {29, 30, 1, 24, 0},
Medium= {54, 38, 47, 21, 5},
Hard= {68, 53, 41, 57, 24},
Challenge= {52, 30, 165, 80, 1},
},
["UNBELIEVABLE (Sparky remix)"]
= {
Beginner= {30, 27, 5, 16, 0},
Easy= {39, 27, 14, 81, 0},
Medium= {63, 55, 21, 82, 19},
Hard= {87, 105, 32, 88, 69},
Challenge= {0, 0, 0, 0, 0},
},
["Until the End"]
= {
Beginner= {20, 21, 1, 0, 0},
Easy= {25, 28, 12, 47, 0},
Medium= {50, 50, 27, 54, 7},
Hard= {72, 64, 32, 38, 31},
Challenge= {0, 0, 0, 0, 0},
},
["Wicked Plastik"]
= {
Beginner= {20, 24, 3, 0, 0},
Easy= {26, 24, 1, 14, 0},
Medium= {41, 42, 1, 16, 7},
Hard= {64, 66, 14, 16, 53},
Challenge= {0, 0, 0, 0, 0},
},
["Wings of an Angel (Fly With Me)"]
= {
Beginner= {13, 14, 0, 39, 0},
Easy= {20, 29, 3, 64, 0},
Medium= {43, 43, 16, 72, 9},
Hard= {64, 80, 20, 87, 34},
Challenge= {0, 0, 0, 0, 0},
},
["Be your wings"]
= {
Beginner= {12, 11, 1, 0, 0},
Easy= {26, 22, 3, 29, 0},
Medium= {38, 34, 1, 49, 6},
Hard= {48, 45, 20, 44, 21},
Challenge= {0, 0, 0, 0, 0},
},
["CAPTAIN JACK(GRANDALE REMIX)"]
= {
Beginner= {21, 21, 7, 0, 0},
Easy= {44, 28, 38, 32, 0},
Medium= {63, 56, 32, 27, 23},
Hard= {77, 63, 32, 27, 60},
Challenge= {64, 56, 58, 27, 33},
},
["ETERNITY"]
= {
Beginner= {13, 12, 0, 0, 0},
Easy= {30, 24, 5, 20, 0},
Medium= {47, 43, 16, 27, 7},
Hard= {62, 49, 32, 34, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Everytime We Touch"]
= {
Beginner= {12, 17, 3, 0, 0},
Easy= {29, 23, 5, 29, 0},
Medium= {37, 29, 18, 50, 2},
Hard= {44, 47, 12, 43, 9},
Challenge= {0, 0, 0, 0, 0},
},
["EZ DO DANCE"]
= {
Beginner= {11, 11, 9, 0, 0},
Easy= {25, 23, 12, 12, 0},
Medium= {40, 29, 12, 22, 3},
Hard= {51, 40, 23, 22, 17},
Challenge= {0, 0, 0, 0, 0},
},
["HERO"]
= {
Beginner= {15, 17, 0, 0, 0},
Easy= {34, 22, 54, 20, 0},
Medium= {43, 34, 58, 31, 6},
Hard= {57, 45, 58, 28, 24},
Challenge= {49, 34, 92, 0, 8},
},
["Hide-away"]
= {
Beginner= {11, 16, 3, 0, 0},
Easy= {26, 22, 0, 19, 0},
Medium= {37, 33, 12, 59, 2},
Hard= {48, 44, 16, 14, 15},
Challenge= {0, 0, 0, 0, 0},
},
["IF YOU WERE HERE"]
= {
Beginner= {18, 18, 1, 4, 0},
Easy= {36, 30, 40, 31, 1},
Medium= {44, 36, 27, 38, 6},
Hard= {54, 48, 16, 43, 18},
Challenge= {37, 30, 63, 25, 1},
},
["IF YOU WERE HERE (L.E.D.-G STYLE REMIX)"]
= {
Beginner= {20, 20, 10, 0, 0},
Easy= {50, 40, 23, 15, 6},
Medium= {62, 53, 36, 14, 22},
Hard= {80, 86, 21, 30, 65},
Challenge= {0, 0, 0, 0, 0},
},
["only my railgun"]
= {
Beginner= {13, 17, 1, 18, 0},
Easy= {23, 23, 3, 39, 0},
Medium= {35, 29, 16, 82, 1},
Hard= {48, 47, 18, 58, 12},
Challenge= {43, 35, 76, 36, 24},
},
["resonance"]
= {
Beginner= {16, 13, 9, 0, 0},
Easy= {25, 27, 10, 13, 0},
Medium= {51, 41, 23, 30, 6},
Hard= {71, 61, 30, 26, 27},
Challenge= {0, 0, 0, 0, 0},
},
["Super Driver"]
= {
Beginner= {18, 16, 0, 0, 0},
Easy= {36, 33, 3, 30, 0},
Medium= {57, 50, 41, 26, 3},
Hard= {73, 66, 69, 33, 16},
Challenge= {0, 0, 0, 0, 0},
},
["SUPER EUROBEAT <GOLD MIX>"]
= {
Beginner= {14, 12, 0, 0, 0},
Easy= {25, 25, 16, 21, 0},
Medium= {40, 38, 32, 31, 6},
Hard= {62, 51, 56, 22, 27},
Challenge= {0, 0, 0, 0, 0},
},
["Time After Time"]
= {
Beginner= {13, 17, 3, 9, 0},
Easy= {27, 22, 3, 2, 0},
Medium= {43, 34, 3, 23, 6},
Hard= {57, 51, 5, 14, 20},
Challenge= {0, 0, 0, 0, 0},
},
["不沈艦CANDY"]
= {
Beginner= {18, 14, 7, 0, 0},
Easy= {37, 28, 16, 25, 0},
Medium= {54, 42, 16, 57, 10},
Hard= {94, 85, 50, 26, 69},
Challenge= {0, 0, 0, 0, 0},
},
["冥"]
= {
Beginner= {20, 29, 5, 2, 0},
Easy= {39, 44, 16, 16, 2},
Medium= {68, 59, 21, 11, 27},
Hard= {95, 109, 47, 20, 100},
Challenge= {124, 109, 72, 10, 106},
},
["A Brighter Day"]
= {
Beginner= {13, 19, 1, 0, 0},
Easy= {27, 25, 3, 23, 0},
Medium= {39, 38, 10, 52, 3},
Hard= {46, 38, 16, 70, 9},
Challenge= {64, 70, 10, 27, 33},
},
["aftershock!!"]
= {
Beginner= {21, 26, 9, 0, 0},
Easy= {25, 26, 5, 103, 0},
Medium= {53, 52, 20, 87, 14},
Hard= {79, 78, 25, 48, 85},
Challenge= {0, 0, 0, 0, 0},
},
["All My Love"]
= {
Beginner= {15, 12, 7, 0, 0},
Easy= {32, 26, 10, 31, 0},
Medium= {43, 39, 36, 59, 8},
Hard= {59, 52, 47, 55, 23},
Challenge= {0, 0, 0, 0, 0},
},
["Anti-Matter"]
= {
Beginner= {38, 39, 16, 0, 0},
Easy= {67, 79, 36, 28, 3},
Medium= {89, 102, 10, 42, 15},
Hard= {140, 129, 23, 27, 83},
Challenge= {178, 136, 23, 20, 103},
},
["BALLAD THE FEATHERS"]
= {
Beginner= {14, 21, 0, 0, 0},
Easy= {25, 21, 5, 0, 0},
Medium= {40, 33, 9, 0, 5},
Hard= {55, 49, 10, 0, 27},
Challenge= {40, 33, 29, 0, 4},
},
["CG Project"]
= {
Beginner= {21, 25, 7, 0, 0},
Easy= {39, 33, 14, 13, 0},
Medium= {55, 50, 32, 38, 4},
Hard= {80, 66, 58, 30, 26},
Challenge= {0, 0, 0, 0, 0},
},
["Crazy Control"]
= {
Beginner= {10, 12, 1, 0, 0},
Easy= {18, 17, 10, 0, 0},
Medium= {31, 34, 16, 0, 5},
Hard= {50, 61, 30, 0, 54},
Challenge= {56, 61, 36, 0, 78},
},
["Dazzlin' Darlin"]
= {
Beginner= {11, 18, 1, 0, 0},
Easy= {31, 31, 25, 15, 0},
Medium= {46, 43, 36, 5, 9},
Hard= {58, 55, 36, 11, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Dazzlin' Darlin-秋葉工房mix-"]
= {
Beginner= {19, 20, 3, 0, 0},
Easy= {32, 26, 3, 18, 0},
Medium= {43, 33, 54, 28, 3},
Hard= {70, 53, 34, 2, 28},
Challenge= {0, 0, 0, 0, 0},
},
["Decade"]
= {
Beginner= {15, 18, 3, 0, 0},
Easy= {31, 24, 3, 71, 0},
Medium= {43, 37, 23, 87, 5},
Hard= {53, 49, 9, 93, 18},
Challenge= {0, 0, 0, 0, 0},
},
["dirty digital"]
= {
Beginner= {12, 17, 3, 17, 0},
Easy= {27, 23, 3, 14, 0},
Medium= {44, 46, 34, 18, 7},
Hard= {58, 69, 25, 14, 39},
Challenge= {71, 93, 23, 5, 85},
},
["DROP"]
= {
Beginner= {11, 12, 1, 0, 0},
Easy= {24, 25, 5, 38, 0},
Medium= {37, 37, 32, 39, 4},
Hard= {58, 56, 27, 36, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Dummy"]
= {
Beginner= {16, 14, 0, 16, 0},
Easy= {29, 28, 0, 8, 0},
Medium= {49, 36, 5, 3, 7},
Hard= {66, 58, 34, 11, 26},
Challenge= {0, 0, 0, 0, 0},
},
["FIRE FIRE"]
= {
Beginner= {21, 25, 3, 0, 0},
Easy= {32, 25, 16, 5, 0},
Medium= {48, 50, 23, 25, 6},
Hard= {90, 87, 23, 14, 92},
Challenge= {0, 0, 0, 0, 0},
},
["Freeze"]
= {
Beginner= {12, 17, 1, 61, 0},
Easy= {24, 23, 0, 144, 0},
Medium= {38, 34, 16, 146, 5},
Hard= {58, 46, 29, 123, 42},
Challenge= {58, 46, 45, 120, 42},
},
["going up"]
= {
Beginner= {20, 17, 0, 8, 0},
Easy= {51, 35, 0, 0, 0},
Medium= {69, 52, 12, 0, 8},
Hard= {85, 70, 16, 0, 24},
Challenge= {69, 52, 56, 0, 9},
},
["GOLD RUSH"]
= {
Beginner= {15, 13, 1, 0, 0},
Easy= {28, 27, 21, 43, 0},
Medium= {46, 47, 54, 66, 6},
Hard= {72, 67, 40, 31, 56},
Challenge= {0, 0, 0, 0, 0},
},
["Gotta Dance"]
= {
Beginner= {13, 11, 0, 0, 0},
Easy= {16, 18, 7, 32, 0},
Medium= {38, 36, 21, 40, 3},
Hard= {64, 54, 23, 45, 39},
Challenge= {0, 0, 0, 0, 0},
},
["Heatstroke"]
= {
Beginner= {16, 17, 5, 0, 0},
Easy= {34, 23, 20, 67, 0},
Medium= {43, 40, 1, 91, 7},
Hard= {60, 58, 1, 29, 30},
Challenge= {43, 40, 23, 87, 7},
},
["I'm so Happy"]
= {
Beginner= {20, 30, 16, 10, 0},
Easy= {37, 30, 18, 55, 0},
Medium= {55, 52, 30, 54, 8},
Hard= {79, 67, 32, 82, 33},
Challenge= {119, 110, 27, 77, 104},
},
["in love wit you"]
= {
Beginner= {14, 18, 0, 0, 0},
Easy= {16, 24, 0, 116, 0},
Medium= {28, 37, 30, 125, 1},
Hard= {38, 49, 18, 168, 8},
Challenge= {0, 0, 0, 0, 0},
},
["KIMONO♥PRINCESS"]
= {
Beginner= {25, 36, 5, 43, 4},
Easy= {44, 43, 30, 57, 11},
Medium= {70, 58, 30, 50, 34},
Hard= {98, 94, 49, 38, 100},
Challenge= {0, 0, 0, 0, 0},
},
["KISS KISS KISS 秋葉工房 MIX"]
= {
Beginner= {17, 20, 3, 0, 0},
Easy= {31, 26, 1, 15, 0},
Medium= {44, 40, 25, 71, 4},
Hard= {64, 66, 34, 35, 28},
Challenge= {0, 0, 0, 0, 0},
},
["La libertad"]
= {
Beginner= {15, 28, 1, 0, 0},
Easy= {25, 28, 1, 4, 0},
Medium= {51, 49, 18, 4, 11},
Hard= {73, 63, 16, 4, 35},
Challenge= {84, 70, 16, 4, 63},
},
["La receta"]
= {
Beginner= {16, 16, 7, 0, 0},
Easy= {21, 21, 9, 26, 0},
Medium= {44, 37, 10, 19, 9},
Hard= {65, 54, 9, 20, 43},
Challenge= {69, 59, 21, 35, 61},
},
["Leaving･･･"]
= {
Beginner= {15, 18, 1, 27, 0},
Easy= {34, 24, 16, 36, 0},
Medium= {45, 36, 1, 45, 7},
Hard= {58, 54, 16, 45, 44},
Challenge= {73, 66, 3, 51, 67},
},
["Love Again"]
= {
Beginner= {9, 8, 0, 0, 0},
Easy= {14, 14, 1, 23, 0},
Medium= {25, 20, 5, 75, 6},
Hard= {34, 31, 14, 70, 28},
Challenge= {0, 0, 0, 0, 0},
},
["MAX LOVE"]
= {
Beginner= {21, 22, 1, 16, 0},
Easy= {46, 30, 1, 4, 0},
Medium= {53, 37, 9, 11, 4},
Hard= {66, 44, 40, 2, 19},
Challenge= {80, 89, 38, 2, 36},
},
["Melody Life"]
= {
Beginner= {15, 14, 0, 6, 0},
Easy= {32, 28, 1, 31, 0},
Medium= {46, 35, 38, 31, 0},
Hard= {60, 50, 76, 20, 11},
Challenge= {60, 50, 76, 20, 11},
},
["New Decade"]
= {
Beginner= {27, 40, 7, 0, 0},
Easy= {72, 103, 30, 53, 9},
Medium= {87, 117, 36, 47, 38},
Hard= {124, 124, 76, 29, 74},
Challenge= {139, 158, 112, 35, 101},
},
["oarfish"]
= {
Beginner= {8, 11, 3, 7, 0},
Easy= {13, 11, 3, 20, 0},
Medium= {40, 40, 3, 95, 11},
Hard= {49, 52, 9, 121, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Pierce The Sky"]
= {
Beginner= {15, 19, 1, 0, 0},
Easy= {52, 39, 21, 26, 8},
Medium= {69, 66, 23, 38, 46},
Hard= {91, 92, 34, 22, 101},
Challenge= {0, 0, 0, 0, 0},
},
["Pluto The First"]
= {
Beginner= {23, 37, 12, 3, 9},
Easy= {40, 65, 30, 56, 35},
Medium= {80, 106, 23, 24, 103},
Hard= {112, 134, 69, 12, 120},
Challenge= {117, 134, 98, 12, 123},
},
["Poseidon(kors k mix)"]
= {
Beginner= {18, 24, 1, 0, 0},
Easy= {32, 24, 20, 39, 0},
Medium= {52, 49, 52, 19, 17},
Hard= {81, 68, 45, 21, 97},
Challenge= {0, 0, 0, 0, 0},
},
["POSSESSION"]
= {
Beginner= {39, 55, 5, 56, 0},
Easy= {71, 55, 5, 27, 22},
Medium= {89, 105, 102, 29, 47},
Hard= {123, 161, 110, 26, 95},
Challenge= {134, 161, 115, 35, 100},
},
["real-high-SPEED"]
= {
Beginner= {14, 10, 0, 0, 0},
Easy= {25, 21, 5, 26, 0},
Medium= {34, 32, 12, 44, 3},
Hard= {46, 37, 38, 31, 17},
Challenge= {0, 0, 0, 0, 0},
},
["roppongi EVOLVED ver.A"]
= {
Beginner= {27, 28, 3, 25, 0},
Easy= {43, 35, 10, 73, 2},
Medium= {63, 56, 25, 78, 21},
Hard= {93, 99, 20, 79, 102},
Challenge= {0, 0, 0, 0, 0},
},
["roppongi EVOLVED ver.B"]
= {
Beginner= {25, 26, 5, 29, 0},
Easy= {41, 40, 10, 77, 4},
Medium= {62, 60, 18, 67, 27},
Hard= {85, 93, 23, 68, 101},
Challenge= {0, 0, 0, 0, 0},
},
["roppongi EVOLVED ver.C"]
= {
Beginner= {27, 26, 1, 28, 2},
Easy= {43, 39, 12, 58, 7},
Medium= {66, 65, 21, 31, 38},
Hard= {88, 102, 30, 42, 103},
Challenge= {0, 0, 0, 0, 0},
},
["roppongi EVOLVED ver.D"]
= {
Beginner= {27, 31, 1, 43, 0},
Easy= {46, 55, 10, 76, 11},
Medium= {68, 63, 30, 60, 54},
Hard= {94, 113, 32, 56, 112},
Challenge= {0, 0, 0, 0, 0},
},
["Sacred Oath"]
= {
Beginner= {14, 14, 1, 0, 0},
Easy= {23, 28, 5, 27, 0},
Medium= {44, 42, 18, 63, 4},
Hard= {65, 56, 27, 47, 22},
Challenge= {73, 84, 30, 45, 33},
},
["sakura storm"]
= {
Beginner= {18, 23, 0, 6, 0},
Easy= {26, 30, 1, 10, 0},
Medium= {48, 53, 18, 35, 4},
Hard= {68, 61, 5, 31, 24},
Challenge= {86, 61, 89, 12, 43},
},
["Sakura Sunrise"]
= {
Beginner= {20, 22, 12, 0, 0},
Easy= {50, 45, 40, 30, 3},
Medium= {73, 60, 47, 28, 22},
Hard= {86, 75, 69, 40, 48},
Challenge= {0, 0, 0, 0, 0},
},
["Second Heaven"]
= {
Beginner= {15, 18, 3, 0, 0},
Easy= {27, 24, 16, 28, 0},
Medium= {43, 43, 21, 28, 10},
Hard= {61, 49, 50, 21, 23},
Challenge= {81, 80, 18, 24, 87},
},
["She is my wife"]
= {
Beginner= {13, 17, 7, 0, 0},
Easy= {25, 23, 12, 61, 0},
Medium= {37, 40, 23, 72, 8},
Hard= {61, 58, 47, 40, 35},
Challenge= {0, 0, 0, 0, 0},
},
["Shine"]
= {
Beginner= {10, 15, 0, 0, 0},
Easy= {20, 20, 0, 58, 0},
Medium= {33, 31, 9, 46, 3},
Hard= {43, 41, 12, 49, 18},
Challenge= {55, 57, 16, 59, 50},
},
["☆shining☆"]
= {
Beginner= {18, 23, 1, 0, 0},
Easy= {31, 30, 12, 61, 0},
Medium= {55, 46, 38, 35, 4},
Hard= {70, 53, 65, 36, 15},
Challenge= {0, 0, 0, 0, 0},
},
["Shiny World"]
= {
Beginner= {16, 11, 0, 32, 1},
Easy= {43, 29, 14, 21, 21},
Medium= {61, 40, 21, 22, 77},
Hard= {83, 55, 34, 0, 107},
Challenge= {0, 0, 0, 0, 0},
},
["Sky Is The Limit"]
= {
Beginner= {14, 18, 5, 0, 0},
Easy= {34, 25, 12, 18, 0},
Medium= {55, 50, 40, 34, 13},
Hard= {58, 56, 38, 74, 32},
Challenge= {0, 0, 0, 0, 0},
},
["smooooch・∀・"]
= {
Beginner= {15, 14, 1, 0, 0},
Easy= {22, 29, 3, 17, 0},
Medium= {41, 51, 21, 54, 5},
Hard= {73, 65, 43, 36, 41},
Challenge= {57, 51, 83, 29, 15},
},
["someday..."]
= {
Beginner= {18, 19, 5, 32, 0},
Easy= {32, 25, 5, 35, 0},
Medium= {44, 31, 14, 52, 3},
Hard= {55, 51, 9, 77, 11},
Challenge= {0, 0, 0, 0, 0},
},
["Taking It To The Sky"]
= {
Beginner= {9, 10, 0, 0, 0},
Easy= {18, 21, 0, 29, 0},
Medium= {32, 21, 5, 56, 0},
Hard= {48, 37, 5, 62, 14},
Challenge= {0, 0, 0, 0, 0},
},
["Theory of Eternity"]
= {
Beginner= {23, 20, 9, 0, 0},
Easy= {40, 40, 20, 37, 0},
Medium= {55, 40, 20, 26, 10},
Hard= {73, 60, 21, 19, 30},
Challenge= {56, 53, 50, 31, 22},
},
["THIS NIGHT"]
= {
Beginner= {16, 20, 1, 0, 0},
Easy= {27, 26, 1, 38, 0},
Medium= {47, 46, 7, 41, 7},
Hard= {63, 60, 9, 42, 36},
Challenge= {0, 0, 0, 0, 0},
},
["Valkyrie dimension"]
= {
Beginner= {43, 61, 23, 65, 34},
Easy= {61, 61, 16, 72, 74},
Medium= {77, 92, 21, 77, 110},
Hard= {119, 111, 21, 73, 143},
Challenge= {145, 143, 70, 55, 153},
},
["VANESSA"]
= {
Beginner= {29, 30, 10, 0, 0},
Easy= {44, 30, 67, 47, 0},
Medium= {69, 61, 54, 35, 41},
Hard= {125, 92, 32, 21, 106},
Challenge= {0, 0, 0, 0, 0},
},
["WH1TE RO5E"]
= {
Beginner= {17, 18, 1, 3, 0},
Easy= {30, 37, 9, 18, 0},
Medium= {49, 49, 14, 34, 13},
Hard= {77, 87, 36, 13, 85},
Challenge= {0, 0, 0, 0, 0},
},
["What Will Come of Me"]
= {
Beginner= {11, 17, 0, 0, 0},
Easy= {18, 23, 0, 18, 0},
Medium= {33, 34, 12, 35, 1},
Hard= {66, 75, 20, 45, 60},
Challenge= {0, 0, 0, 0, 0},
},
["You are a Star"]
= {
Beginner= {15, 19, 5, 0, 0},
Easy= {23, 25, 9, 36, 0},
Medium= {44, 51, 21, 53, 3},
Hard= {75, 57, 21, 39, 35},
Challenge= {83, 70, 9, 47, 55},
},
["Your Angel"]
= {
Beginner= {15, 21, 3, 21, 0},
Easy= {24, 28, 0, 27, 0},
Medium= {43, 43, 18, 10, 6},
Hard= {64, 58, 14, 54, 25},
Challenge= {0, 0, 0, 0, 0},
},
["ZETA～素数の世界と超越者～"]
= {
Beginner= {18, 21, 0, 0, 0},
Easy= {36, 28, 18, 30, 0},
Medium= {61, 57, 38, 52, 14},
Hard= {97, 93, 32, 36, 92},
Challenge= {0, 0, 0, 0, 0},
},
["888"]
= {
Beginner= {16, 20, 1, 12, 0},
Easy= {42, 41, 10, 20, 0},
Medium= {90, 83, 36, 51, 38},
Hard= {109, 102, 23, 43, 55},
Challenge= {200, 117, 25, 22, 110},
},
["ΔMAX"]
= {
Beginner= {21, 22, 0, 0, 0},
Easy= {27, 22, 7, 0, 0},
Medium= {76, 91, 30, 8, 22},
Hard= {94, 106, 89, 31, 75},
Challenge= {98, 101, 115, 31, 100},
},
["ポリリズム"]
= {
Beginner= {13, 15, 1, 0, 0},
Easy= {20, 21, 10, 29, 0},
Medium= {42, 37, 10, 66, 8},
Hard= {58, 42, 45, 23, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Butterfly (2008 X-edit)"]
= {
Beginner= {15, 16, 0, 15, 0},
Easy= {32, 22, 14, 14, 0},
Medium= {43, 28, 30, 27, 7},
Hard= {65, 50, 25, 44, 39},
Challenge= {33, 22, 18, 14, 0},
},
["DUB-I-DUB (2008 X-edit)"]
= {
Beginner= {15, 17, 0, 0, 0},
Easy= {36, 28, 54, 55, 1},
Medium= {50, 45, 49, 36, 12},
Hard= {60, 50, 74, 25, 41},
Challenge= {37, 28, 78, 47, 1},
},
["Trickster"]
= {
Beginner= {14, 20, 0, 0, 0},
Easy= {25, 27, 0, 30, 0},
Medium= {44, 34, 5, 28, 6},
Hard= {57, 55, 14, 14, 18},
Challenge= {0, 0, 0, 0, 0},
},
["30 Lives (Up-Up-Down-Dance Mix)"]
= {
Beginner= {12, 11, 3, 0, 0},
Easy= {20, 23, 10, 18, 0},
Medium= {39, 41, 9, 30, 6},
Hard= {46, 41, 60, 3, 13},
Challenge= {0, 0, 0, 0, 0},
},
["革命(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {70, 61, 36, 34, 69},
},
["零 - ZERO -"]
= {
Beginner= {17, 14, 0, 0, 0},
Easy= {34, 28, 3, 26, 0},
Medium= {52, 49, 10, 43, 7},
Hard= {72, 71, 41, 41, 26},
Challenge= {0, 0, 0, 0, 0},
},
["凛として咲く花の如く"]
= {
Beginner= {22, 20, 1, 0, 0},
Easy= {33, 27, 7, 38, 0},
Medium= {43, 33, 32, 57, 2},
Hard= {60, 54, 50, 45, 15},
Challenge= {0, 0, 0, 0, 0},
},
["A Geisha's Dream"]
= {
Beginner= {16, 17, 3, 0, 0},
Easy= {35, 29, 29, 31, 1},
Medium= {46, 34, 36, 57, 9},
Hard= {62, 52, 30, 59, 30},
Challenge= {0, 0, 0, 0, 0},
},
["AFRONOVA(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {94, 66, 76, 37, 37},
},
["Beautiful Inside (Cube::Hard Mix)"]
= {
Beginner= {13, 13, 1, 0, 0},
Easy= {20, 18, 1, 31, 0},
Medium= {37, 31, 25, 45, 6},
Hard= {48, 36, 45, 62, 16},
Challenge= {0, 0, 0, 0, 0},
},
["Blue Rain"]
= {
Beginner= {15, 11, 0, 0, 0},
Easy= {31, 23, 5, 39, 0},
Medium= {38, 36, 16, 63, 4},
Hard= {59, 60, 12, 52, 28},
Challenge= {0, 0, 0, 0, 0},
},
["CANDY☆(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {75, 63, 78, 50, 22},
},
["Chance and Dice"]
= {
Beginner= {19, 18, 1, 0, 0},
Easy= {33, 25, 18, 19, 0},
Medium= {40, 31, 38, 70, 3},
Hard= {56, 50, 50, 48, 18},
Challenge= {0, 0, 0, 0, 0},
},
["Dance Celebration"]
= {
Beginner= {15, 10, 0, 0, 0},
Easy= {29, 21, 14, 29, 0},
Medium= {46, 43, 38, 51, 11},
Hard= {69, 70, 36, 22, 51},
Challenge= {70, 70, 52, 18, 51},
},
["Dance Celebration (System 7 Remix)"]
= {
Beginner= {18, 16, 1, 8, 0},
Easy= {31, 21, 36, 57, 0},
Medium= {47, 38, 21, 100, 16},
Hard= {67, 55, 32, 95, 57},
Challenge= {0, 0, 0, 0, 0},
},
["Dance Dance Revolution(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {74, 62, 47, 60, 55},
},
["Dance Floor"]
= {
Beginner= {14, 15, 1, 0, 0},
Easy= {26, 20, 14, 7, 0},
Medium= {38, 34, 9, 50, 6},
Hard= {47, 40, 21, 71, 17},
Challenge= {0, 0, 0, 0, 0},
},
["dazzle"]
= {
Beginner= {11, 12, 0, 0, 0},
Easy= {21, 16, 9, 38, 0},
Medium= {36, 28, 14, 51, 9},
Hard= {49, 40, 16, 84, 33},
Challenge= {0, 0, 0, 0, 0},
},
["Dream Machine"]
= {
Beginner= {18, 17, 1, 0, 0},
Easy= {40, 23, 32, 37, 0},
Medium= {53, 40, 25, 30, 13},
Hard= {68, 46, 18, 26, 55},
Challenge= {0, 0, 0, 0, 0},
},
["Flight of the Phoenix"]
= {
Beginner= {14, 18, 0, 0, 0},
Easy= {27, 24, 20, 3, 0},
Medium= {36, 36, 29, 40, 4},
Hard= {43, 42, 27, 103, 10},
Challenge= {40, 36, 65, 60, 2},
},
["Flourish"]
= {
Beginner= {17, 18, 0, 0, 0},
Easy= {32, 25, 5, 6, 0},
Medium= {47, 44, 36, 28, 6},
Hard= {58, 56, 60, 30, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Healing Vision(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {89, 104, 38, 47, 86},
},
["Horatio"]
= {
Beginner= {17, 13, 7, 3, 0},
Easy= {30, 27, 12, 9, 0},
Medium= {57, 55, 40, 51, 14},
Hard= {135, 105, 32, 20, 106},
Challenge= {122, 105, 74, 20, 103},
},
["Inspiration"]
= {
Beginner= {17, 24, 1, 0, 0},
Easy= {28, 24, 9, 14, 0},
Medium= {38, 30, 32, 21, 2},
Hard= {52, 42, 50, 26, 10},
Challenge= {0, 0, 0, 0, 0},
},
["INTO YOUR HEART (Ruffage remix)"]
= {
Beginner= {15, 22, 1, 0, 0},
Easy= {21, 22, 1, 7, 0},
Medium= {47, 39, 30, 33, 12},
Hard= {66, 61, 30, 26, 37},
Challenge= {0, 0, 0, 0, 0},
},
["Lift You Up"]
= {
Beginner= {15, 15, 0, 0, 0},
Easy= {25, 20, 5, 5, 0},
Medium= {36, 30, 18, 14, 3},
Hard= {48, 46, 10, 5, 20},
Challenge= {0, 0, 0, 0, 0},
},
["LOVING YOU (Epidemik remix)"]
= {
Beginner= {15, 20, 0, 0, 0},
Easy= {25, 27, 1, 12, 0},
Medium= {47, 47, 16, 12, 10},
Hard= {61, 55, 21, 47, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Malacca"]
= {
Beginner= {17, 17, 7, 0, 0},
Easy= {27, 23, 9, 7, 0},
Medium= {36, 34, 27, 7, 2},
Hard= {46, 34, 10, 8, 15},
Challenge= {77, 64, 7, 23, 100},
},
["MAX 300(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {130, 97, 25, 31, 49},
},
["MAXX UNLIMITED(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {154, 126, 69, 74, 93},
},
["on the bounce"]
= {
Beginner= {20, 25, 1, 0, 0},
Easy= {40, 37, 7, 32, 5},
Medium= {64, 56, 61, 32, 39},
Hard= {87, 68, 72, 26, 100},
Challenge= {100, 81, 74, 35, 104},
},
["On The Break"]
= {
Beginner= {18, 19, 1, 0, 0},
Easy= {43, 32, 34, 71, 2},
Medium= {60, 45, 49, 51, 22},
Hard= {75, 65, 54, 38, 68},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA ETERNAL(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {97, 66, 43, 30, 40},
},
["PARANOIA EVOLUTION(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {86, 66, 45, 8, 36},
},
["PARANOiA MAX～DIRTY MIX～(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {94, 63, 21, 4, 36},
},
["PARANOiA Rebirth(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {99, 63, 25, 25, 45},
},
["PARANOiA(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {78, 60, 65, 18, 26},
},
["Party Lights"]
= {
Beginner= {16, 16, 0, 0, 0},
Easy= {25, 21, 0, 62, 0},
Medium= {37, 27, 14, 49, 10},
Hard= {54, 54, 63, 89, 36},
Challenge= {0, 0, 0, 0, 0},
},
["Playa (Original Mix)"]
= {
Beginner= {17, 15, 0, 0, 0},
Easy= {28, 20, 3, 10, 0},
Medium= {44, 36, 20, 21, 6},
Hard= {66, 46, 30, 20, 61},
Challenge= {0, 0, 0, 0, 0},
},
["puzzle"]
= {
Beginner= {18, 16, 0, 0, 0},
Easy= {28, 22, 0, 40, 0},
Medium= {39, 33, 7, 54, 3},
Hard= {47, 39, 7, 35, 10},
Challenge= {0, 0, 0, 0, 0},
},
["S・A・G・A"]
= {
Beginner= {28, 33, 0, 0, 0},
Easy= {44, 33, 29, 25, 0},
Medium= {59, 58, 36, 32, 10},
Hard= {67, 67, 105, 46, 16},
Challenge= {0, 0, 0, 0, 0},
},
["SABER WING"]
= {
Beginner= {30, 33, 0, 0, 0},
Easy= {48, 67, 16, 51, 6},
Medium= {64, 83, 43, 68, 24},
Hard= {83, 100, 49, 49, 63},
Challenge= {84, 100, 98, 37, 63},
},
["SABER WING (Akira Ishihara Headshot mix)"]
= {
Beginner= {37, 30, 7, 18, 0},
Easy= {64, 61, 25, 25, 4},
Medium= {77, 72, 27, 15, 25},
Hard= {95, 101, 30, 30, 100},
Challenge= {114, 106, 36, 32, 104},
},
["Slip Out"]
= {
Beginner= {12, 11, 0, 0, 0},
Easy= {17, 11, 5, 8, 0},
Medium= {31, 27, 32, 29, 10},
Hard= {42, 35, 45, 58, 31},
Challenge= {0, 0, 0, 0, 0},
},
["Slip Out (bounce in beat mix)"]
= {
Beginner= {12, 8, 0, 0, 0},
Easy= {25, 17, 7, 5, 0},
Medium= {31, 31, 18, 99, 5},
Hard= {50, 44, 36, 95, 29},
Challenge= {0, 0, 0, 0, 0},
},
["SP-TRIP MACHINE～JUNGLE MIX～(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {63, 53, 61, 43, 29},
},
["SUPER SAMURAI"]
= {
Beginner= {23, 20, 0, 0, 4},
Easy= {50, 41, 12, 18, 19},
Medium= {79, 69, 52, 2, 62},
Hard= {99, 105, 74, 39, 104},
Challenge= {0, 0, 0, 0, 0},
},
["Taj He Spitz"]
= {
Beginner= {15, 13, 0, 0, 0},
Easy= {25, 17, 3, 22, 0},
Medium= {39, 35, 18, 0, 8},
Hard= {55, 40, 36, 3, 30},
Challenge= {0, 0, 0, 0, 0},
},
["Taj He Spitz (Tommie Sunshine's Brooklyn Fire Re-Touch)"]
= {
Beginner= {17, 15, 1, 0, 0},
Easy= {32, 20, 18, 27, 0},
Medium= {45, 40, 36, 24, 8},
Hard= {68, 50, 52, 13, 57},
Challenge= {0, 0, 0, 0, 0},
},
["Take A Chance"]
= {
Beginner= {13, 10, 0, 5, 0},
Easy= {18, 14, 3, 15, 0},
Medium= {30, 21, 16, 8, 7},
Hard= {38, 29, 25, 25, 20},
Challenge= {0, 0, 0, 0, 0},
},
["The flower in your smile"]
= {
Beginner= {15, 15, 0, 0, 0},
Easy= {40, 31, 0, 24, 1},
Medium= {50, 46, 21, 50, 5},
Hard= {61, 46, 45, 50, 14},
Challenge= {0, 0, 0, 0, 0},
},
["The legend of MAX(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {126, 128, 36, 36, 61},
},
["Ticket to Bombay"]
= {
Beginner= {18, 11, 0, 0, 0},
Easy= {33, 24, 0, 18, 0},
Medium= {44, 36, 18, 30, 12},
Hard= {59, 48, 47, 30, 27},
Challenge= {0, 0, 0, 0, 0},
},
["Till the lonely's gone"]
= {
Beginner= {18, 16, 3, 0, 0},
Easy= {23, 21, 7, 22, 0},
Medium= {44, 37, 14, 30, 15},
Hard= {50, 59, 25, 32, 30},
Challenge= {0, 0, 0, 0, 0},
},
["TimeHollow"]
= {
Beginner= {10, 11, 0, 0, 0},
Easy= {18, 15, 0, 31, 0},
Medium= {25, 27, 1, 49, 4},
Hard= {35, 31, 14, 56, 13},
Challenge= {0, 0, 0, 0, 0},
},
["Tracers (4Beat Remix)"]
= {
Beginner= {17, 17, 0, 0, 0},
Easy= {34, 23, 3, 42, 0},
Medium= {44, 34, 9, 42, 11},
Hard= {58, 46, 20, 46, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Trigger"]
= {
Beginner= {20, 21, 0, 0, 0},
Easy= {48, 43, 9, 8, 1},
Medium= {72, 97, 67, 16, 58},
Hard= {93, 131, 94, 39, 103},
Challenge= {119, 141, 89, 67, 110},
},
["TRIP MACHINE CLIMAX(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {87, 67, 105, 35, 45},
},
["TRIP MACHINE(X-Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {63, 53, 63, 53, 27},
},
["Übertreffen"]
= {
Beginner= {23, 21, 0, 0, 0},
Easy= {40, 28, 9, 37, 0},
Medium= {58, 50, 23, 22, 10},
Hard= {83, 72, 40, 29, 35},
Challenge= {0, 0, 0, 0, 0},
},
["Waiting 4 u"]
= {
Beginner= {23, 21, 9, 0, 0},
Easy= {40, 29, 16, 19, 0},
Medium= {56, 43, 20, 47, 15},
Hard= {68, 65, 47, 37, 27},
Challenge= {68, 65, 81, 36, 27},
},
["will"]
= {
Beginner= {10, 11, 7, 0, 0},
Easy= {17, 24, 9, 40, 0},
Medium= {31, 36, 14, 75, 1},
Hard= {56, 54, 34, 46, 25},
Challenge= {0, 0, 0, 0, 0},
},
["A thing called LOVE"]
= {
Beginner= {16, 20, 5, 0, 0},
Easy= {32, 26, 3, 12, 0},
Medium= {45, 40, 5, 18, 4},
Hard= {59, 60, 41, 39, 16},
Challenge= {0, 0, 0, 0, 0},
},
["AM-3P (\"CHAOS\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {81, 86, 47, 24, 101},
},
["Arrabbiata"]
= {
Beginner= {34, 28, 0, 0, 0},
Easy= {62, 37, 21, 0, 0},
Medium= {76, 56, 106, 2, 10},
Hard= {92, 74, 96, 2, 26},
Challenge= {0, 0, 0, 0, 0},
},
["B4U (\"VOLTAGE\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {79, 101, 85, 0, 77},
},
["Blind Justice ～Torn souls, Hurt Faiths ～"]
= {
Beginner= {18, 13, 1, 0, 0},
Easy= {33, 27, 5, 21, 0},
Medium= {47, 40, 32, 27, 6},
Hard= {70, 81, 47, 61, 30},
Challenge= {0, 0, 0, 0, 0},
},
["Bloody Tears(IIDX EDITION)"]
= {
Beginner= {23, 27, 0, 0, 0},
Easy= {32, 27, 16, 0, 0},
Medium= {43, 34, 7, 9, 8},
Hard= {61, 55, 45, 0, 28},
Challenge= {0, 0, 0, 0, 0},
},
["BRILLIANT 2U (\"STREAM\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {90, 62, 20, 11, 91},
},
["CaptivAte～誓い～"]
= {
Beginner= {19, 20, 3, 0, 0},
Easy= {30, 26, 12, 27, 0},
Medium= {50, 40, 27, 23, 5},
Hard= {83, 66, 32, 36, 70},
Challenge= {0, 0, 0, 0, 0},
},
["D2R (\"FREEZE\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {37, 60, 12, 200, 14},
},
["DEAD END (\"GROOVE RADAR\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {95, 103, 100, 100, 116},
},
["dream of love"]
= {
Beginner= {11, 9, 9, 0, 0},
Easy= {15, 14, 1, 0, 0},
Medium= {34, 28, 7, 28, 4},
Hard= {37, 33, 5, 66, 13},
Challenge= {0, 0, 0, 0, 0},
},
["DYNAMITE RAVE (\"AIR\" Special)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {47, 37, 159, 0, 1},
},
["Electrified"]
= {
Beginner= {22, 17, 0, 0, 0},
Easy= {31, 23, 0, 13, 0},
Medium= {44, 28, 16, 9, 3},
Hard= {58, 40, 32, 19, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Every Day, Every Night(NM STYLE)"]
= {
Beginner= {15, 15, 1, 5, 0},
Easy= {20, 15, 3, 0, 0},
Medium= {28, 22, 14, 22, 5},
Hard= {46, 37, 10, 12, 33},
Challenge= {0, 0, 0, 0, 0},
},
["Feelings Won't Fade(Extend Trance Mix)"]
= {
Beginner= {20, 18, 5, 18, 0},
Easy= {39, 23, 3, 45, 0},
Medium= {50, 41, 30, 52, 11},
Hard= {73, 60, 38, 36, 39},
Challenge= {0, 0, 0, 0, 0},
},
["FIRE"]
= {
Beginner= {19, 23, 0, 0, 0},
Easy= {36, 30, 7, 39, 0},
Medium= {57, 61, 14, 24, 11},
Hard= {77, 92, 21, 19, 33},
Challenge= {0, 0, 0, 0, 0},
},
["Flow (Jammin' Ragga Mix)"]
= {
Beginner= {17, 16, 0, 0, 0},
Easy= {25, 21, 9, 55, 0},
Medium= {46, 48, 20, 27, 18},
Hard= {64, 75, 69, 42, 50},
Challenge= {0, 0, 0, 0, 0},
},
["Fly away -mix del matador-"]
= {
Beginner= {23, 21, 0, 8, 0},
Easy= {34, 21, 5, 11, 0},
Medium= {50, 37, 3, 15, 11},
Hard= {79, 64, 58, 20, 62},
Challenge= {0, 0, 0, 0, 0},
},
["Freeway Shuffle"]
= {
Beginner= {17, 18, 3, 13, 0},
Easy= {34, 24, 7, 27, 0},
Medium= {45, 42, 14, 17, 5},
Hard= {56, 48, 41, 58, 16},
Challenge= {71, 60, 9, 9, 45},
},
["GIRIGILI門前雀羅"]
= {
Beginner= {17, 18, 1, 0, 0},
Easy= {35, 24, 9, 4, 0},
Medium= {53, 42, 12, 9, 13},
Hard= {73, 55, 23, 4, 42},
Challenge= {0, 0, 0, 0, 0},
},
["L'amour et la liberté(Darwin & DJ Silver remix)"]
= {
Beginner= {13, 11, 1, 12, 0},
Easy= {21, 22, 3, 38, 0},
Medium= {33, 33, 21, 37, 4},
Hard= {57, 56, 25, 3, 39},
Challenge= {0, 0, 0, 0, 0},
},
["MARS WAR 3"]
= {
Beginner= {17, 16, 9, 0, 0},
Easy= {25, 25, 10, 0, 0},
Medium= {46, 41, 36, 65, 1},
Hard= {74, 58, 29, 37, 19},
Challenge= {0, 0, 0, 0, 0},
},
["MOONSTER"]
= {
Beginner= {18, 11, 0, 21, 0},
Easy= {31, 23, 0, 17, 0},
Medium= {48, 40, 20, 34, 8},
Hard= {62, 69, 7, 64, 41},
Challenge= {0, 0, 0, 0, 0},
},
["Music In The Rhythm"]
= {
Beginner= {25, 18, 0, 0, 0},
Easy= {44, 25, 27, 38, 0},
Medium= {56, 37, 36, 17, 15},
Hard= {72, 50, 29, 22, 43},
Challenge= {0, 0, 0, 0, 0},
},
["NGO"]
= {
Beginner= {27, 29, 25, 0, 0},
Easy= {42, 39, 69, 11, 2},
Medium= {54, 58, 45, 17, 11},
Hard= {78, 78, 40, 17, 34},
Challenge= {88, 78, 118, 17, 45},
},
["PARANOiA ～HADES～"]
= {
Beginner= {39, 41, 1, 0, 0},
Easy= {67, 41, 72, 6, 0},
Medium= {89, 93, 113, 6, 29},
Hard= {104, 112, 90, 6, 56},
Challenge= {155, 158, 74, 6, 105},
},
["Pluto"]
= {
Beginner= {18, 19, 5, 0, 11},
Easy= {37, 49, 5, 2, 56},
Medium= {55, 64, 18, 31, 104},
Hard= {70, 84, 45, 19, 116},
Challenge= {98, 124, 32, 25, 145},
},
["Pluto Relinquish"]
= {
Beginner= {9, 25, 0, 0, 0},
Easy= {71, 76, 29, 59, 6},
Medium= {83, 145, 54, 31, 93},
Hard= {127, 158, 76, 29, 113},
Challenge= {131, 158, 76, 35, 115},
},
["Poseidon"]
= {
Beginner= {17, 22, 0, 0, 0},
Easy= {25, 30, 30, 23, 0},
Medium= {45, 45, 43, 8, 19},
Hard= {60, 99, 25, 21, 47},
Challenge= {0, 0, 0, 0, 0},
},
["Raspberry♡Heart(English version)"]
= {
Beginner= {25, 20, 0, 0, 0},
Easy= {36, 26, 16, 3, 0},
Medium= {46, 26, 43, 5, 0},
Hard= {56, 40, 61, 15, 7},
Challenge= {61, 53, 50, 1, 19},
},
["Saturn"]
= {
Beginner= {15, 18, 0, 0, 0},
Easy= {33, 36, 34, 28, 3},
Medium= {49, 48, 27, 25, 16},
Hard= {62, 60, 23, 38, 43},
Challenge= {0, 0, 0, 0, 0},
},
["Shades of Grey"]
= {
Beginner= {12, 21, 12, 0, 0},
Easy= {28, 28, 20, 14, 0},
Medium= {48, 56, 36, 16, 3},
Hard= {55, 56, 40, 16, 6},
Challenge= {0, 0, 0, 0, 0},
},
["Silver Platform - I wanna get your heart -"]
= {
Beginner= {16, 23, 1, 7, 0},
Easy= {34, 23, 20, 70, 0},
Medium= {46, 40, 32, 55, 5},
Hard= {69, 58, 16, 32, 39},
Challenge= {0, 0, 0, 0, 0},
},
["SOUL CRASH"]
= {
Beginner= {19, 17, 5, 0, 0},
Easy= {41, 29, 38, 20, 0},
Medium= {59, 41, 14, 11, 18},
Hard= {79, 53, 45, 15, 61},
Challenge= {0, 0, 0, 0, 0},
},
["Star Gate Heaven (FUTURE LOVE Mix)"]
= {
Beginner= {17, 18, 7, 11, 0},
Easy= {36, 24, 18, 27, 0},
Medium= {52, 49, 34, 39, 9},
Hard= {75, 67, 52, 18, 60},
Challenge= {0, 0, 0, 0, 0},
},
["STARS☆☆☆ (Re-tuned by HΛL) - DDR EDITION -"]
= {
Beginner= {21, 18, 9, 0, 0},
Easy= {32, 24, 34, 7, 0},
Medium= {55, 42, 23, 12, 16},
Hard= {59, 48, 16, 0, 23},
Challenge= {0, 0, 0, 0, 0},
},
["stealth"]
= {
Beginner= {17, 13, 1, 0, 0},
Easy= {36, 26, 9, 12, 0},
Medium= {47, 33, 16, 31, 10},
Hard= {62, 60, 38, 73, 20},
Challenge= {0, 0, 0, 0, 0},
},
["SUNKiSS♥DROP"]
= {
Beginner= {26, 23, 1, 0, 0},
Easy= {37, 30, 7, 6, 0},
Medium= {45, 38, 43, 10, 5},
Hard= {82, 61, 25, 12, 30},
Challenge= {67, 61, 90, 14, 20},
},
["switch"]
= {
Beginner= {21, 18, 0, 0, 0},
Easy= {36, 25, 20, 28, 0},
Medium= {47, 37, 30, 28, 6},
Hard= {58, 50, 34, 50, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Trim"]
= {
Beginner= {20, 24, 0, 0, 1},
Easy= {35, 32, 18, 31, 3},
Medium= {59, 65, 43, 26, 25},
Hard= {88, 90, 72, 65, 58},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE PhoeniX"]
= {
Beginner= {16, 19, 9, 0, 0},
Easy= {34, 26, 89, 4, 6},
Medium= {60, 52, 83, 4, 36},
Hard= {86, 79, 78, 4, 100},
Challenge= {103, 79, 25, 4, 104},
},
["Trust -DanceDanceRevolution mix-"]
= {
Beginner= {14, 13, 1, 0, 0},
Easy= {29, 27, 14, 12, 0},
Medium= {43, 47, 21, 34, 5},
Hard= {56, 54, 52, 48, 16},
Challenge= {0, 0, 0, 0, 0},
},
["Unreal"]
= {
Beginner= {20, 21, 3, 0, 0},
Easy= {44, 42, 108, 0, 9},
Medium= {64, 56, 132, 0, 31},
Hard= {83, 77, 106, 0, 51},
Challenge= {0, 0, 0, 0, 0},
},
["Uranus"]
= {
Beginner= {23, 24, 7, 0, 0},
Easy= {39, 24, 29, 0, 3},
Medium= {54, 48, 10, 13, 19},
Hard= {66, 48, 29, 15, 35},
Challenge= {77, 55, 36, 0, 64},
},
["Vem brincar"]
= {
Beginner= {15, 16, 1, 11, 0},
Easy= {29, 22, 20, 45, 0},
Medium= {42, 33, 34, 40, 6},
Hard= {50, 56, 40, 88, 18},
Challenge= {0, 0, 0, 0, 0},
},
["Venus"]
= {
Beginner= {11, 7, 7, 0, 0},
Easy= {23, 24, 7, 48, 0},
Medium= {48, 32, 20, 34, 0},
Hard= {67, 64, 16, 52, 17},
Challenge= {82, 64, 32, 47, 30},
},
["volcano"]
= {
Beginner= {15, 20, 7, 6, 0},
Easy= {29, 20, 7, 16, 0},
Medium= {47, 40, 18, 40, 1},
Hard= {83, 69, 43, 44, 23},
Challenge= {0, 0, 0, 0, 0},
},
["Votum stellarum -forest #25 DDR RMX-"]
= {
Beginner= {10, 11, 7, 0, 0},
Easy= {24, 23, 9, 15, 0},
Medium= {51, 52, 14, 0, 16},
Hard= {69, 58, 18, 0, 44},
Challenge= {0, 0, 0, 0, 0},
},
["Why not"]
= {
Beginner= {28, 21, 1, 0, 0},
Easy= {50, 29, 3, 24, 0},
Medium= {56, 43, 49, 24, 5},
Hard= {69, 65, 36, 33, 20},
Challenge= {0, 0, 0, 0, 0},
},
["怒れる大きな白い馬"]
= {
Beginner= {21, 17, 0, 0, 0},
Easy= {30, 23, 0, 11, 0},
Medium= {48, 35, 16, 3, 12},
Hard= {74, 53, 0, 14, 62},
Challenge= {0, 0, 0, 0, 0},
},
["カゲロウ"]
= {
Beginner= {23, 20, 1, 0, 0},
Easy= {31, 27, 1, 13, 0},
Medium= {47, 34, 32, 10, 1},
Hard= {59, 47, 12, 19, 18},
Challenge= {0, 0, 0, 0, 0},
},
["月光蝶"]
= {
Beginner= {28, 27, 1, 0, 0},
Easy= {29, 27, 1, 24, 0},
Medium= {54, 36, 9, 8, 2},
Hard= {73, 54, 30, 20, 21},
Challenge= {0, 0, 0, 0, 0},
},
["この子の七つのお祝いに"]
= {
Beginner= {20, 13, 3, 0, 4},
Easy= {43, 40, 10, 29, 23},
Medium= {66, 53, 20, 13, 69},
Hard= {95, 103, 12, 4, 103},
Challenge= {0, 0, 0, 0, 0},
},
["男々道"]
= {
Beginner= {23, 19, 1, 0, 0},
Easy= {31, 26, 1, 0, 0},
Medium= {43, 39, 43, 12, 5},
Hard= {71, 66, 40, 0, 34},
Challenge= {0, 0, 0, 0, 0},
},
["チカラ"]
= {
Beginner= {24, 23, 7, 0, 0},
Easy= {32, 30, 7, 0, 0},
Medium= {58, 53, 47, 21, 6},
Hard= {79, 61, 7, 1, 25},
Challenge= {0, 0, 0, 0, 0},
},
["虹色"]
= {
Beginner= {21, 20, 14, 0, 0},
Easy= {25, 26, 16, 0, 0},
Medium= {55, 46, 1, 8, 11},
Hard= {71, 60, 7, 0, 43},
Challenge= {93, 66, 9, 12, 69},
},
["華爛漫 -Flowers-"]
= {
Beginner= {23, 19, 1, 0, 0},
Easy= {40, 26, 7, 7, 0},
Medium= {52, 39, 41, 3, 6},
Hard= {67, 52, 30, 3, 23},
Challenge= {0, 0, 0, 0, 0},
},
["ヒマワリ"]
= {
Beginner= {23, 23, 7, 0, 0},
Easy= {30, 30, 14, 23, 0},
Medium= {54, 53, 14, 17, 3},
Hard= {72, 61, 52, 6, 25},
Challenge= {0, 0, 0, 0, 0},
},
["夢幻ノ光"]
= {
Beginner= {23, 21, 10, 0, 0},
Easy= {24, 21, 10, 41, 0},
Medium= {49, 42, 38, 72, 7},
Hard= {68, 56, 18, 45, 25},
Challenge= {0, 0, 0, 0, 0},
},
["A Stupid Barber"]
= {
Beginner= {21, 21, 9, 0, 0},
Easy= {30, 21, 9, 29, 0},
Medium= {43, 33, 32, 37, 6},
Hard= {55, 43, 14, 40, 21},
Challenge= {0, 0, 0, 0, 0},
},
["AA"]
= {
Beginner= {23, 19, 0, 0, 0},
Easy= {40, 25, 20, 8, 0},
Medium= {59, 44, 54, 8, 21},
Hard= {83, 70, 16, 8, 86},
Challenge= {0, 0, 0, 0, 0},
},
["Bad Routine"]
= {
Beginner= {21, 21, 5, 0, 0},
Easy= {27, 21, 16, 11, 0},
Medium= {40, 31, 25, 20, 10},
Hard= {44, 37, 18, 58, 16},
Challenge= {0, 0, 0, 0, 0},
},
["Baile Le Samba"]
= {
Beginner= {11, 11, 0, 0, 0},
Easy= {12, 15, 5, 0, 0},
Medium= {37, 38, 34, 49, 53},
Hard= {49, 38, 60, 51, 100},
Challenge= {0, 0, 0, 0, 0},
},
["BALLAD FOR YOU～想いの雨～"]
= {
Beginner= {10, 10, 0, 0, 0},
Easy= {20, 24, 0, 35, 13},
Medium= {28, 32, 0, 86, 45},
Hard= {40, 32, 0, 65, 87},
Challenge= {0, 0, 0, 0, 0},
},
["Brazilian Anthem"]
= {
Beginner= {18, 16, 0, 0, 0},
Easy= {34, 21, 25, 29, 0},
Medium= {47, 37, 23, 54, 13},
Hard= {60, 48, 29, 28, 66},
Challenge= {0, 0, 0, 0, 0},
},
["cachaca"]
= {
Beginner= {11, 10, 0, 50, 0},
Easy= {19, 21, 1, 41, 0},
Medium= {38, 37, 38, 15, 6},
Hard= {56, 53, 40, 47, 79},
Challenge= {0, 0, 0, 0, 0},
},
["Can Be Real"]
= {
Beginner= {22, 21, 7, 0, 0},
Easy= {27, 21, 0, 19, 0},
Medium= {43, 33, 14, 11, 6},
Hard= {55, 43, 7, 48, 20},
Challenge= {0, 0, 0, 0, 0},
},
["CAN'T STOP FALLIN' IN LOVE -super euro version-"]
= {
Beginner= {19, 12, 1, 0, 0},
Easy= {23, 19, 1, 0, 0},
Medium= {38, 38, 1, 21, 8},
Hard= {56, 45, 0, 0, 15},
Challenge= {0, 0, 0, 0, 0},
},
["CENTAUR"]
= {
Beginner= {17, 11, 0, 0, 2},
Easy= {34, 29, 3, 66, 13},
Medium= {49, 40, 10, 60, 28},
Hard= {67, 58, 30, 36, 65},
Challenge= {0, 0, 0, 0, 0},
},
["CHAOS"]
= {
Beginner= {12, 15, 0, 0, 24},
Easy= {41, 40, 5, 15, 115},
Medium= {55, 45, 7, 7, 134},
Hard= {72, 60, 21, 11, 164},
Challenge= {91, 81, 29, 14, 200},
},
["CURUS"]
= {
Beginner= {17, 15, 0, 0, 0},
Easy= {18, 15, 0, 0, 0},
Medium= {25, 30, 3, 173, 0},
Hard= {61, 61, 38, 78, 15},
Challenge= {0, 0, 0, 0, 0},
},
["DoLL"]
= {
Beginner= {21, 21, 0, 0, 0},
Easy= {34, 28, 3, 30, 0},
Medium= {44, 42, 14, 114, 3},
Hard= {65, 85, 27, 87, 27},
Challenge= {76, 85, 49, 80, 45},
},
["Dragon Blade"]
= {
Beginner= {34, 30, 7, 0, 0},
Easy= {53, 40, 9, 3, 1},
Medium= {66, 60, 9, 3, 5},
Hard= {84, 69, 3, 3, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Fascination ～eternal love mix～"]
= {
Beginner= {46, 49, 40, 11, 0},
Easy= {58, 73, 101, 10, 6},
Medium= {81, 98, 98, 0, 29},
Hard= {137, 129, 20, 3, 102},
Challenge= {132, 135, 110, 12, 95},
},
["Fascination MAXX"]
= {
Beginner= {19, 20, 0, 0, 8},
Easy= {53, 41, 32, 18, 64},
Medium= {78, 94, 43, 7, 102},
Hard= {149, 149, 16, 4, 137},
Challenge= {160, 149, 18, 12, 138},
},
["Flow"]
= {
Beginner= {23, 17, 7, 0, 0},
Easy= {33, 23, 47, 63, 0},
Medium= {49, 34, 80, 25, 10},
Hard= {64, 58, 100, 5, 32},
Challenge= {0, 0, 0, 0, 0},
},
["Flow (True Style)"]
= {
Beginner= {23, 22, 7, 0, 0},
Easy= {33, 30, 47, 107, 0},
Medium= {49, 44, 80, 43, 10},
Hard= {64, 60, 100, 5, 26},
Challenge= {75, 60, 65, 1, 39},
},
["Fly away"]
= {
Beginner= {19, 15, 0, 0, 0},
Easy= {21, 20, 0, 12, 0},
Medium= {39, 31, 7, 44, 2},
Hard= {64, 51, 5, 8, 43},
Challenge= {0, 0, 0, 0, 0},
},
["Forever Sunshine"]
= {
Beginner= {23, 21, 5, 0, 0},
Easy= {23, 21, 10, 36, 0},
Medium= {40, 31, 9, 48, 5},
Hard= {46, 42, 40, 63, 8},
Challenge= {0, 0, 0, 0, 0},
},
["Freedom"]
= {
Beginner= {25, 24, 1, 0, 0},
Easy= {31, 24, 0, 59, 0},
Medium= {44, 49, 47, 17, 4},
Hard= {66, 67, 23, 22, 32},
Challenge= {0, 0, 0, 0, 0},
},
["Funk Boogie"]
= {
Beginner= {21, 21, 9, 0, 0},
Easy= {28, 21, 10, 41, 0},
Medium= {28, 21, 10, 26, 0},
Hard= {50, 42, 10, 55, 11},
Challenge= {0, 0, 0, 0, 0},
},
["GORGEOUS 2012"]
= {
Beginner= {16, 22, 10, 0, 0},
Easy= {16, 16, 14, 0, 0},
Medium= {48, 39, 27, 29, 10},
Hard= {56, 44, 49, 30, 20},
Challenge= {0, 0, 0, 0, 0},
},
["HAPPY☆ANGEL"]
= {
Beginner= {27, 22, 0, 0, 0},
Easy= {28, 30, 0, 11, 0},
Medium= {57, 37, 65, 35, 8},
Hard= {80, 60, 69, 24, 32},
Challenge= {0, 0, 0, 0, 0},
},
["Healing-D-Vision"]
= {
Beginner= {30, 28, 3, 0, 0},
Easy= {54, 57, 20, 25, 17},
Medium= {70, 77, 106, 13, 47},
Hard= {85, 77, 112, 13, 79},
Challenge= {113, 103, 90, 13, 102},
},
["I Need You"]
= {
Beginner= {22, 18, 0, 0, 0},
Easy= {23, 18, 1, 23, 0},
Medium= {35, 28, 9, 28, 4},
Hard= {40, 37, 12, 39, 9},
Challenge= {0, 0, 0, 0, 0},
},
["iFUTURELIST(DDR VERSION)"]
= {
Beginner= {18, 18, 5, 0, 0},
Easy= {28, 25, 10, 35, 0},
Medium= {47, 43, 10, 64, 12},
Hard= {61, 56, 41, 18, 47},
Challenge= {73, 75, 69, 9, 92},
},
["INNOCENCE OF SILENCE"]
= {
Beginner= {15, 9, 0, 0, 0},
Easy= {30, 24, 0, 42, 2},
Medium= {39, 49, 0, 42, 40},
Hard= {59, 53, 0, 46, 102},
Challenge= {0, 0, 0, 0, 0},
},
["INSIDE YOUR HEART"]
= {
Beginner= {15, 13, 1, 0, 0},
Easy= {23, 17, 0, 28, 0},
Medium= {37, 26, 5, 13, 7},
Hard= {49, 35, 16, 10, 28},
Challenge= {0, 0, 0, 0, 0},
},
["Jam & Marmalade"]
= {
Beginner= {26, 24, 0, 0, 0},
Easy= {31, 24, 10, 28, 0},
Medium= {51, 48, 47, 13, 10},
Hard= {60, 48, 63, 22, 32},
Challenge= {0, 0, 0, 0, 0},
},
["KEEP ON MOVIN' ～DMX MIX～"]
= {
Beginner= {19, 22, 9, 0, 0},
Easy= {29, 21, 12, 45, 0},
Medium= {40, 33, 12, 42, 6},
Hard= {67, 49, 34, 44, 43},
Challenge= {0, 0, 0, 0, 0},
},
["La Bamba"]
= {
Beginner= {23, 19, 10, 0, 0},
Easy= {32, 25, 38, 4, 0},
Medium= {51, 38, 70, 4, 10},
Hard= {68, 51, 65, 4, 32},
Challenge= {0, 0, 0, 0, 0},
},
["LOGICAL DASH"]
= {
Beginner= {20, 18, 10, 0, 0},
Easy= {30, 23, 14, 17, 0},
Medium= {45, 41, 32, 25, 3},
Hard= {61, 47, 34, 32, 25},
Challenge= {0, 0, 0, 0, 0},
},
["LOVE IS ORANGE"]
= {
Beginner= {25, 15, 0, 6, 0},
Easy= {33, 30, 18, 10, 0},
Medium= {49, 44, 14, 29, 4},
Hard= {56, 44, 14, 0, 11},
Challenge= {74, 60, 14, 11, 27},
},
["Make A Difference"]
= {
Beginner= {16, 16, 1, 17, 0},
Easy= {30, 21, 20, 33, 0},
Medium= {45, 37, 12, 66, 7},
Hard= {64, 54, 10, 56, 57},
Challenge= {0, 0, 0, 0, 0},
},
["MARIA(I believe...)"]
= {
Beginner= {23, 19, 1, 20, 0},
Easy= {33, 26, 7, 85, 0},
Medium= {50, 46, 12, 28, 11},
Hard= {69, 65, 47, 20, 29},
Challenge= {0, 0, 0, 0, 0},
},
["MAX 300 (Super-Max-Me Mix)"]
= {
Beginner= {39, 49, 9, 28, 0},
Easy= {67, 49, 40, 35, 1},
Medium= {80, 99, 115, 37, 12},
Hard= {127, 99, 72, 41, 37},
Challenge= {136, 99, 70, 41, 41},
},
["MAXIMIZER"]
= {
Beginner= {31, 31, 14, 0, 0},
Easy= {43, 31, 9, 41, 0},
Medium= {56, 54, 16, 35, 20},
Hard= {76, 62, 27, 22, 38},
Challenge= {0, 0, 0, 0, 0},
},
["MIDNIGHT SPECIAL"]
= {
Beginner= {26, 30, 0, 31, 0},
Easy= {37, 30, 60, 61, 0},
Medium= {61, 60, 60, 22, 21},
Hard= {69, 60, 65, 20, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Mind Parasite"]
= {
Beginner= {18, 18, 9, 0, 0},
Easy= {30, 30, 10, 60, 0},
Medium= {48, 48, 25, 56, 13},
Hard= {79, 72, 9, 41, 93},
Challenge= {0, 0, 0, 0, 0},
},
["Monkey Punk"]
= {
Beginner= {29, 29, 0, 22, 0},
Easy= {43, 29, 25, 45, 0},
Medium= {51, 44, 80, 34, 4},
Hard= {62, 52, 16, 58, 20},
Challenge= {0, 0, 0, 0, 0},
},
["MOON"]
= {
Beginner= {20, 19, 1, 0, 0},
Easy= {20, 19, 1, 35, 0},
Medium= {50, 38, 16, 14, 7},
Hard= {67, 45, 23, 19, 24},
Challenge= {0, 0, 0, 0, 0},
},
["murmur twins"]
= {
Beginner= {17, 14, 5, 0, 1},
Easy= {18, 21, 5, 22, 2},
Medium= {50, 43, 7, 13, 15},
Hard= {68, 57, 10, 9, 29},
Challenge= {0, 0, 0, 0, 0},
},
["My Only Shining Star"]
= {
Beginner= {15, 12, 7, 0, 0},
Easy= {17, 25, 9, 0, 0},
Medium= {31, 45, 10, 13, 3},
Hard= {54, 57, 9, 0, 19},
Challenge= {0, 0, 0, 0, 0},
},
["No.13"]
= {
Beginner= {23, 21, 5, 0, 0},
Easy= {40, 28, 10, 37, 0},
Medium= {65, 50, 47, 12, 20},
Hard= {93, 64, 14, 26, 48},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA-Respect-"]
= {
Beginner= {18, 24, 5, 0, 0},
Easy= {69, 48, 18, 15, 0},
Medium= {83, 97, 38, 25, 15},
Hard= {123, 97, 25, 38, 60},
Challenge= {0, 0, 0, 0, 0},
},
["PASSION OF LOVE"]
= {
Beginner= {20, 18, 0, 0, 0},
Easy= {31, 25, 5, 33, 0},
Medium= {46, 37, 1, 38, 9},
Hard= {60, 50, 3, 39, 24},
Challenge= {0, 0, 0, 0, 0},
},
["Polovtsian Dances And Chorus"]
= {
Beginner= {20, 18, 0, 14, 0},
Easy= {29, 24, 1, 21, 0},
Medium= {45, 36, 7, 74, 7},
Hard= {65, 48, 12, 9, 33},
Challenge= {0, 0, 0, 0, 0},
},
["PUT YOUR FAITH IN ME ～SATURDAY NIGHT MIX～"]
= {
Beginner= {17, 14, 0, 0, 0},
Easy= {28, 19, 1, 22, 0},
Medium= {46, 34, 9, 44, 10},
Hard= {55, 34, 14, 42, 18},
Challenge= {0, 0, 0, 0, 0},
},
["Quickening"]
= {
Beginner= {22, 24, 7, 0, 0},
Easy= {32, 24, 10, 82, 0},
Medium= {44, 37, 52, 62, 2},
Hard= {67, 93, 7, 40, 36},
Challenge= {0, 0, 0, 0, 0},
},
["Quick Master"]
= {
Beginner= {19, 18, 9, 0, 0},
Easy= {31, 24, 10, 56, 0},
Medium= {50, 36, 30, 47, 13},
Hard= {62, 48, 25, 48, 34},
Challenge= {0, 0, 0, 0, 0},
},
["rainbow flyer"]
= {
Beginner= {17, 18, 1, 0, 0},
Easy= {24, 24, 16, 30, 0},
Medium= {35, 30, 54, 26, 0},
Hard= {57, 55, 32, 67, 22},
Challenge= {0, 0, 0, 0, 0},
},
["rainbow rainbow"]
= {
Beginner= {18, 14, 0, 0, 0},
Easy= {20, 29, 0, 0, 0},
Medium= {38, 58, 7, 29, 1},
Hard= {69, 58, 0, 32, 20},
Challenge= {0, 0, 0, 0, 0},
},
["RED ZONE"]
= {
Beginner= {28, 20, 12, 0, 0},
Easy= {42, 27, 23, 40, 0},
Medium= {55, 41, 36, 40, 11},
Hard= {80, 68, 10, 22, 51},
Challenge= {0, 0, 0, 0, 0},
},
["Saturday Night Love"]
= {
Beginner= {17, 15, 1, 0, 0},
Easy= {23, 21, 5, 39, 0},
Medium= {39, 31, 9, 64, 4},
Hard= {46, 37, 10, 71, 11},
Challenge= {0, 0, 0, 0, 0},
},
["Scorching Moon"]
= {
Beginner= {19, 20, 7, 0, 0},
Easy= {34, 20, 1, 11, 0},
Medium= {42, 31, 49, 23, 3},
Hard= {50, 51, 74, 29, 30},
Challenge= {0, 0, 0, 0, 0},
},
["SEDUCTION"]
= {
Beginner= {20, 20, 5, 0, 0},
Easy= {31, 27, 14, 71, 0},
Medium= {49, 55, 29, 27, 11},
Hard= {79, 76, 38, 30, 50},
Challenge= {0, 0, 0, 0, 0},
},
["SEDUCTION(Vocal Remix)"]
= {
Beginner= {27, 23, 1, 0, 0},
Easy= {46, 31, 3, 8, 0},
Medium= {63, 47, 7, 21, 13},
Hard= {79, 63, 52, 2, 35},
Challenge= {0, 0, 0, 0, 0},
},
["Ska Ska No.3"]
= {
Beginner= {19, 17, 0, 0, 0},
Easy= {23, 23, 3, 0, 0},
Medium= {48, 34, 5, 0, 11},
Hard= {57, 46, 43, 3, 31},
Challenge= {0, 0, 0, 0, 0},
},
["Star Gate Heaven"]
= {
Beginner= {21, 18, 1, 0, 0},
Easy= {25, 18, 1, 3, 0},
Medium= {48, 30, 16, 3, 7},
Hard= {62, 42, 0, 14, 32},
Challenge= {0, 0, 0, 0, 0},
},
["STARS☆☆☆(2nd NAOKI's style)"]
= {
Beginner= {20, 17, 9, 0, 0},
Easy= {36, 34, 12, 56, 1},
Medium= {43, 40, 38, 55, 5},
Hard= {57, 40, 54, 55, 15},
Challenge= {0, 0, 0, 0, 0},
},
["THE SHINING POLARIS"]
= {
Beginner= {20, 18, 9, 0, 0},
Easy= {21, 18, 14, 0, 0},
Medium= {34, 30, 20, 79, 1},
Hard= {47, 42, 18, 107, 8},
Challenge= {0, 0, 0, 0, 0},
},
["TIERRA BUENA"]
= {
Beginner= {15, 14, 9, 0, 0},
Easy= {29, 19, 9, 8, 0},
Medium= {45, 33, 14, 8, 14},
Hard= {58, 47, 20, 8, 32},
Challenge= {0, 0, 0, 0, 0},
},
["TOMORROW"]
= {
Beginner= {19, 17, 12, 3, 0},
Easy= {26, 23, 1, 52, 0},
Medium= {45, 40, 1, 17, 10},
Hard= {62, 58, 45, 31, 42},
Challenge= {0, 0, 0, 0, 0},
},
["Tomorrow Perfume"]
= {
Beginner= {21, 18, 0, 0, 0},
Easy= {29, 23, 0, 25, 0},
Medium= {46, 36, 23, 40, 5},
Hard= {60, 54, 5, 54, 26},
Challenge= {0, 0, 0, 0, 0},
},
["TRUE♥LOVE"]
= {
Beginner= {27, 23, 0, 0, 0},
Easy= {34, 31, 0, 11, 0},
Medium= {55, 31, 72, 19, 0},
Hard= {74, 62, 43, 1, 25},
Challenge= {0, 0, 0, 0, 0},
},
["Try 2 Luv. U"]
= {
Beginner= {18, 14, 5, 0, 0},
Easy= {19, 19, 5, 38, 0},
Medium= {34, 28, 20, 72, 4},
Hard= {40, 38, 18, 76, 11},
Challenge= {0, 0, 0, 0, 0},
},
["un deux trois"]
= {
Beginner= {22, 21, 3, 0, 0},
Easy= {26, 21, 1, 53, 0},
Medium= {40, 37, 23, 68, 5},
Hard= {58, 43, 21, 36, 21},
Challenge= {0, 0, 0, 0, 0},
},
["Under the Sky"]
= {
Beginner= {14, 14, 0, 0, 0},
Easy= {14, 14, 0, 10, 0},
Medium= {25, 28, 0, 29, 0},
Hard= {43, 56, 0, 104, 11},
Challenge= {0, 0, 0, 0, 0},
},
["Xepher"]
= {
Beginner= {22, 21, 9, 0, 0},
Easy= {44, 28, 34, 40, 1},
Medium= {68, 49, 52, 25, 18},
Hard= {89, 63, 36, 25, 53},
Challenge= {113, 85, 36, 25, 101},
},
["You gotta move it (feat. Julie Rugaard)"]
= {
Beginner= {16, 16, 1, 3, 0},
Easy= {26, 22, 3, 42, 0},
Medium= {37, 33, 7, 59, 7},
Hard= {50, 50, 12, 45, 28},
Challenge= {0, 0, 0, 0, 0},
},
["LA BAMBA"]
= {
Beginner= {22, 22, 7, 0, 0},
Easy= {27, 29, 9, 19, 0},
Medium= {47, 37, 14, 39, 3},
Hard= {68, 59, 34, 33, 24},
Challenge= {0, 0, 0, 0, 0},
},
["蒼い衝動 ～for EXTREME～"]
= {
Beginner= {21, 11, 1, 0, 0},
Easy= {28, 24, 9, 22, 0},
Medium= {46, 36, 21, 23, 5},
Hard= {60, 48, 40, 12, 27},
Challenge= {0, 0, 0, 0, 0},
},
["桜"]
= {
Beginner= {33, 32, 0, 0, 0},
Easy= {46, 42, 14, 9, 0},
Medium= {70, 75, 7, 5, 7},
Hard= {92, 103, 16, 1, 31},
Challenge= {73, 64, 9, 1, 11},
},
["大見解"]
= {
Beginner= {31, 26, 10, 0, 0},
Easy= {33, 26, 10, 18, 0},
Medium= {51, 46, 83, 24, 4},
Hard= {81, 52, 16, 31, 34},
Challenge= {82, 52, 30, 31, 35},
},
["三毛猫ロック"]
= {
Beginner= {22, 20, 7, 0, 0},
Easy= {26, 20, 16, 69, 0},
Medium= {46, 60, 1, 17, 6},
Hard= {64, 80, 21, 42, 29},
Challenge= {0, 0, 0, 0, 0},
},
["A"]
= {
Beginner= {20, 17, 7, 0, 0},
Easy= {29, 22, 5, 13, 0},
Medium= {47, 40, 3, 11, 13},
Hard= {65, 45, 7, 14, 34},
Challenge= {64, 45, 83, 12, 37},
},
["Across the nightmare"]
= {
Beginner= {41, 37, 14, 0, 0},
Easy= {49, 50, 23, 0, 1},
Medium= {66, 62, 18, 21, 7},
Hard= {74, 100, 70, 15, 15},
Challenge= {90, 100, 83, 0, 25},
},
["air"]
= {
Beginner= {23, 16, 10, 0, 0},
Easy= {40, 21, 40, 0, 0},
Medium= {47, 32, 5, 3, 7},
Hard= {58, 37, 16, 26, 17},
Challenge= {0, 0, 0, 0, 0},
},
["AM-3P -303 BASS MIX-"]
= {
Beginner= {21, 21, 20, 0, 0},
Easy= {28, 21, 14, 0, 0},
Medium= {47, 43, 16, 0, 16},
Hard= {53, 43, 32, 0, 26},
Challenge= {0, 0, 0, 0, 0},
},
["bag"]
= {
Beginner= {9, 7, 1, 0, 0},
Easy= {32, 21, 21, 0, 14},
Medium= {45, 32, 54, 0, 66},
Hard= {83, 51, 0, 0, 118},
Challenge= {83, 51, 0, 0, 119},
},
["BE LOVIN"]
= {
Beginner= {35, 30, 40, 0, 0},
Easy= {40, 30, 7, 9, 0},
Medium= {60, 61, 20, 13, 11},
Hard= {80, 61, 20, 14, 27},
Challenge= {0, 0, 0, 0, 0},
},
["Colors ～for EXTREME～"]
= {
Beginner= {22, 18, 25, 0, 0},
Easy= {34, 25, 25, 37, 0},
Medium= {50, 50, 21, 32, 7},
Hard= {58, 50, 23, 32, 17},
Challenge= {81, 75, 12, 16, 78},
},
["CUTIE CHASER(MORNING MIX)"]
= {
Beginner= {17, 20, 16, 0, 0},
Easy= {22, 20, 1, 0, 0},
Medium= {34, 20, 3, 0, 0},
Hard= {52, 41, 27, 26, 16},
Challenge= {0, 0, 0, 0, 0},
},
["Dance Dance Revolution"]
= {
Beginner= {26, 25, 52, 0, 0},
Easy= {36, 25, 69, 0, 0},
Medium= {51, 37, 107, 4, 10},
Hard= {74, 56, 52, 0, 49},
Challenge= {78, 62, 12, 0, 42},
},
["Destiny lovers"]
= {
Beginner= {22, 14, 10, 0, 0},
Easy= {25, 21, 10, 12, 0},
Medium= {41, 28, 27, 66, 1},
Hard= {77, 70, 34, 31, 47},
Challenge= {0, 0, 0, 0, 0},
},
["DROP THE BOMB(SyS.F. Mix)"]
= {
Beginner= {18, 25, 21, 0, 0},
Easy= {31, 25, 21, 33, 0},
Medium= {43, 37, 21, 67, 5},
Hard= {60, 56, 27, 31, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Frozen Ray ～for EXTREME～"]
= {
Beginner= {23, 19, 1, 0, 0},
Easy= {32, 25, 10, 25, 0},
Medium= {52, 45, 12, 38, 11},
Hard= {75, 58, 9, 9, 38},
Challenge= {0, 0, 0, 0, 0},
},
["Gamelan de Couple"]
= {
Beginner= {27, 25, 3, 0, 0},
Easy= {36, 25, 5, 0, 0},
Medium= {42, 31, 16, 0, 4},
Hard= {73, 56, 5, 0, 74},
Challenge= {0, 0, 0, 0, 0},
},
["GRADUATION ～それぞれの明日～"]
= {
Beginner= {17, 15, 3, 0, 0},
Easy= {21, 20, 14, 0, 0},
Medium= {37, 31, 20, 49, 6},
Hard= {53, 41, 3, 4, 29},
Challenge= {0, 0, 0, 0, 0},
},
["Happy Wedding"]
= {
Beginner= {18, 15, 9, 0, 0},
Easy= {28, 20, 16, 1, 0},
Medium= {37, 31, 12, 23, 2},
Hard= {56, 41, 5, 17, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Heaven is a '57 metallic gray ～gimmix～"]
= {
Beginner= {23, 15, 1, 0, 0},
Easy= {30, 30, 1, 5, 0},
Medium= {48, 61, 14, 15, 10},
Hard= {63, 61, 40, 50, 50},
Challenge= {0, 0, 0, 0, 0},
},
["HYPER EUROBEAT"]
= {
Beginner= {19, 25, 18, 0, 0},
Easy= {36, 25, 9, 33, 0},
Medium= {46, 31, 14, 46, 2},
Hard= {61, 56, 49, 29, 24},
Challenge= {0, 0, 0, 0, 0},
},
["I'm gonna get you!"]
= {
Beginner= {21, 20, 10, 0, 0},
Easy= {28, 26, 12, 7, 0},
Medium= {44, 40, 36, 51, 2},
Hard= {66, 53, 30, 19, 25},
Challenge= {0, 0, 0, 0, 0},
},
["jane jana"]
= {
Beginner= {18, 20, 12, 0, 0},
Easy= {36, 20, 14, 0, 0},
Medium= {41, 31, 16, 0, 14},
Hard= {70, 41, 38, 0, 36},
Challenge= {0, 0, 0, 0, 0},
},
["JET WORLD"]
= {
Beginner= {27, 23, 16, 0, 0},
Easy= {37, 23, 10, 40, 0},
Medium= {52, 34, 10, 17, 10},
Hard= {74, 68, 14, 42, 53},
Challenge= {0, 0, 0, 0, 0},
},
["Kind Lady"]
= {
Beginner= {18, 11, 10, 0, 0},
Easy= {35, 22, 18, 43, 0},
Medium= {43, 33, 25, 57, 5},
Hard= {54, 44, 16, 58, 17},
Challenge= {75, 61, 20, 5, 69},
},
["KISS KISS KISS"]
= {
Beginner= {20, 25, 5, 0, 0},
Easy= {39, 25, 3, 3, 0},
Medium= {48, 31, 30, 22, 2},
Hard= {66, 62, 27, 101, 26},
Challenge= {0, 0, 0, 0, 0},
},
["Kiss me all night long"]
= {
Beginner= {22, 19, 5, 0, 0},
Easy= {24, 19, 3, 9, 0},
Medium= {40, 32, 14, 28, 0},
Hard= {66, 51, 32, 21, 33},
Challenge= {0, 0, 0, 0, 0},
},
["L'amour et la liberté(DDR Ver.)"]
= {
Beginner= {21, 18, 5, 0, 0},
Easy= {34, 23, 18, 58, 0},
Medium= {50, 36, 0, 53, 14},
Hard= {63, 54, 0, 10, 61},
Challenge= {0, 0, 0, 0, 0},
},
["♥Love²シュガ→♥"]
= {
Beginner= {23, 25, 3, 0, 0},
Easy= {31, 25, 20, 0, 0},
Medium= {43, 32, 34, 26, 1},
Hard= {59, 45, 56, 5, 26},
Challenge= {0, 0, 0, 0, 0},
},
["LOVE♥SHINE"]
= {
Beginner= {27, 29, 20, 0, 0},
Easy= {40, 29, 20, 24, 0},
Medium= {43, 51, 14, 24, 0},
Hard= {64, 51, 94, 45, 10},
Challenge= {0, 0, 0, 0, 0},
},
["Miracle Moon ～L.E.D.LIGHT STYLE MIX～"]
= {
Beginner= {20, 22, 1, 0, 0},
Easy= {28, 22, 1, 5, 0},
Medium= {41, 34, 21, 16, 5},
Hard= {57, 45, 34, 5, 25},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOIA survivor"]
= {
Beginner= {22, 21, 18, 0, 0},
Easy= {50, 54, 9, 10, 2},
Medium= {74, 65, 9, 10, 12},
Hard= {121, 98, 21, 17, 62},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOIA survivor MAX"]
= {
Beginner= {25, 34, 18, 0, 0},
Easy= {55, 57, 9, 5, 3},
Medium= {80, 68, 9, 5, 20},
Hard= {140, 119, 21, 9, 91},
Challenge= {159, 119, 49, 7, 100},
},
["Pink Rose"]
= {
Beginner= {18, 18, 7, 0, 0},
Easy= {27, 24, 9, 13, 0},
Medium= {43, 36, 34, 32, 4},
Hard= {54, 48, 49, 68, 27},
Challenge= {0, 0, 0, 0, 0},
},
["SO IN LOVE"]
= {
Beginner= {15, 18, 1, 0, 0},
Easy= {24, 18, 7, 70, 0},
Medium= {35, 37, 34, 68, 5},
Hard= {46, 37, 32, 57, 18},
Challenge= {0, 0, 0, 0, 0},
},
["STAY (Organic house Version)"]
= {
Beginner= {15, 15, 3, 0, 0},
Easy= {27, 20, 12, 3, 0},
Medium= {41, 31, 20, 20, 6},
Hard= {52, 41, 23, 14, 16},
Challenge= {0, 0, 0, 0, 0},
},
["stoic (EXTREME version)"]
= {
Beginner= {21, 19, 23, 0, 0},
Easy= {28, 25, 27, 0, 0},
Medium= {57, 51, 21, 9, 11},
Hard= {72, 89, 47, 20, 32},
Challenge= {0, 0, 0, 0, 0},
},
["sync (EXTREME version)"]
= {
Beginner= {20, 13, 12, 0, 0},
Easy= {38, 27, 9, 37, 0},
Medium= {55, 41, 10, 45, 7},
Hard= {66, 41, 56, 23, 12},
Challenge= {70, 62, 16, 26, 43},
},
["TEARS"]
= {
Beginner= {26, 23, 5, 0, 0},
Easy= {36, 23, 14, 31, 0},
Medium= {50, 47, 16, 20, 10},
Hard= {73, 59, 16, 24, 54},
Challenge= {0, 0, 0, 0, 0},
},
["The Least 100sec"]
= {
Beginner= {20, 21, 7, 0, 0},
Easy= {34, 32, 10, 13, 0},
Medium= {62, 53, 27, 20, 4},
Hard= {87, 64, 9, 8, 20},
Challenge= {0, 0, 0, 0, 0},
},
["The legend of MAX"]
= {
Beginner= {37, 39, 30, 0, 0},
Easy= {55, 52, 20, 10, 1},
Medium= {77, 91, 40, 31, 6},
Hard= {115, 108, 85, 10, 44},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE survivor"]
= {
Beginner= {26, 26, 3, 0, 0},
Easy= {40, 26, 3, 7, 0},
Medium= {63, 53, 14, 11, 28},
Hard= {76, 60, 1, 6, 54},
Challenge= {0, 0, 0, 0, 0},
},
["Twin Bee -Generation X-"]
= {
Beginner= {21, 20, 1, 0, 0},
Easy= {32, 28, 10, 5, 0},
Medium= {49, 42, 34, 17, 5},
Hard= {69, 56, 32, 47, 28},
Challenge= {0, 0, 0, 0, 0},
},
["V ～for EXTREME～"]
= {
Beginner= {23, 18, 7, 0, 0},
Easy= {29, 25, 18, 37, 0},
Medium= {51, 50, 34, 62, 9},
Hard= {70, 56, 14, 48, 33},
Challenge= {86, 87, 16, 22, 74},
},
["VANITY ANGEL"]
= {
Beginner= {17, 17, 3, 0, 0},
Easy= {31, 23, 0, 0, 0},
Medium= {50, 40, 0, 0, 15},
Hard= {69, 58, 0, 35, 79},
Challenge= {0, 0, 0, 0, 0},
},
["xenon"]
= {
Beginner= {27, 19, 7, 0, 0},
Easy= {36, 26, 25, 21, 0},
Medium= {62, 52, 27, 35, 20},
Hard= {86, 79, 0, 17, 100},
Challenge= {0, 0, 0, 0, 0},
},
["1998"]
= {
Beginner= {24, 25, 14, 0, 0},
Easy= {36, 25, 1, 3, 0},
Medium= {47, 31, 16, 3, 3},
Hard= {63, 50, 49, 9, 21},
Challenge= {0, 0, 0, 0, 0},
},
["321STARS"]
= {
Beginner= {23, 15, 1, 0, 0},
Easy= {36, 31, 3, 11, 0},
Medium= {59, 55, 3, 52, 12},
Hard= {76, 63, 16, 15, 29},
Challenge= {0, 0, 0, 0, 0},
},
["革命"]
= {
Beginner= {18, 18, 14, 0, 0},
Easy= {23, 30, 3, 64, 0},
Medium= {44, 42, 3, 41, 12},
Hard= {69, 54, 5, 20, 40},
Challenge= {58, 54, 1, 19, 31},
},
["AFRONOVA(FROM NONSTOP MEGAMIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {77, 66, 40, 14, 19},
},
["AM-3P(AM EAST mix)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {63, 58, 9, 4, 57},
},
["B4U(B4 ZA BEAT MIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {62, 63, 16, 54, 22},
},
["BRE∀K DOWN!"]
= {
Beginner= {20, 23, 1, 0, 0},
Easy= {28, 31, 25, 31, 0},
Medium= {54, 39, 54, 31, 1},
Hard= {78, 55, 56, 25, 23},
Challenge= {0, 0, 0, 0, 0},
},
["BRILLIANT 2U(K.O.G G3 MIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {63, 56, 45, 13, 37},
},
["BURNIN' THE FLOOR(BLUE FIRE mix)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {60, 45, 38, 21, 16},
},
["BURNING HEAT!(3 Option MIX)"]
= {
Beginner= {20, 20, 1, 0, 0},
Easy= {24, 20, 12, 39, 0},
Medium= {43, 41, 5, 38, 13},
Hard= {88, 82, 1, 13, 103},
Challenge= {0, 0, 0, 0, 0},
},
["CANDY♡"]
= {
Beginner= {29, 30, 10, 0, 0},
Easy= {26, 30, 27, 12, 0},
Medium= {48, 37, 47, 47, 0},
Hard= {66, 60, 30, 36, 16},
Challenge= {0, 0, 0, 0, 0},
},
["CELEBRATE NITE(EURO TRANCE STYLE)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {63, 47, 10, 14, 29},
},
["D2R"]
= {
Beginner= {25, 26, 0, 0, 0},
Easy= {31, 26, 5, 17, 0},
Medium= {49, 46, 34, 47, 6},
Hard= {68, 60, 27, 15, 38},
Challenge= {0, 0, 0, 0, 0},
},
["DESTINY"]
= {
Beginner= {23, 19, 7, 0, 0},
Easy= {23, 25, 5, 0, 0},
Medium= {47, 38, 21, 42, 8},
Hard= {66, 51, 58, 17, 33},
Challenge= {0, 0, 0, 0, 0},
},
["DIVE TO THE NIGHT"]
= {
Beginner= {24, 19, 23, 0, 0},
Easy= {31, 25, 25, 14, 0},
Medium= {54, 51, 67, 12, 8},
Hard= {73, 51, 58, 3, 32},
Challenge= {0, 0, 0, 0, 0},
},
["DROP OUT(FROM NONSTOP MEGAMIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {66, 86, 16, 11, 55},
},
["ECSTASY (midnight blue mix)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {59, 48, 30, 35, 28},
},
["HIGHER(next morning mix)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {60, 43, 25, 18, 30},
},
["HYSTERIA 2001"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {60, 63, 63, 94, 10},
},
["i feel ..."]
= {
Beginner= {18, 17, 1, 0, 0},
Easy= {27, 23, 7, 14, 0},
Medium= {41, 35, 18, 66, 11},
Hard= {67, 52, 1, 7, 59},
Challenge= {0, 0, 0, 0, 0},
},
["MAXX UNLIMITED"]
= {
Beginner= {18, 23, 10, 0, 0},
Easy= {44, 46, 108, 88, 2},
Medium= {67, 70, 106, 83, 11},
Hard= {122, 108, 49, 41, 59},
Challenge= {0, 0, 0, 0, 0},
},
["MY SUMMER LOVE(TOMMY'S SMILE MIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {60, 50, 29, 29, 59},
},
["rain of sorrow"]
= {
Beginner= {15, 11, 5, 0, 0},
Easy= {16, 17, 5, 75, 0},
Medium= {44, 46, 3, 110, 18},
Hard= {67, 58, 30, 13, 60},
Challenge= {0, 0, 0, 0, 0},
},
["Secret Rendez-vous"]
= {
Beginner= {14, 12, 5, 0, 0},
Easy= {19, 16, 12, 9, 0},
Medium= {30, 24, 23, 20, 5},
Hard= {49, 52, 36, 69, 66},
Challenge= {0, 0, 0, 0, 0},
},
["SEXY PLANET(FROM NONSTOP MEGAMIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {60, 60, 87, 22, 7},
},
["Silent Hill (3rd christmas mix)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {49, 41, 18, 117, 13},
},
["STILL IN MY HEART(MOMO MIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {71, 81, 23, 6, 36},
},
["SUPER STAR(FROM NONSTOP MEGAMIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {61, 47, 5, 22, 31},
},
["Sweet Sweet ♥ Magic"]
= {
Beginner= {28, 29, 9, 0, 0},
Easy= {30, 29, 58, 6, 0},
Medium= {60, 44, 101, 29, 11},
Hard= {81, 74, 34, 54, 48},
Challenge= {0, 0, 0, 0, 0},
},
["TSUGARU"]
= {
Beginner= {20, 13, 21, 0, 0},
Easy= {23, 19, 27, 51, 0},
Medium= {50, 39, 36, 25, 16},
Hard= {79, 66, 30, 25, 59},
Challenge= {0, 0, 0, 0, 0},
},
["TSUGARU (APPLE MIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {76, 60, 20, 11, 35},
},
["WILD RUSH(FROM NONSTOP MEGAMIX)"]
= {
Beginner= {0, 0, 0, 0, 0},
Easy= {0, 0, 0, 0, 0},
Medium= {0, 0, 0, 0, 0},
Hard= {0, 0, 0, 0, 0},
Challenge= {43, 46, 1, 67, 14},
},
["CANDY☆"]
= {
Beginner= {20, 23, 10, 0, 0},
Easy= {37, 31, 14, 0, 0},
Medium= {52, 40, 18, 26, 3},
Hard= {73, 63, 36, 37, 19},
Challenge= {0, 0, 0, 0, 0},
},
["exotic ethnic"]
= {
Beginner= {26, 31, 3, 0, 0},
Easy= {36, 31, 3, 20, 0},
Medium= {49, 47, 21, 65, 3},
Hard= {93, 63, 34, 24, 36},
Challenge= {0, 0, 0, 0, 0},
},
["Healing Vision ～Angelic mix～"]
= {
Beginner= {30, 29, 5, 0, 0},
Easy= {55, 44, 10, 0, 2},
Medium= {72, 52, 43, 0, 25},
Hard= {96, 59, 25, 0, 50},
Challenge= {0, 0, 0, 0, 0},
},
["Let the beat hit em!(CLASSIC R&B STYLE)"]
= {
Beginner= {14, 12, 0, 0, 0},
Easy= {30, 25, 3, 0, 4},
Medium= {39, 33, 16, 0, 10},
Hard= {43, 33, 40, 0, 14},
Challenge= {0, 0, 0, 0, 0},
},
["MAX 300"]
= {
Beginner= {18, 11, 0, 0, 0},
Easy= {58, 48, 18, 7, 0},
Medium= {82, 97, 14, 31, 12},
Hard= {143, 97, 21, 7, 54},
Challenge= {0, 0, 0, 0, 0},
},
["ORION.78～civilization mix～"]
= {
Beginner= {14, 16, 0, 0, 0},
Easy= {50, 58, 47, 0, 4},
Medium= {67, 66, 61, 0, 26},
Hard= {86, 66, 47, 0, 43},
Challenge= {0, 0, 0, 0, 0},
},
["サナ・モレッテ・ネ・エンテ"]
= {
Beginner= {15, 11, 0, 0, 0},
Easy= {27, 15, 0, 0, 0},
Medium= {40, 30, 0, 0, 16},
Hard= {62, 48, 0, 0, 89},
Challenge= {0, 0, 0, 0, 0},
},
["ABSOLUTE"]
= {
Beginner= {23, 23, 14, 0, 0},
Easy= {27, 23, 0, 0, 0},
Medium= {47, 40, 32, 0, 10},
Hard= {59, 46, 7, 0, 26},
Challenge= {0, 0, 0, 0, 0},
},
["Abyss"]
= {
Beginner= {23, 22, 14, 0, 0},
Easy= {33, 22, 1, 0, 0},
Medium= {46, 40, 18, 0, 8},
Hard= {62, 45, 0, 0, 25},
Challenge= {0, 0, 0, 0, 0},
},
["AFRONOVA PRIMEVAL"]
= {
Beginner= {31, 33, 12, 0, 0},
Easy= {55, 33, 30, 0, 0},
Medium= {65, 50, 58, 0, 9},
Hard= {85, 66, 56, 0, 28},
Challenge= {0, 0, 0, 0, 0},
},
["BROKEN MY HEART"]
= {
Beginner= {24, 20, 1, 0, 0},
Easy= {42, 26, 25, 0, 0},
Medium= {52, 40, 30, 0, 4},
Hard= {71, 53, 69, 0, 35},
Challenge= {0, 0, 0, 0, 0},
},
["CAN'T STOP FALLIN' IN LOVE ～SPEED MIX～"]
= {
Beginner= {28, 21, 9, 0, 0},
Easy= {51, 28, 16, 0, 0},
Medium= {69, 49, 14, 0, 18},
Hard= {96, 56, 30, 0, 58},
Challenge= {0, 0, 0, 0, 0},
},
["DXY!"]
= {
Beginner= {20, 24, 60, 0, 0},
Easy= {30, 24, 34, 0, 0},
Medium= {51, 49, 61, 0, 13},
Hard= {68, 49, 60, 0, 37},
Challenge= {0, 0, 0, 0, 0},
},
["ECSTASY"]
= {
Beginner= {23, 21, 14, 0, 0},
Easy= {33, 21, 10, 0, 0},
Medium= {46, 38, 14, 0, 12},
Hard= {54, 43, 21, 0, 22},
Challenge= {0, 0, 0, 0, 0},
},
["Electro Tuned ( the SubS Mix )"]
= {
Beginner= {20, 20, 5, 0, 1},
Easy= {37, 31, 0, 0, 5},
Medium= {55, 41, 23, 0, 20},
Hard= {72, 57, 5, 0, 64},
Challenge= {0, 0, 0, 0, 0},
},
["Healing Vision"]
= {
Beginner= {20, 13, 1, 0, 0},
Easy= {25, 27, 0, 0, 0},
Medium= {52, 47, 1, 0, 9},
Hard= {68, 81, 0, 0, 44},
Challenge= {0, 0, 0, 0, 0},
},
["INSERTiON"]
= {
Beginner= {20, 23, 7, 0, 0},
Easy= {37, 29, 7, 0, 3},
Medium= {52, 40, 14, 0, 14},
Hard= {75, 64, 0, 0, 97},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA ETERNAL"]
= {
Beginner= {24, 25, 7, 0, 0},
Easy= {50, 41, 36, 0, 7},
Medium= {64, 58, 52, 2, 12},
Hard= {81, 66, 50, 4, 28},
Challenge= {0, 0, 0, 0, 0},
},
["STILL IN MY HEART"]
= {
Beginner= {24, 25, 3, 0, 0},
Easy= {37, 25, 23, 0, 0},
Medium= {52, 43, 18, 0, 11},
Hard= {60, 50, 36, 0, 16},
Challenge= {0, 0, 0, 0, 0},
},
["B4U"]
= {
Beginner= {22, 25, 12, 0, 0},
Easy= {40, 38, 5, 0, 0},
Medium= {50, 45, 0, 0, 7},
Hard= {69, 57, 18, 0, 27},
Challenge= {0, 0, 0, 0, 0},
},
["BABY BABY GIMME YOUR LOVE"]
= {
Beginner= {10, 7, 3, 0, 0},
Easy= {13, 7, 0, 0, 0},
Medium= {23, 20, 0, 0, 0},
Hard= {34, 28, 1, 0, 11},
Challenge= {0, 0, 0, 0, 0},
},
["BURNIN' THE FLOOR"]
= {
Beginner= {25, 25, 12, 0, 0},
Easy= {40, 25, 7, 0, 0},
Medium= {55, 38, 9, 0, 10},
Hard= {69, 51, 18, 0, 28},
Challenge= {0, 0, 0, 0, 0},
},
["CAN'T STOP FALLIN' IN LOVE"]
= {
Beginner= {20, 25, 3, 0, 0},
Easy= {34, 32, 12, 0, 0},
Medium= {51, 38, 20, 0, 4},
Hard= {71, 64, 52, 0, 41},
Challenge= {0, 0, 0, 0, 0},
},
["CELEBRATE NITE"]
= {
Beginner= {23, 18, 20, 0, 0},
Easy= {42, 23, 43, 0, 0},
Medium= {49, 47, 76, 0, 6},
Hard= {68, 47, 45, 0, 31},
Challenge= {0, 0, 0, 0, 0},
},
["Don't Stop!～AMD 2nd MIX～"]
= {
Beginner= {20, 21, 1, 0, 0},
Easy= {35, 21, 20, 0, 0},
Medium= {43, 32, 18, 0, 5},
Hard= {49, 37, 16, 0, 23},
Challenge= {0, 0, 0, 0, 0},
},
["DROP OUT"]
= {
Beginner= {23, 32, 20, 0, 0},
Easy= {42, 43, 45, 0, 1},
Medium= {63, 43, 20, 0, 2},
Hard= {85, 86, 65, 0, 14},
Challenge= {0, 0, 0, 0, 0},
},
["era (nostalmix)"]
= {
Beginner= {19, 19, 0, 0, 0},
Easy= {27, 25, 0, 0, 1},
Medium= {51, 38, 0, 0, 12},
Hard= {79, 51, 0, 0, 47},
Challenge= {0, 0, 0, 0, 0},
},
["HIGHER"]
= {
Beginner= {21, 16, 0, 0, 0},
Easy= {28, 21, 0, 0, 0},
Medium= {44, 33, 20, 0, 6},
Hard= {50, 43, 34, 0, 16},
Challenge= {0, 0, 0, 0, 0},
},
["Holic"]
= {
Beginner= {23, 25, 1, 0, 0},
Easy= {44, 32, 3, 0, 6},
Medium= {53, 38, 3, 0, 14},
Hard= {73, 51, 30, 0, 33},
Challenge= {0, 0, 0, 0, 0},
},
["HYSTERIA"]
= {
Beginner= {26, 23, 18, 0, 0},
Easy= {49, 31, 25, 0, 0},
Medium= {56, 47, 36, 0, 7},
Hard= {67, 55, 69, 0, 17},
Challenge= {0, 0, 0, 0, 0},
},
["LEADING CYBER"]
= {
Beginner= {20, 25, 10, 0, 0},
Easy= {41, 50, 3, 0, 4},
Medium= {55, 50, 16, 0, 15},
Hard= {77, 68, 5, 0, 46},
Challenge= {0, 0, 0, 0, 0},
},
["LOVE AGAIN TONIGHT～For Melissa MIX～"]
= {
Beginner= {26, 25, 16, 0, 0},
Easy= {41, 25, 20, 0, 0},
Medium= {51, 43, 34, 0, 10},
Hard= {67, 62, 49, 0, 28},
Challenge= {0, 0, 0, 0, 0},
},
["MY SUMMER LOVE"]
= {
Beginner= {15, 12, 7, 0, 0},
Easy= {27, 16, 20, 0, 0},
Medium= {44, 33, 23, 0, 15},
Hard= {61, 66, 18, 0, 63},
Challenge= {0, 0, 0, 0, 0},
},
["ORION.78(AMeuro-MIX)"]
= {
Beginner= {13, 17, 0, 0, 0},
Easy= {23, 17, 0, 0, 0},
Medium= {38, 34, 1, 0, 6},
Hard= {73, 61, 56, 0, 100},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOIA EVOLUTION"]
= {
Beginner= {33, 33, 1, 0, 0},
Easy= {64, 58, 38, 0, 4},
Medium= {66, 58, 72, 0, 10},
Hard= {86, 66, 54, 0, 29},
Challenge= {0, 0, 0, 0, 0},
},
["SEXY PLANET"]
= {
Beginner= {18, 22, 0, 0, 0},
Easy= {50, 30, 45, 0, 1},
Medium= {56, 52, 30, 0, 9},
Hard= {66, 60, 50, 0, 18},
Challenge= {0, 0, 0, 0, 0},
},
["SUPER STAR"]
= {
Beginner= {20, 21, 0, 0, 0},
Easy= {48, 37, 14, 0, 10},
Medium= {56, 42, 18, 0, 20},
Hard= {71, 85, 20, 0, 46},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE CLIMAX"]
= {
Beginner= {27, 30, 5, 0, 0},
Easy= {47, 37, 10, 0, 3},
Medium= {67, 60, 32, 0, 15},
Hard= {83, 60, 56, 0, 32},
Challenge= {0, 0, 0, 0, 0},
},
["WILD RUSH"]
= {
Beginner= {23, 20, 20, 0, 0},
Easy= {32, 25, 0, 0, 1},
Medium= {40, 30, 9, 0, 6},
Hard= {52, 46, 0, 0, 36},
Challenge= {0, 0, 0, 0, 0},
},
[".59"]
= {
Beginner= {18, 22, 0, 0, 0},
Easy= {31, 33, 3, 0, 0},
Medium= {47, 44, 23, 0, 9},
Hard= {55, 67, 16, 0, 30},
Challenge= {0, 0, 0, 0, 0},
},
["AFRONOVA"]
= {
Beginner= {25, 33, 0, 0, 0},
Easy= {51, 50, 56, 0, 1},
Medium= {58, 50, 74, 0, 5},
Hard= {89, 66, 78, 0, 31},
Challenge= {0, 0, 0, 0, 0},
},
["AFTER THE GAME OF LOVE"]
= {
Beginner= {8, 8, 9, 0, 0},
Easy= {15, 17, 0, 0, 0},
Medium= {36, 26, 16, 0, 5},
Hard= {44, 34, 29, 0, 13},
Challenge= {0, 0, 0, 0, 0},
},
["CUTIE CHASER"]
= {
Beginner= {19, 15, 14, 0, 0},
Easy= {35, 26, 16, 0, 0},
Medium= {43, 31, 20, 0, 8},
Hard= {61, 52, 38, 0, 39},
Challenge= {0, 0, 0, 0, 0},
},
["DEAD END"]
= {
Beginner= {24, 31, 0, 0, 0},
Easy= {46, 39, 30, 0, 4},
Medium= {72, 55, 12, 0, 26},
Hard= {87, 63, 45, 0, 38},
Challenge= {0, 0, 0, 0, 0},
},
["DROP THE BOMB"]
= {
Beginner= {27, 25, 7, 0, 0},
Easy= {44, 25, 18, 0, 0},
Medium= {52, 50, 10, 0, 9},
Hard= {67, 75, 16, 0, 30},
Challenge= {0, 0, 0, 0, 0},
},
["DYNAMITE RAVE"]
= {
Beginner= {23, 25, 0, 0, 0},
Easy= {40, 25, 61, 0, 0},
Medium= {58, 50, 45, 0, 20},
Hard= {87, 56, 21, 0, 72},
Challenge= {79, 68, 49, 10, 64},
},
["GRADIUSIC CYBER ～AMD G5 MIX～"]
= {
Beginner= {20, 20, 12, 0, 0},
Easy= {56, 40, 18, 0, 7},
Medium= {65, 53, 34, 0, 22},
Hard= {77, 80, 18, 0, 73},
Challenge= {0, 0, 0, 0, 0},
},
["La Señorita"]
= {
Beginner= {26, 30, 0, 0, 0},
Easy= {51, 30, 21, 0, 0},
Medium= {54, 45, 27, 0, 5},
Hard= {62, 60, 41, 0, 21},
Challenge= {0, 0, 0, 0, 0},
},
["La Señorita Virtual"]
= {
Beginner= {27, 30, 0, 0, 0},
Easy= {62, 45, 14, 0, 8},
Medium= {76, 52, 29, 0, 19},
Hard= {82, 60, 60, 0, 29},
Challenge= {0, 0, 0, 0, 0},
},
["LOVE THIS FEELIN'"]
= {
Beginner= {16, 25, 18, 0, 0},
Easy= {46, 51, 20, 0, 11},
Medium= {49, 58, 27, 0, 19},
Hard= {53, 58, 27, 0, 24},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA Rebirth"]
= {
Beginner= {25, 31, 0, 0, 0},
Easy= {60, 55, 52, 0, 5},
Medium= {69, 63, 45, 0, 14},
Hard= {93, 63, 16, 0, 37},
Challenge= {0, 0, 0, 0, 0},
},
["Silent Hill"]
= {
Beginner= {18, 15, 9, 0, 0},
Easy= {25, 20, 0, 0, 0},
Medium= {44, 41, 23, 0, 6},
Hard= {58, 41, 16, 0, 19},
Challenge= {0, 0, 0, 0, 0},
},
["think ya better D"]
= {
Beginner= {17, 17, 18, 0, 0},
Easy= {30, 28, 0, 0, 1},
Medium= {36, 34, 16, 0, 3},
Hard= {49, 45, 23, 0, 9},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE～luv mix～"]
= {
Beginner= {21, 26, 0, 0, 0},
Easy= {46, 46, 14, 0, 14},
Medium= {56, 46, 32, 0, 22},
Hard= {66, 53, 16, 0, 27},
Challenge= {0, 0, 0, 0, 0},
},
["BAD GIRLS"]
= {
Beginner= {12, 15, 0, 0, 0},
Easy= {25, 25, 1, 0, 2},
Medium= {37, 30, 54, 0, 4},
Hard= {50, 40, 69, 0, 19},
Challenge= {64, 56, 80, 0, 51},
},
["Boom Boom Dollar (Red Monster Mix)"]
= {
Beginner= {21, 22, 0, 0, 0},
Easy= {29, 22, 0, 0, 0},
Medium= {44, 39, 5, 0, 7},
Hard= {60, 44, 14, 0, 21},
Challenge= {67, 50, 104, 21, 59},
},
["stomp to my beat"]
= {
Beginner= {22, 22, 21, 0, 0},
Easy= {40, 33, 21, 0, 3},
Medium= {43, 44, 47, 0, 5},
Hard= {60, 44, 38, 0, 24},
Challenge= {71, 55, 61, 0, 50},
},
["AM-3P"]
= {
Beginner= {19, 16, 3, 0, 0},
Easy= {43, 32, 34, 0, 6},
Medium= {51, 32, 34, 0, 14},
Hard= {64, 48, 41, 0, 34},
Challenge= {0, 0, 0, 0, 0},
},
["BRILLIANT 2U"]
= {
Beginner= {25, 25, 9, 0, 0},
Easy= {43, 43, 12, 0, 2},
Medium= {46, 43, 63, 0, 2},
Hard= {59, 50, 56, 0, 20},
Challenge= {69, 50, 45, 0, 35},
},
["BRILLIANT 2U(Orchestra Groove)"]
= {
Beginner= {26, 25, 3, 0, 0},
Easy= {43, 43, 21, 0, 3},
Medium= {49, 50, 49, 0, 12},
Hard= {60, 43, 27, 0, 22},
Challenge= {81, 50, 43, 0, 37},
},
["e-motion"]
= {
Beginner= {15, 17, 16, 0, 0},
Easy= {29, 23, 21, 0, 0},
Medium= {36, 35, 34, 0, 3},
Hard= {40, 41, 63, 0, 7},
Challenge= {0, 0, 0, 0, 0},
},
["GENOM SCREAMS"]
= {
Beginner= {21, 18, 9, 0, 0},
Easy= {43, 25, 74, 0, 0},
Medium= {51, 37, 27, 0, 9},
Hard= {60, 50, 63, 0, 17},
Challenge= {0, 0, 0, 0, 0},
},
["KEEP ON MOVIN'"]
= {
Beginner= {15, 10, 25, 0, 0},
Easy= {34, 27, 29, 0, 0},
Medium= {43, 38, 27, 0, 7},
Hard= {57, 43, 20, 0, 18},
Challenge= {0, 0, 0, 0, 0},
},
["MAKE IT BETTER (So-REAL Mix)"]
= {
Beginner= {21, 19, 7, 0, 0},
Easy= {37, 29, 36, 0, 6},
Medium= {45, 34, 18, 0, 17},
Hard= {49, 39, 63, 0, 23},
Challenge= {63, 54, 36, 20, 78},
},
["PARANOiA KCET ～clean mix～"]
= {
Beginner= {26, 30, 0, 0, 0},
Easy= {55, 44, 60, 0, 4},
Medium= {58, 44, 69, 0, 6},
Hard= {74, 52, 30, 0, 19},
Challenge= {109, 82, 58, 16, 79},
},
["PARANOiA MAX～DIRTY MIX～"]
= {
Beginner= {31, 31, 9, 0, 0},
Easy= {60, 55, 43, 0, 5},
Medium= {64, 63, 60, 0, 9},
Hard= {76, 63, 67, 0, 19},
Challenge= {0, 0, 0, 0, 0},
},
["PUT YOUR FAITH IN ME"]
= {
Beginner= {16, 15, 3, 0, 0},
Easy= {29, 30, 1, 0, 0},
Medium= {33, 30, 12, 0, 2},
Hard= {47, 34, 7, 0, 16},
Challenge= {0, 0, 0, 0, 0},
},
["PUT YOUR FAITH IN ME (Jazzy Groove)"]
= {
Beginner= {17, 15, 3, 0, 0},
Easy= {38, 30, 7, 0, 4},
Medium= {43, 34, 18, 0, 12},
Hard= {54, 40, 5, 0, 22},
Challenge= {60, 55, 47, 51, 70},
},
["SP-TRIP MACHINE～JUNGLE MIX～"]
= {
Beginner= {19, 26, 18, 0, 0},
Easy= {48, 40, 14, 0, 9},
Medium= {54, 46, 21, 0, 13},
Hard= {61, 53, 29, 0, 21},
Challenge= {0, 0, 0, 0, 0},
},
["KUNG FU FIGHTING"]
= {
Beginner= {17, 14, 5, 0, 0},
Easy= {22, 19, 9, 0, 0},
Medium= {27, 19, 21, 0, 0},
Hard= {35, 28, 25, 0, 4},
Challenge= {58, 43, 32, 34, 57},
},
["MAKE IT BETTER"]
= {
Beginner= {14, 14, 9, 0, 0},
Easy= {31, 29, 47, 0, 3},
Medium= {41, 39, 27, 0, 13},
Hard= {46, 39, 54, 0, 19},
Challenge= {0, 0, 0, 0, 0},
},
["PARANOiA"]
= {
Beginner= {29, 22, 5, 0, 0},
Easy= {56, 44, 18, 0, 4},
Medium= {58, 52, 49, 0, 6},
Hard= {67, 52, 25, 0, 17},
Challenge= {0, 0, 0, 0, 0},
},
["TRIP MACHINE"]
= {
Beginner= {25, 26, 5, 0, 0},
Easy= {47, 40, 14, 0, 4},
Medium= {52, 40, 30, 0, 7},
Hard= {56, 53, 36, 0, 12},
Challenge= {0, 0, 0, 0, 0},
},
	},
	StepsType_Dance_Double= {
		["POSSESSION (20th Anniversary Mix)"]= {
			Easy= {37, 28, 7, 28, 0},
			Medium= {49, 50, 52, 12, 9},
			Hard= {65, 57, 25, 14, 25},
			Challenge= {237,137,224,10,118},
			},
["はなまるぴっぴはよいこだけ"]= {
Easy= {37, 28, 7, 28, 0},
Medium= {49, 50, 52, 12, 9},
Hard= {65, 57, 25, 14, 25},
},
["TSUBASA"]= {
Easy= {31, 25, 5, 12, 0},
Medium= {46, 37, 7, 14, 6},
Hard= {74, 62, 18, 5, 52},
},
["妖隠し -あやかしかくし-"]= {
Easy= {39, 35, 1, 21, 29},
Medium= {70, 52, 23, 33, 102},
Hard= {93, 70, 0, 71, 119},
},
["ホメ猫☆センセーション"]= {
Easy= {32, 33, 1, 10, 0},
Medium= {61, 66, 12, 8, 7},
Hard= {85, 66, 36, 22, 31},
},
["Scarlet Moon"]= {
Easy= {31, 30, 3, 15, 0},
Medium= {47, 44, 3, 19, 5},
Hard= {73, 60, 21, 8, 29},
},
["Struggle"]= {
Easy= {43, 30, 3, 21, 0},
Medium= {60, 52, 9, 23, 9},
Hard= {82, 60, 20, 23, 31},
},
["AWAKE"]= {
Easy= {34, 30, 5, 29, 0},
Medium= {61, 52, 21, 36, 15},
Hard= {80, 60, 21, 46, 33},
Challenge= {123, 110, 9, 47, 105},
},
["朝色の紙飛行機"]= {
Easy= {28, 21, 1, 76, 0},
Medium= {46, 43, 12, 53, 14},
Hard= {65, 71, 14, 49, 65},
},
["M.A.Y.U."]= {
Easy= {33, 21, 29, 15, 0},
Medium= {44, 37, 27, 20, 9},
Hard= {75, 58, 43, 17, 85},
},
["女言葉の消失"]= {
Easy= {31, 28, 18, 35, 0},
Medium= {50, 39, 16, 41, 14},
Hard= {66, 56, 27, 34, 38},
},
["Go↓Go↑Girls&Boys!"]= {
Easy= {34, 26, 3, 0, 0},
Medium= {45, 32, 10, 29, 5},
Hard= {54, 52, 20, 20, 15},
},
["幻想系世界修復少女"]= {
Easy= {50, 40, 7, 14, 0},
Medium= {56, 56, 65, 33, 7},
Hard= {78, 64, 49, 53, 27},
},
["バンブーソード・ガール"]= {
Easy= {46, 34, 10, 14, 0},
Medium= {69, 60, 25, 67, 17},
Hard= {100, 95, 14, 15, 69},
},
["セツナトリップ"]= {
Easy= {25, 24, 5, 14, 0},
Medium= {52, 48, 36, 23, 17},
Hard= {84, 72, 14, 21, 90},
},
["ラクガキスト"]= {
Easy= {51, 33, 3, 1, 0},
Medium= {62, 49, 16, 6, 4},
Hard= {93, 66, 5, 5, 36},
Challenge= {138, 108, 30, 1, 102},
},
["回レ!雪月花"]= {
Easy= {18, 20, 1, 14, 0},
Medium= {44, 40, 18, 22, 1},
Hard= {66, 53, 32, 15, 24},
Challenge= {71, 73, 67, 31, 55},
},
["激アツ☆マジヤバ☆チアガール"]= {
Easy= {28, 28, 7, 27, 0},
Medium= {55, 49, 27, 19, 10},
Hard= {75, 56, 27, 15, 29},
},
["neko*neko"]= {
Easy= {19, 20, 0, 30, 0},
Medium= {46, 35, 5, 37, 13},
Hard= {62, 46, 9, 55, 31},
},
["夏色DIARY -DDR mix-"]= {
Easy= {37, 26, 1, 34, 0},
Medium= {68, 53, 7, 9, 26},
Hard= {99, 80, 25, 5, 94},
},
["パ→ピ→プ→Yeah!"]= {
Easy= {23, 26, 20, 14, 0},
Medium= {36, 40, 38, 23, 6},
Hard= {69, 66, 21, 10, 48},
},
["8000000"]= {
Easy= {43, 38, 7, 18, 0},
Medium= {66, 62, 30, 15, 27},
Hard= {82, 85, 36, 53, 75},
},
["天空の華"]= {
Easy= {30, 33, 3, 13, 0},
Medium= {61, 53, 12, 12, 26},
Hard= {105, 110, 30, 10, 105},
},
["Sakura Mirage"]= {
Easy= {46, 46, 5, 46, 6},
Medium= {61, 62, 34, 41, 21},
Hard= {86, 77, 52, 52, 42},
},
["In The Breeze"]= {
Easy= {24, 23, 9, 9, 0},
Medium= {42, 40, 30, 25, 13},
Hard= {58, 52, 20, 20, 40},
},
["Summer fantasy (Darwin remix)"]= {
Easy= {38, 29, 9, 28, 0},
Medium= {54, 44, 47, 29, 9},
Hard= {71, 59, 60, 28, 21},
},
["ドーパミン"]= {
Easy= {56, 55, 18, 11, 11},
Medium= {75, 90, 12, 15, 62},
Hard= {141, 116, 7, 1, 121},
},
["突撃!ガラスのニーソ姫!"]= {
Easy= {40, 30, 20, 54, 0},
Medium= {57, 61, 18, 58, 19},
Hard= {77, 76, 41, 50, 50},
},
["爆なな☆てすとロイヤー"]= {
Easy= {41, 33, 9, 18, 0},
Medium= {60, 58, 20, 21, 9},
Hard= {75, 66, 36, 17, 26},
},
["ビビットストリーム"]= {
Easy= {43, 30, 20, 21, 0},
Medium= {61, 53, 36, 53, 11},
Hard= {77, 68, 16, 45, 29},
},
["チョコレートスマイル"]= {
Easy= {27, 32, 7, 3, 0},
Medium= {41, 48, 21, 38, 1},
Hard= {60, 65, 12, 44, 13},
},
["Starlight Fantasia (Endorphines Mix)"]= {
Easy= {43, 36, 20, 62, 6},
Medium= {66, 78, 12, 41, 52},
Hard= {96, 110, 12, 38, 111},
},
["HEART BEAT FORMULA (Vinyl Mix)"]= {
Easy= {49, 38, 1, 55, 17},
Medium= {58, 47, 0, 43, 56},
Hard= {81, 67, 0, 32, 103},
},
["PRANA+REVOLUTIONARY ADDICT (U1 DJ Mix)"]= {
Easy= {54, 55, 20, 17, 7},
Medium= {75, 62, 32, 46, 30},
Hard= {131, 101, 40, 12, 102},
},
["乙女繚乱 舞い咲き誇れ"]= {
Easy= {39, 34, 3, 42, 0},
Medium= {58, 52, 9, 35, 13},
Hard= {74, 69, 23, 37, 26},
},
["ミライプリズム"]= {
Easy= {26, 23, 16, 29, 0},
Medium= {40, 34, 12, 68, 10},
Hard= {57, 46, 40, 49, 26},
},
["滅亡天使 † にこきゅっぴん"]= {
Easy= {39, 33, 9, 14, 0},
Medium= {54, 50, 23, 20, 6},
Hard= {72, 66, 29, 15, 22},
},
["Over The “Period”"]= {
Easy= {-1, -1, -1, -1, -1},
Medium= {-1, -1, -1, -1, -1},
Hard= {-1, -1, -1, -1, -1},
},
["MAX.(period)"]= {
Easy= {-1, -1, -1, -1, -1},
Medium= {-1, -1, -1, -1, -1},
Hard= {-1, -1, -1, -1, -1},
Challenge= {-1, -1, -1, -1, -1},
},
["EGOISM 440"]= {
Easy= {-1, -1, -1, -1, -1},
Medium= {-1, -1, -1, -1, -1},
Hard= {-1, -1, -1, -1, -1},
Challenge= {270, 142, 5, 8, 146},
},
["Destination"]= {
Easy= {46, 42, 14, 66, 13},
Medium= {68, 84, 14, 60, 80},
Hard= {91, 107, 16, 68, 113},
},
["Samurai Shogun vs. Master Ninja"]= {
Easy= {37, 43, 0, 15, 0},
Medium= {66, 64, 14, 14, 6},
Hard= {98, 86, 36, 9, 33},
},
["Sand Blow"]= {
Easy= {42, 34, 3, 7, 2},
Medium= {72, 54, 12, 12, 40},
Hard= {96, 88, 14, 24, 104},
},
["HAPPY☆LUCKY☆YEAPPY"]= {
Easy= {51, 35, 47, 18, 0},
Medium= {75, 71, 45, 18, 24},
Hard= {111, 121, 38, 21, 101},
},
["chaos eater"]= {
Easy= {45, 30, 16, 14, 0},
Medium= {70, 61, 20, 12, 24},
Hard= {107, 107, 45, 15, 102},
},
["POSSESSION(EDP Live Mix)"]= {
Easy= {53, 46, 3, 65, 18},
Medium= {79, 61, 40, 61, 60},
Hard= {119, 111, 102, 33, 106},
},
["Truare!"]= {
Easy= {47, 30, 40, 14, 0},
Medium= {72, 60, 20, 9, 56},
Hard= {105, 91, 32, 9, 106},
},
["クリムゾンゲイト"]= {
Easy= {38, 32, 3, 28, 0},
Medium= {56, 49, 5, 11, 10},
Hard= {82, 74, 18, 12, 40},
},
["海神"]= {
Easy= {37, 32, 9, 82, 0},
Medium= {63, 58, 10, 50, 32},
Hard= {93, 102, 9, 64, 106},
},
["FUNKY SUMMER BEACH"]= {
Easy= {36, 25, 10, 29, 0},
Medium= {57, 44, 7, 17, 20},
Hard= {85, 88, 38, 26, 95},
},
["Plan 8"]= {
Easy= {47, 35, 3, 58, 0},
Medium= {66, 70, 21, 49, 13},
Hard= {83, 111, 23, 51, 37},
},
["Remain"]= {
Easy= {33, 32, 10, 8, 0},
Medium= {53, 72, 14, 6, 37},
Hard= {71, 109, 10, 10, 101},
},
["Electronic or Treat!"]= {
Easy= {42, 30, 9, 25, 0},
Medium= {72, 60, 9, 27, 46},
Hard= {95, 99, 21, 35, 102},
},
["エンドルフィン"]= {
Easy= {50, 46, 9, 29, 11},
Medium= {74, 59, 21, 25, 5},
Hard= {93, 99, 56, 48, 105},
},
["Starlight Fantasia"]= {
Easy= {40, 37, 14, 70, 3},
Medium= {59, 55, 10, 60, 30},
Hard= {78, 98, 14, 68, 100},
},
["Dance Partay"]= {
Easy= {25, 22, 14, 19, 0},
Medium= {42, 39, 20, 31, 6},
Hard= {55, 39, 20, 34, 20},
Challenge= {54, 44, 30, 38, 22},
},
["One Sided Love"]= {
Easy= {29, 23, 10, 4, 0},
Medium= {51, 46, 16, 37, 13},
Hard= {71, 46, 10, 33, 30},
Challenge= {62, 46, 103, 77, 25},
},
["The Lonely Streets"]= {
Easy= {25, 19, 3, 31, 0},
Medium= {41, 33, 5, 24, 11},
Hard= {53, 43, 21, 38, 33},
Challenge= {49, 57, 14, 63, 38},
},
["Dreamin'"]= {
Easy= {31, 21, 1, 7, 0},
Medium= {38, 31, 9, 28, 1},
Hard= {49, 42, 1, 8, 10},
Challenge= {62, 53, 1, 11, 42},
},
["starmine"]= {
Easy= {41, 30, 7, 40, 0},
Medium= {61, 52, 27, 46, 20},
Hard= {92, 75, 54, 10, 74},
},
["SPECIAL SUMMER CAMPAIGN!"]= {
Easy= {34, 34, 47, 10, 0},
Medium= {56, 56, 60, 41, 15},
Hard= {93, 91, 52, 22, 100},
},
["阿波おどり -Awaodori- やっぱり踊りはやめられない"]= {
Easy= {45, 34, 32, 86, 7},
Medium= {64, 54, 45, 10, 44},
Hard= {88, 81, 5, 10, 104},
},
["灼熱Beach Side Bunny"]= {
Easy= {40, 38, 65, 4, 0},
Medium= {63, 44, 80, 16, 30},
Hard= {96, 101, 122, 9, 104},
},
["Cleopatrysm"]= {
Easy= {42, 31, 10, 15, 0},
Medium= {56, 55, 20, 14, 15},
Hard= {83, 79, 10, 11, 76},
},
["御千手メディテーション"]= {
Easy= {44, 46, 25, 31, 4},
Medium= {62, 61, 21, 38, 34},
Hard= {87, 92, 20, 28, 100},
},
["KHAMEN BREAK"]= {
Easy= {36, 35, 10, 42, 0},
Medium= {62, 64, 9, 31, 22},
Hard= {89, 100, 16, 41, 101},
},
["Follow Tomorrow"]= {
Easy= {27, 23, 5, 42, 0},
Medium= {43, 34, 36, 23, 7},
Hard= {67, 52, 7, 20, 58},
},
["FUJIMORI -祭- FESTIVAL"]= {
Easy= {34, 26, 14, 8, 0},
Medium= {54, 39, 16, 18, 9},
Hard= {67, 72, 29, 11, 27},
},
["Adularia"]= {
Easy= {31, 30, 7, 48, 0},
Medium= {47, 52, 16, 38, 9},
Hard= {67, 67, 10, 31, 32},
},
["Nostalgia Is Lost"]= {
Easy= {39, 35, 21, 58, 0},
Medium= {59, 57, 30, 68, 16},
Hard= {95, 93, 7, 51, 94},
},
["JOMANDA"]= {
Easy= {40, 37, 1, 54, 8},
Medium= {62, 68, 1, 49, 74},
Hard= {76, 75, 18, 49, 107},
Challenge= {98, 110, 12, 28, 121},
},
["嘆きの樹"]= {
Easy= {44, 40, 29, 54, 8},
Medium= {69, 53, 23, 32, 34},
Hard= {99, 103, 76, 35, 103},
Challenge= {120, 103, 87, 39, 106},
},
["Habibe (Antuh muhleke)"]= {
Easy= {37, 30, 21, 55, 3},
Medium= {55, 47, 18, 92, 24},
Hard= {76, 66, 34, 48, 61},
},
["SUPER HERO"]= {
Easy= {38, 30, 16, 33, 0},
Medium= {56, 52, 9, 35, 11},
Hard= {71, 60, 70, 23, 29},
},
["Party Lights (Tommie Sunshine's Brooklyn Fire Remix)"]= {
Easy= {33, 21, 0, 32, 0},
Medium= {45, 37, 1, 83, 9},
Hard= {54, 54, 0, 27, 27},
},
["Idola"]= {
Easy= {40, 50, 10, 51, 1},
Medium= {63, 67, 32, 64, 16},
Hard= {94, 100, 32, 46, 86},
Challenge= {98, 108, 34, 56, 101},
},
["ドキドキ☆流星トラップガール!!"]= {
Easy= {36, 23, 21, 9, 0},
Medium= {55, 46, 23, 15, 14},
Hard= {85, 75, 18, 17, 100},
},
["second spring storm"]= {
Easy= {36, 27, 12, 25, 1},
Medium= {55, 43, 25, 60, 21},
Hard= {80, 70, 87, 15, 100},
},
["Strobe♡Girl"]= {
Easy= {47, 39, 14, 23, 1},
Medium= {56, 55, 52, 31, 12},
Hard= {83, 94, 58, 53, 47},
},
["IMANOGUILTS"]= {
Easy= {50, 45, 38, 30, 29},
Medium= {75, 60, 36, 8, 59},
Hard= {109, 90, 32, 8, 106},
Challenge= {-1, -1, -1, -1, -1},
},
["ちゅ～いん☆バニー"]= {
Easy= {27, 30, 18, 22, 0},
Medium= {49, 44, 27, 32, 7},
Hard= {61, 52, 47, 24, 18},
Challenge= {-1, -1, -1, -1, -1},
},
["Din Don Dan"]= {
Easy= {31, 23, 7, 7, 0},
Medium= {44, 40, 47, 14, 7},
Hard= {63, 46, 27, 17, 31},
Challenge= {-1, -1, -1, -1, -1},
},
["ヤマトなでなで♡かぐや姫"]= {
Easy= {31, 33, 10, 64, 0},
Medium= {43, 46, 20, 83, 4},
Hard= {60, 53, 21, 47, 18},
Challenge= {-1, -1, -1, -1, -1},
},
["Elysium"]= {
Easy= {34, 23, 7, 15, 0},
Medium= {46, 41, 10, 50, 10},
Hard= {57, 54, 5, 64, 33},
Challenge= {-1, -1, -1, -1, -1},
},
["恋はどう？モロ◎波動OK☆方程式!!"]= {
Easy= {37, 38, 9, 37, 0},
Medium= {61, 68, 14, 31, 7},
Hard= {90, 78, 30, 19, 29},
},
["デッドボヲルdeホームラン"]= {
Easy= {27, 24, 18, 25, 0},
Medium= {42, 42, 40, 77, 4},
Hard= {72, 78, 32, 26, 72},
},
["轟け!恋のビーンボール!!"]= {
Easy= {40, 30, 18, 18, 0},
Medium= {62, 60, 30, 62, 16},
Hard= {111, 110, 34, 22, 100},
},
["星屑のキロク"]= {
Easy= {37, 37, 7, 44, 1},
Medium= {53, 45, 25, 112, 11},
Hard= {65, 60, 20, 91, 22},
},
["マインド・ゲーム"]= {
Easy= {37, 30, 50, 45, 0},
Medium= {57, 60, 32, 48, 15},
Hard= {88, 82, 23, 40, 57},
},
["野球の遊び方　そしてその歴史　～決定版～"]= {
Easy= {32, 23, 27, 21, 0},
Medium= {47, 46, 52, 31, 11},
Hard= {71, 76, 69, 35, 60},
},
["ÆTHER"]= {
Easy= {61, 68, 34, 31, 3},
Medium= {92, 104, 49, 22, 15},
Hard= {138, 104, 81, 14, 41},
},
["Daily Lunch Special"]= {
Easy= {38, 34, 3, 69, 2},
Medium= {58, 59, 9, 88, 15},
Hard= {88, 85, 38, 78, 49},
},
["Dispersion Star"]= {
Easy= {34, 30, 1, 37, 0},
Medium= {56, 44, 0, 51, 14},
Hard= {74, 89, 0, 76, 54},
},
["Do The Evolution"]= {
Easy= {28, 24, 9, 12, 0},
Medium= {44, 43, 20, 49, 7},
Hard= {63, 67, 25, 53, 40},
},
["Engraved Mark"]= {
Easy= {44, 46, 20, 52, 5},
Medium= {76, 62, 25, 20, 30},
Hard= {100, 112, 12, 29, 102},
},
["esrev:eR"]= {
Easy= {32, 25, 7, 57, 0},
Medium= {51, 45, 9, 42, 11},
Hard= {71, 57, 5, 42, 42},
},
["HYENA"]= {
Easy= {37, 28, 7, 31, 0},
Medium= {53, 56, 18, 59, 15},
Hard= {77, 85, 21, 36, 65},
},
["PUNISHER"]= {
Easy= {37, 30, 18, 56, 0},
Medium= {62, 52, 27, 39, 23},
Hard= {86, 75, 14, 39, 74},
},
["Romancing Layer"]= {
Easy= {33, 31, 32, 49, 1},
Medium= {59, 50, 14, 26, 20},
Hard= {88, 75, 14, 27, 101},
},
["SABER WING (satellite silhouette remix)"]= {
Easy= {32, 28, 1, 32, 2},
Medium= {41, 34, 1, 31, 17},
Hard= {69, 63, 9, 30, 76},
Challenge= {-1, -1, -1, -1, -1},
},
["Stella Sinistra"]= {
Easy= {34, 28, 18, 22, 0},
Medium= {61, 58, 32, 58, 44},
Hard= {70, 80, 50, 53, 100},
},
["Squeeze"]= {
Easy= {37, 31, 10, 59, 4},
Medium= {54, 56, 18, 55, 41},
Hard= {89, 81, 18, 34, 109},
},
["True Blue"]= {
Easy= {36, 34, 21, 40, 0},
Medium= {62, 61, 23, 44, 24},
Hard= {99, 104, 21, 37, 105},
},
["VEGA"]= {
Easy= {46, 39, 10, 24, 1},
Medium= {68, 63, 30, 61, 19},
Hard= {95, 87, 38, 28, 64},
},
["IX"]= {
Easy= {56, 62, 20, 34, 4},
Medium= {84, 94, 12, 42, 50},
Hard= {141, 134, 25, 28, 109},
Challenge= {141, 139, 32, 52, 116},
},
["MITOれて!いばらきっしゅだ～りん"]= {
Easy= {40, 28, 3, 31, 0},
Medium= {54, 43, 40, 49, 7},
Hard= {79, 72, 50, 26, 41},
},
["LoveLove DokiDoki"]= {
Easy= {43, 26, 10, 1, 0},
Medium= {59, 46, 25, 8, 17},
Hard= {80, 60, 18, 22, 42},
},
["CAPTIVE"]= {
Easy= {34, 26, 12, 44, 0},
Medium= {46, 40, 41, 59, 4},
Hard= {66, 66, 32, 38, 23},
},
["My HERO"]= {
Easy= {22, 23, 7, 8, 0},
Medium= {35, 29, 5, 31, 5},
Hard= {42, 34, 7, 37, 11},
},
["ドリームキャッチャー"]= {
Easy= {36, 34, 21, 8, 0},
Medium= {53, 34, 32, 37, 0},
Hard= {70, 51, 38, 25, 10},
},
["HAPPY☆きたかた"]= {
Easy= {28, 28, 1, 3, 0},
Medium= {47, 43, 9, 17, 5},
Hard= {63, 57, 50, 37, 17},
},
["マーメイド"]= {
Easy= {34, 25, 5, 2, 0},
Medium= {50, 44, 14, 28, 14},
Hard= {63, 44, 20, 44, 27},
},
["We are チャリンコエンジェルス"]= {
Easy= {23, 24, 12, 25, 0},
Medium= {41, 30, 0, 14, 4},
Hard= {58, 48, 10, 59, 21},
},
["Everybody Say EDOGAWA"]= {
Easy= {33, 23, 7, 22, 0},
Medium= {43, 35, 40, 18, 6},
Hard= {56, 47, 38, 23, 18},
},
["my cosmic world"]= {
Easy= {38, 23, 5, 16, 0},
Medium= {44, 40, 23, 22, 4},
Hard= {55, 46, 29, 21, 14},
},
["Determination"]= {
Easy= {36, 38, 5, 28, 0},
Medium= {44, 47, 29, 75, 5},
Hard= {80, 76, 43, 34, 32},
},
["川崎純情音頭"]= {
Easy= {24, 21, 14, 0, 0},
Medium= {38, 38, 34, 29, 3},
Hard= {52, 49, 29, 8, 13},
},
["瞬間 I LOVE YOU"]= {
Easy= {43, 27, 12, 18, 0},
Medium= {58, 48, 23, 30, 13},
Hard= {72, 55, 36, 16, 24},
},
["僕は君に恋をした"]= {
Easy= {30, 28, 9, 31, 0},
Medium= {50, 42, 21, 28, 8},
Hard= {69, 56, 32, 19, 26},
},
["Dong! Dong!"]= {
Easy= {53, 34, 1, 3, 0},
Medium= {62, 43, 20, 26, 3},
Hard= {72, 69, 70, 11, 23},
},
["A to Z"]= {
Easy= {33, 32, 20, 51, 0},
Medium= {49, 64, 32, 53, 11},
Hard= {61, 64, 69, 41, 26},
},
["ルシャナの気持ち"]= {
Easy= {31, 28, 10, 42, 0},
Medium= {46, 43, 54, 15, 5},
Hard= {63, 57, 38, 15, 18},
},
["LUCKY-YO!!"]= {
Easy= {23, 18, 18, 23, 0},
Medium= {37, 32, 7, 31, 11},
Hard= {51, 41, 32, 41, 43},
},
["Boom! Boom! Miracle Emotion"]= {
Easy= {31, 25, 7, 13, 0},
Medium= {54, 51, 21, 0, 13},
Hard= {66, 58, 25, 6, 27},
},
["ザッツ!KAIYODO"]= {
Easy= {33, 31, 14, 29, 0},
Medium= {45, 43, 20, 24, 8},
Hard= {61, 55, 27, 16, 25},
},
["乙女の真骨頂"]= {
Easy= {34, 30, 34, 29, 0},
Medium= {49, 52, 16, 44, 8},
Hard= {64, 60, 45, 47, 23},
},
["Field on!"]= {
Easy= {33, 28, 3, 7, 0},
Medium= {57, 49, 7, 38, 11},
Hard= {68, 56, 16, 42, 21},
},
["Che Che Chelip～魔法のコトバ～"]= {
Easy= {35, 21, 1, 16, 0},
Medium= {39, 32, 18, 16, 3},
Hard= {50, 43, 7, 2, 14},
},
["らいらら"]= {
Easy= {26, 25, 9, 43, 0},
Medium= {45, 38, 1, 30, 6},
Hard= {60, 51, 23, 54, 20},
},
["HeartLatte"]= {
Easy= {31, 22, 3, 0, 0},
Medium= {43, 39, 0, 28, 9},
Hard= {63, 50, 7, 15, 46},
},
["キライじゃないのぉ"]= {
Easy= {25, 23, 0, 28, 0},
Medium= {39, 35, 21, 91, 5},
Hard= {56, 47, 10, 42, 18},
},
["ラブラブキュートなハピハピサンデー"]= {
Easy= {39, 27, 9, 1, 0},
Medium= {47, 41, 16, 2, 5},
Hard= {71, 55, 27, 0, 23},
},
["ウッ－ウッーウマウマ(ﾟ∀ﾟ) (Speedcake Remix)"]= {
Easy= {41, 27, 14, 22, 0},
Medium= {50, 41, 18, 16, 6},
Hard= {66, 54, 21, 23, 24},
Challenge= {84, 75, 49, 17, 61},
},
["オリオンをなぞる"]= {
Easy= {31, 30, 20, 31, 0},
Medium= {45, 37, 30, 13, 6},
Hard= {64, 52, 7, 38, 22},
Challenge= {80, 60, 27, 15, 40},
},
["折れないハート"]= {
Easy= {29, 31, 1, 23, 0},
Medium= {51, 39, 14, 25, 4},
Hard= {66, 47, 27, 35, 15},
},
["ジョジョ～その血の運命～"]= {
Easy= {25, 24, 7, 7, 0},
Medium= {52, 42, 5, 12, 15},
Hard= {68, 73, 36, 25, 50},
},
["ずっとみつめていて (Ryu☆Remix)"]= {
Easy= {37, 33, 10, 54, 1},
Medium= {54, 46, 18, 36, 12},
Hard= {71, 53, 21, 33, 37},
Challenge= {98, 103, 20, 16, 101},
},
["つけまつける"]= {
Easy= {30, 24, 1, 17, 0},
Medium= {46, 36, 20, 25, 6},
Hard= {60, 42, 23, 30, 17},
Challenge= {61, 42, 45, 30, 17},
},
["ふりそでーしょん"]= {
Easy= {24, 33, 3, 14, 0},
Medium= {51, 50, 20, 21, 4},
Hard= {81, 66, 45, 24, 25},
},
["マジLOVE1000%"]= {
Easy= {25, 21, 21, 81, 0},
Medium= {36, 32, 27, 53, 7},
Hard= {48, 43, 27, 16, 19},
Challenge= {31, 43, 78, 91, 29},
},
["ロンドンは夜8時 (LON 8PM - TYO 4AM)"]= {
Easy= {43, 37, 10, 16, 1},
Medium= {65, 52, 12, 15, 20},
Hard= {82, 60, 16, 0, 36},
},
["ACROSS WORLD"]= {
Easy= {20, 23, 1, 54, 0},
Medium= {46, 38, 10, 2, 1},
Hard= {71, 61, 25, 2, 20},
Challenge= {79, 84, 54, 57, 57},
},
["BRIGHT STREAM"]= {
Easy= {21, 19, 0, 26, 0},
Medium= {36, 32, 16, 46, 2},
Hard= {51, 46, 25, 51, 11},
},
["Burst The Gravity"]= {
Easy= {32, 24, 5, 25, 0},
Medium= {49, 43, 16, 38, 10},
Hard= {61, 49, 16, 27, 25},
},
["Choo Choo TRAIN"]= {
Easy= {19, 14, 3, 4, 0},
Medium= {30, 28, 10, 41, 3},
Hard= {41, 47, 21, 27, 16},
},
["JOKER"]= {
Easy= {29, 26, 1, 45, 0},
Medium= {51, 40, 20, 7, 13},
Hard= {73, 53, 25, 28, 41},
Challenge= {88, 73, 50, 18, 94},
},
["LOVE & JOY -Risk Junk MIX-"]= {
Easy= {38, 30, 10, 13, 0},
Medium= {62, 44, 43, 41, 11},
Hard= {91, 82, 49, 18, 44},
},
["Mickey Mouse March(Eurobeat Version)"]= {
Easy= {30, 25, 7, 16, 0},
Medium= {45, 44, 40, 22, 5},
Hard= {64, 56, 21, 6, 36},
},
["Starry HEAVEN"]= {
Easy= {23, 23, 5, 25, 1},
Medium= {40, 39, 7, 34, 4},
Hard= {57, 63, 23, 32, 16},
Challenge= {70, 63, 29, 21, 27},
},
["お米の美味しい炊き方、そしてお米を食べることによるその効果。"]= {
Easy= {50, 39, 10, 26, 3},
Medium= {87, 63, 12, 18, 34},
Hard= {138, 105, 41, 10, 103},
},
["からふるぱすてる"]= {
Easy= {41, 31, 7, 32, 0},
Medium= {62, 54, 34, 55, 13},
Hard= {92, 93, 23, 25, 45},
},
["キケンな果実"]= {
Easy= {37, 28, 16, 47, 0},
Medium= {54, 43, 20, 70, 13},
Hard= {79, 79, 27, 41, 43},
},
["晴天Bon Voyage"]= {
Easy= {36, 38, 1, 23, 0},
Medium= {46, 38, 1, 40, 3},
Hard= {55, 47, 40, 63, 9},
},
["創世ノート"]= {
Easy= {44, 50, 12, 60, 2},
Medium= {55, 50, 20, 52, 13},
Hard= {81, 66, 58, 49, 40},
},
["ちくわパフェだよ☆CKP"]= {
Easy= {36, 42, 1, 23, 1},
Medium= {51, 42, 20, 24, 4},
Hard= {66, 68, 47, 16, 15},
},
["†渚の小悪魔ラヴリィ～レイディオ†"]= {
Easy= {43, 31, 16, 49, 0},
Medium= {69, 55, 23, 73, 17},
Hard= {121, 109, 32, 27, 90},
Challenge= {55, 55, 94, 42, 12},
},
["虹色の花"]= {
Easy= {34, 28, 7, 83, 0},
Medium= {55, 49, 52, 50, 10},
Hard= {75, 56, 43, 25, 27},
},
["フー・フローツ"]= {
Easy= {38, 30, 5, 20, 0},
Medium= {60, 52, 29, 16, 16},
Hard= {79, 67, 25, 19, 39},
},
["めうめうぺったんたん!!"]= {
Easy= {35, 30, 16, 24, 0},
Medium= {56, 46, 34, 24, 9},
Hard= {72, 84, 41, 24, 30},
},
["ラキラキ"]= {
Easy= {47, 40, 30, 40, 4},
Medium= {63, 54, 25, 40, 21},
Hard= {78, 61, 23, 45, 41},
},
["凛として咲く花の如く ～ひなビタ♪ edition～"]= {
Easy= {35, 27, 1, 38, 0},
Medium= {46, 40, 18, 63, 4},
Hard= {64, 54, 21, 66, 22},
},
["Ah La La La"]= {
Easy= {29, 21, 3, 48, 0},
Medium= {36, 27, 25, 45, 6},
Hard= {63, 48, 9, 33, 38},
},
["Air Heroes"]= {
Easy= {54, 50, 29, 46, 7},
Medium= {68, 58, 29, 54, 18},
Hard= {100, 108, 14, 35, 95},
Challenge= {168, 108, 5, 57, 112},
},
["Another Phase"]= {
Easy= {51, 38, 3, 9, 7},
Medium= {64, 51, 5, 14, 40},
Hard= {117, 102, 9, 11, 110},
Challenge= {124, 102, 49, 13, 114},
},
["Back In Your Arms"]= {
Easy= {28, 21, 9, 34, 0},
Medium= {46, 38, 7, 36, 12},
Hard= {58, 43, 10, 42, 28},
},
["Beautiful Dream"]= {
Easy= {49, 37, 29, 11, 2},
Medium= {51, 45, 21, 14, 8},
Hard= {68, 60, 45, 33, 22},
Challenge= {93, 98, 43, 46, 79},
},
["Blew My Mind"]= {
Easy= {58, 91, 23, 22, 2},
Medium= {83, 121, 38, 18, 25},
Hard= {141, 141, 70, 10, 81},
Challenge= {183, 200, 89, 23, 104},
},
["Bombay Bomb"]= {
Easy= {34, 30, 12, 44, 2},
Medium= {59, 42, 0, 0, 15},
Hard= {80, 54, 0, 0, 42},
},
["Children of the Beat"]= {
Easy= {33, 26, 56, 28, 0},
Medium= {50, 46, 30, 60, 8},
Hard= {56, 46, 74, 47, 11},
Challenge= {72, 53, 65, 22, 24},
},
["Chinese Snowy Dance"]= {
Easy= {39, 28, 18, 50, 0},
Medium= {67, 58, 7, 69, 26},
Hard= {136, 108, 7, 51, 105},
},
["Condor"]= {
Easy= {37, 35, 21, 49, 1},
Medium= {50, 41, 30, 48, 17},
Hard= {71, 70, 20, 27, 65},
Challenge= {92, 94, 34, 67, 104},
},
["Confession"]= {
Easy= {23, 31, 12, 50, 0},
Medium= {37, 37, 30, 60, 3},
Hard= {58, 56, 45, 73, 31},
Challenge= {88, 93, 50, 40, 101},
},
["Desert Journey"]= {
Easy= {28, 23, 10, 11, 0},
Medium= {43, 46, 30, 19, 7},
Hard= {68, 58, 14, 39, 46},
Challenge= {88, 87, 50, 24, 103},
},
["Diamond Night"]= {
Easy= {26, 22, 3, 28, 0},
Medium= {41, 33, 12, 32, 9},
Hard= {55, 44, 7, 40, 30},
Challenge= {76, 73, 14, 43, 95},
},
["Elemental Creation"]= {
Easy= {67, 111, 3, 29, 11},
Medium= {96, 131, 14, 29, 24},
Hard= {147, 138, 43, 23, 62},
Challenge= {179, 152, 47, 23, 90},
},
["Empathetic"]= {
Easy= {44, 37, 5, 21, 1},
Medium= {70, 60, 14, 24, 26},
Hard= {82, 82, 10, 24, 75},
},
["escape"]= {
Easy= {32, 23, 5, 16, 0},
Medium= {46, 34, 36, 19, 8},
Hard= {59, 46, 45, 19, 20},
Challenge= {81, 52, 106, 23, 94},
},
["Everything I Need"]= {
Easy= {19, 15, 1, 60, 0},
Medium= {28, 27, 3, 112, 6},
Hard= {41, 35, 1, 75, 23},
},
["Find The Way"]= {
Easy= {36, 27, 1, 58, 0},
Medium= {57, 55, 9, 34, 17},
Hard= {72, 96, 40, 34, 37},
},
["GAIA"]= {
Easy= {53, 51, 23, 36, 11},
Medium= {75, 59, 25, 20, 40},
Hard= {117, 109, 0, 0, 107},
},
["heron"]= {
Easy= {36, 30, 14, 34, 0},
Medium= {57, 45, 40, 35, 10},
Hard= {79, 60, 40, 19, 33},
Challenge= {75, 60, 69, 22, 61},
},
["Hoping To Be Good"]= {
Easy= {25, 20, 7, 34, 0},
Medium= {37, 40, 10, 46, 7},
Hard= {54, 40, 1, 16, 32},
},
["Magnetic"]= {
Easy= {44, 49, 5, 62, 6},
Medium= {66, 67, 7, 63, 50},
Hard= {96, 108, 12, 49, 106},
Challenge= {119, 102, 18, 68, 114},
},
["Monkey Business"]= {
Easy= {43, 46, 30, 33, 16},
Medium= {60, 80, 45, 51, 61},
Hard= {76, 97, 25, 8, 103},
Challenge= {123, 133, 27, 63, 139},
},
["New Generation"]= {
Easy= {39, 47, 12, 18, 4},
Medium= {69, 63, 5, 13, 19},
Hard= {93, 94, 5, 54, 60},
Challenge= {152, 113, 52, 31, 106},
},
["New Gravity"]= {
Easy= {40, 25, 10, 12, 0},
Medium= {58, 51, 5, 3, 19},
Hard= {72, 57, 16, 3, 38},
Challenge= {91, 89, 21, 3, 100},
},
["nightbird lost wing"]= {
Easy= {28, 29, 0, 35, 0},
Medium= {60, 51, 29, 38, 16},
Hard= {91, 67, 38, 23, 69},
},
["PRANA"]= {
Easy= {50, 38, 5, 27, 7},
Medium= {69, 54, 36, 33, 33},
Hard= {91, 77, 45, 15, 66},
Challenge= {126, 112, 72, 13, 105},
},
["printemps"]= {
Easy= {28, 27, 3, 13, 0},
Medium= {50, 55, 21, 21, 13},
Hard= {76, 97, 25, 23, 89},
},
["Qipchãq"]= {
Easy= {30, 25, 10, 25, 2},
Medium= {49, 43, 27, 40, 11},
Hard= {66, 50, 65, 35, 33},
},
["RЁVOLUTIΦN"]= {
Easy= {43, 33, 1, 49, 0},
Medium= {64, 67, 27, 63, 9},
Hard= {91, 75, 30, 22, 35},
Challenge= {157, 117, 30, 31, 102},
},
["Right on time (Ryu☆Remix)"]= {
Easy= {34, 24, 56, 27, 0},
Medium= {50, 49, 45, 18, 14},
Hard= {75, 74, 50, 9, 77},
Challenge= {55, 49, 200, 17, 80},
},
["sola"]= {
Easy= {33, 22, 10, 47, 0},
Medium= {46, 39, 16, 84, 15},
Hard= {77, 67, 10, 32, 84},
},
["Somehow You Found Me"]= {
Easy= {28, 30, 12, 0, 0},
Medium= {60, 44, 56, 9, 12},
Hard= {82, 67, 67, 7, 35},
Challenge= {143, 89, 43, 19, 101},
},
["south"]= {
Easy= {29, 23, 20, 3, 0},
Medium= {42, 46, 18, 23, 7},
Hard= {53, 46, 20, 113, 18},
Challenge= {49, 46, 113, 47, 33},
},
["Spanish Snowy Dance"]= {
Easy= {46, 37, 32, 67, 0},
Medium= {72, 60, 41, 13, 34},
Hard= {102, 89, 41, 63, 103},
Challenge= {154, 110, 54, 28, 109},
},
["Straight Oath"]= {
Easy= {43, 45, 14, 65, 3},
Medium= {60, 60, 25, 51, 14},
Hard= {86, 75, 29, 28, 43},
Challenge= {106, 106, 30, 50, 94},
},
["STULTI"]= {
Easy= {42, 48, 30, 72, 11},
Medium= {61, 62, 32, 81, 46},
Hard= {95, 90, 25, 58, 113},
},
["Sucka Luva"]= {
Easy= {24, 19, 10, 12, 0},
Medium= {40, 39, 27, 9, 15},
Hard= {50, 44, 85, 9, 27},
},
["Summer Fairytale"]= {
Easy= {27, 23, 3, 63, 0},
Medium= {35, 35, 20, 47, 2},
Hard= {42, 40, 20, 93, 8},
Challenge= {73, 64, 49, 28, 67},
},
["Sweet Rain"]= {
Easy= {36, 25, 12, 32, 0},
Medium= {52, 45, 34, 33, 15},
Hard= {74, 70, 27, 46, 47},
},
["Synergy For Angels"]= {
Easy= {47, 33, 12, 23, 4},
Medium= {66, 46, 40, 30, 20},
Hard= {91, 80, 21, 25, 87},
},
["Tell me what to do"]= {
Easy= {25, 24, 14, 3, 0},
Medium= {47, 48, 0, 70, 18},
Hard= {73, 54, 0, 11, 43},
Challenge= {87, 90, 12, 27, 100},
},
["The Island Song"]= {
Easy= {20, 14, 1, 20, 0},
Medium= {30, 28, 0, 40, 17},
Hard= {43, 38, 0, 6, 46},
Challenge= {79, 56, 40, 37, 109},
},
["THE REASON"]= {
Easy= {15, 19, 3, 54, 12},
Medium= {33, 42, 10, 47, 51},
Hard= {59, 50, 1, 23, 103},
Challenge= {77, 69, 120, 28, 119},
},
["The Wind of Gold"]= {
Easy= {41, 28, 25, 36, 0},
Medium= {55, 42, 60, 28, 22},
Hard= {87, 77, 63, 45, 100},
},
["Top The Charts"]= {
Easy= {28, 26, 5, 16, 0},
Medium= {49, 40, 16, 29, 5},
Hard= {64, 66, 45, 50, 27},
Challenge= {90, 73, 98, 36, 86},
},
["Triple Journey -TAG EDITION-"]= {
Easy= {50, 45, 7, 47, 6},
Medium= {76, 60, 12, 38, 33},
Hard= {146, 110, 27, 21, 107},
Challenge= {199, 110, 58, 18, 114},
},
["WILD SIDE"]= {
Easy= {41, 41, 23, 42, 0},
Medium= {54, 47, 36, 16, 14},
Hard= {63, 55, 25, 57, 28},
Challenge= {81, 68, 38, 38, 65},
},
["Windy Fairy"]= {
Easy= {35, 30, 5, 56, 0},
Medium= {54, 52, 20, 47, 11},
Hard= {96, 89, 10, 62, 100},
},
["Wow Wow VENUS"]= {
Easy= {28, 26, 9, 21, 0},
Medium= {46, 39, 25, 57, 7},
Hard= {60, 45, 45, 39, 30},
},
["You"]= {
Easy= {18, 11, 0, 72, 0},
Medium= {28, 23, 9, 115, 11},
Hard= {40, 36, 0, 86, 53},
},
["ヘビーローテーション"]= {
Easy= {27, 29, 5, 41, 0},
Medium= {46, 44, 61, 53, 2},
Hard= {60, 58, 90, 63, 12},
},
["女々しくて"]= {
Easy= {28, 23, 0, 9, 0},
Medium= {39, 29, 21, 16, 3},
Hard= {57, 83, 3, 16, 32},
Challenge= {51, 47, 107, 65, 100},
},
["COME BACK TO MY HEART"]= {
Easy= {24, 23, 9, 30, 0},
Medium= {40, 41, 18, 66, 5},
Hard= {60, 70, 5, 37, 42},
Challenge= {36, 23, 47, 54, 0},
},
["future gazer"]= {
Easy= {20, 22, 3, 18, 0},
Medium= {44, 40, 10, 41, 10},
Hard= {70, 68, 14, 35, 66},
Challenge= {46, 40, 63, 31, 66},
},
["LOVE & JOY"]= {
Easy= {36, 28, 9, 15, 0},
Medium= {49, 43, 30, 59, 6},
Hard= {68, 50, 58, 10, 19},
},
["STRAIGHT JET"]= {
Easy= {24, 25, 1, 28, 0},
Medium= {40, 38, 18, 73, 3},
Hard= {53, 44, 32, 60, 15},
},
["アルストロメリア (walk with you remix)"]= {
Easy= {35, 24, 9, 25, 0},
Medium= {47, 43, 32, 30, 7},
Hard= {62, 49, 9, 5, 34},
Challenge= {66, 55, 41, 4, 29},
},
["紅焔"]= {
Easy= {34, 28, 7, 26, 0},
Medium= {51, 43, 29, 47, 5},
Hard= {69, 58, 23, 33, 29},
Challenge= {115, 101, 50, 29, 102},
},
["雫"]= {
Easy= {21, 26, 3, 44, 0},
Medium= {56, 52, 9, 46, 5},
Hard= {70, 69, 25, 68, 23},
},
["隅田川夏恋歌"]= {
Easy= {41, 30, 7, 12, 0},
Medium= {66, 52, 18, 0, 11},
Hard= {64, 60, 5, 0, 30},
Challenge= {98, 89, 98, 7, 70},
},
["天上の星～黎明記～"]= {
Easy= {27, 26, 0, 22, 0},
Medium= {43, 46, 16, 37, 5},
Hard= {62, 73, 16, 106, 30},
},
["ビューティフル レシート"]= {
Easy= {38, 32, 12, 72, 0},
Medium= {53, 48, 21, 95, 7},
Hard= {65, 65, 25, 90, 20},
},
["繚乱ヒットチャート"]= {
Easy= {28, 31, 5, 45, 0},
Medium= {47, 40, 25, 67, 3},
Hard= {69, 63, 36, 38, 20},
},
["恋閃繚乱"]= {
Easy= {31, 23, 14, 47, 0},
Medium= {45, 41, 18, 41, 8},
Hard= {62, 46, 21, 20, 27},
Challenge= {93, 94, 32, 9, 103},
},
["Amalgamation"]= {
Easy= {48, 40, 20, 21, 4},
Medium= {62, 54, 9, 20, 20},
Hard= {85, 81, 14, 16, 72},
Challenge= {91, 81, 14, 20, 98},
},
["BRILLIANT 2U (AKBK MIX)"]= {
Easy= {46, 40, 36, 19, 1},
Medium= {68, 54, 21, 24, 30},
Hard= {120, 87, 41, 33, 105},
},
["Chronos"]= {
Easy= {21, 15, 7, 76, 3},
Medium= {41, 42, 5, 87, 20},
Hard= {65, 58, 34, 33, 56},
Challenge= {96, 85, 49, 39, 107},
},
["Cosmic Hurricane"]= {
Easy= {34, 31, 3, 32, 0},
Medium= {51, 54, 27, 47, 6},
Hard= {76, 69, 7, 40, 37},
Challenge= {96, 104, 32, 78, 100},
},
["CRAZY♥LOVE"]= {
Easy= {40, 34, 20, 77, 0},
Medium= {74, 81, 34, 80, 42},
Hard= {95, 101, 58, 59, 93},
},
["Diamond Dust"]= {
Easy= {27, 30, 5, 48, 0},
Medium= {37, 37, 27, 89, 7},
Hard= {51, 43, 38, 69, 25},
Challenge= {63, 61, 98, 39, 74},
},
["dreaming can make a wish come true"]= {
Easy= {23, 23, 9, 41, 0},
Medium= {40, 35, 40, 78, 2},
Hard= {55, 47, 41, 40, 15},
},
["ever snow"]= {
Easy= {24, 24, 0, 26, 0},
Medium= {46, 36, 9, 37, 10},
Hard= {63, 60, 14, 32, 32},
},
["Fever"]= {
Easy= {25, 22, 1, 18, 0},
Medium= {39, 33, 1, 23, 3},
Hard= {46, 38, 7, 59, 10},
},
["Find You Again"]= {
Easy= {28, 25, 16, 37, 0},
Medium= {40, 37, 16, 70, 6},
Hard= {63, 68, 18, 27, 44},
},
["FLOWER"]= {
Easy= {38, 28, 12, 34, 0},
Medium= {58, 50, 12, 24, 16},
Hard= {68, 57, 32, 22, 35},
Challenge= {89, 79, 54, 25, 101},
},
["Get Back Up!"]= {
Easy= {36, 25, 10, 50, 1},
Medium= {52, 45, 5, 32, 11},
Hard= {62, 57, 14, 49, 38},
},
["Go For The Top"]= {
Easy= {50, 44, 38, 36, 5},
Medium= {70, 66, 25, 19, 47},
Hard= {99, 105, 34, 25, 109},
Challenge= {175, 108, 30, 23, 135},
},
["Haunted Rhapsody"]= {
Easy= {24, 25, 10, 26, 0},
Medium= {43, 51, 12, 17, 4},
Hard= {71, 57, 7, 28, 32},
},
["HEART BEAT FORMULA"]= {
Easy= {48, 38, 0, 19, 0},
Medium= {68, 47, 1, 21, 12},
Hard= {83, 76, 1, 12, 23},
},
["HEARTBREAK (Sound Slektaz remix)"]= {
Easy= {23, 24, 1, 40, 0},
Medium= {35, 30, 27, 68, 0},
Hard= {51, 55, 38, 50, 15},
},
["I/O"]= {
Easy= {26, 25, 0, 23, 0},
Medium= {49, 43, 16, 31, 7},
Hard= {72, 62, 29, 24, 51},
},
["In The Air"]= {
Easy= {33, 23, 0, 56, 0},
Medium= {51, 40, 0, 29, 11},
Hard= {68, 46, 0, 13, 30},
},
["IN THE ZONE"]= {
Easy= {33, 20, 14, 42, 0},
Medium= {43, 36, 0, 88, 9},
Hard= {56, 46, 0, 16, 26},
},
["KEEP ON MOVIN' (Y&Co. DJ BOSS remix)"]= {
Easy= {36, 31, 30, 52, 1},
Medium= {53, 42, 25, 82, 14},
Hard= {86, 85, 23, 34, 102},
},
["Let's Get Away"]= {
Easy= {36, 25, 9, 53, 0},
Medium= {44, 43, 3, 101, 9},
Hard= {66, 56, 16, 11, 30},
},
["London EVOLVED ver.A"]= {
Easy= {41, 39, 12, 57, 0},
Medium= {58, 98, 10, 52, 10},
Hard= {77, 78, 1, 5, 19},
Challenge= {140, 177, 12, 1, 105},
},
["London EVOLVED ver.B"]= {
Easy= {44, 52, 20, 69, 0},
Medium= {61, 78, 16, 65, 6},
Hard= {85, 102, 16, 49, 12},
Challenge= {145, 115, 29, 46, 68},
},
["London EVOLVED ver.C"]= {
Easy= {47, 49, 16, 42, 0},
Medium= {65, 74, 20, 37, 5},
Hard= {86, 99, 16, 4, 14},
Challenge= {161, 111, 20, 1, 67},
},
["LOVE IS THE POWER -Re:born-"]= {
Easy= {30, 25, 12, 10, 1},
Medium= {40, 31, 1, 23, 6},
Hard= {52, 57, 5, 26, 39},
},
["MAGIC PARADE"]= {
Easy= {24, 21, 5, 27, 0},
Medium= {39, 31, 23, 30, 4},
Hard= {60, 47, 10, 26, 37},
},
["Mermaid girl"]= {
Easy= {34, 23, 3, 6, 0},
Medium= {42, 34, 52, 15, 5},
Hard= {56, 46, 25, 3, 18},
Challenge= {58, 46, 43, 3, 19},
},
["message"]= {
Easy= {21, 18, 9, 20, 0},
Medium= {43, 37, 20, 37, 6},
Hard= {65, 50, 30, 40, 24},
},
["NEPHILIM DELTA"]= {
Easy= {54, 36, 10, 15, 0},
Medium= {81, 73, 7, 22, 22},
Hard= {120, 73, 7, 19, 49},
},
["New Beginning"]= {
Easy= {34, 24, 5, 42, 0},
Medium= {47, 37, 23, 60, 3},
Hard= {61, 49, 3, 40, 18},
Challenge= {61, 49, 25, 40, 23},
},
["New York EVOLVED (Type A)"]= {
Easy= {40, 39, 27, 46, 5},
Medium= {69, 69, 32, 65, 47},
Hard= {109, 105, 40, 26, 105},
},
["New York EVOLVED (Type B)"]= {
Easy= {38, 49, 20, 39, 1},
Medium= {60, 74, 30, 29, 41},
Hard= {83, 99, 32, 18, 103},
},
["New York EVOLVED (Type C)"]= {
Easy= {40, 42, 16, 22, 9},
Medium= {62, 60, 36, 11, 54},
Hard= {87, 91, 49, 10, 108},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE1)"]= {
Easy= {44, 43, 7, 47, 2},
Medium= {67, 88, 9, 41, 37},
Hard= {85, 88, 38, 38, 100},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE2)"]= {
Easy= {45, 43, 27, 37, 3},
Medium= {67, 88, 14, 40, 37},
Hard= {85, 88, 52, 22, 97},
},
["osaka EVOLVED -毎度、おおきに!- (TYPE3)"]= {
Easy= {47, 44, 9, 38, 3},
Medium= {68, 90, 9, 42, 42},
Hard= {87, 90, 32, 65, 102},
},
["PARANOiA (kskst mix)"]= {
Easy= {57, 55, 40, 16, 9},
Medium= {88, 71, 40, 14, 38},
Hard= {155, 113, 60, 22, 104},
},
["PARANOiA Revolution"]= {
Easy= {55, 54, 23, 34, 0},
Medium= {87, 104, 25, 32, 17},
Hard= {149, 158, 20, 27, 53},
Challenge= {185, 158, 61, 38, 89},
},
["Private Eye"]= {
Easy= {33, 26, 10, 53, 0},
Medium= {45, 40, 23, 60, 6},
Hard= {65, 53, 41, 48, 19},
},
["Programmed Universe"]= {
Easy= {26, 33, 5, 33, 0},
Medium= {43, 50, 25, 55, 14},
Hard= {62, 77, 25, 40, 64},
},
["PUT YOUR FAITH IN ME (DA's Twinkly Disco Remix)"]= {
Easy= {30, 19, 7, 51, 0},
Medium= {42, 43, 30, 48, 13},
Hard= {73, 57, 41, 48, 90},
},
["REBORN MAGIC"]= {
Easy= {27, 23, 5, 40, 0},
Medium= {40, 34, 14, 33, 4},
Hard= {60, 46, 27, 27, 21},
},
["Rescue Me"]= {
Easy= {25, 24, 1, 0, 0},
Medium= {48, 42, 9, 0, 8},
Hard= {63, 54, 1, 43, 50},
},
["Resurrection"]= {
Easy= {28, 23, 0, 59, 0},
Medium= {40, 29, 12, 59, 6},
Hard= {52, 46, 16, 61, 13},
},
["REVOLUTIONARY ADDICT"]= {
Easy= {40, 29, 16, 33, 1},
Medium= {54, 51, 30, 95, 16},
Hard= {81, 73, 16, 58, 79},
Challenge= {132, 108, 36, 57, 118},
},
["Rhythms Inside"]= {
Easy= {23, 21, 1, 31, 0},
Medium= {37, 32, 14, 53, 5},
Hard= {46, 43, 30, 42, 14},
},
["Seasons"]= {
Easy= {32, 28, 0, 32, 0},
Medium= {45, 41, 10, 59, 8},
Hard= {66, 56, 32, 67, 25},
},
["Seule"]= {
Easy= {30, 20, 1, 60, 0},
Medium= {43, 36, 0, 7, 17},
Hard= {56, 46, 3, 18, 24},
},
["Share The Love"]= {
Easy= {22, 26, 3, 79, 0},
Medium= {47, 39, 20, 21, 6},
Hard= {65, 59, 43, 14, 25},
},
["SigSig"]= {
Easy= {38, 29, 7, 8, 0},
Medium= {55, 44, 52, 19, 6},
Hard= {68, 67, 43, 34, 19},
Challenge= {57, 44, 65, 19, 6},
},
["SILVER☆DREAM"]= {
Easy= {55, 38, 40, 82, 1},
Medium= {69, 53, 74, 42, 20},
Hard= {111, 92, 43, 71, 87},
},
["snow prism"]= {
Easy= {34, 32, 5, 33, 0},
Medium= {50, 48, 32, 42, 10},
Hard= {72, 65, 23, 32, 31},
Challenge= {96, 107, 72, 28, 86},
},
["Something Special"]= {
Easy= {17, 15, 0, 22, 0},
Medium= {27, 23, 1, 29, 3},
Hard= {47, 31, 0, 13, 41},
},
["Take A Step Forward"]= {
Easy= {35, 24, 9, 79, 0},
Medium= {41, 42, 1, 74, 13},
Hard= {60, 42, 18, 18, 19},
},
["The Heavens Above"]= {
Easy= {34, 23, 9, 90, 0},
Medium= {43, 46, 9, 120, 9},
Hard= {59, 46, 7, 41, 26},
},
["TIME"]= {
Easy= {24, 19, 0, 61, 0},
Medium= {38, 28, 0, 16, 7},
Hard= {47, 38, 0, 43, 19},
},
["Tohoku EVOLVED"]= {
Easy= {67, 56, 5, 0, 1},
Medium= {99, 106, 3, 0, 27},
Hard= {170, 106, 32, 4, 89},
Challenge= {196, 106, 67, 12, 100},
},
["tokyoEVOLVED (TYPE1)"]= {
Easy= {43, 41, 7, 30, 0},
Medium= {72, 83, 12, 34, 20},
Hard= {95, 102, 49, 32, 67},
},
["tokyoEVOLVED (TYPE2)"]= {
Easy= {44, 41, 10, 28, 1},
Medium= {73, 83, 12, 34, 20},
Hard= {95, 102, 58, 25, 68},
},
["tokyoEVOLVED (TYPE3)"]= {
Easy= {37, 41, 5, 55, 1},
Medium= {68, 83, 5, 41, 24},
Hard= {96, 102, 65, 24, 72},
},
["Tribe"]= {
Easy= {26, 23, 5, 28, 0},
Medium= {43, 34, 25, 53, 4},
Hard= {56, 51, 38, 29, 19},
Challenge= {73, 69, 34, 54, 61},
},
["TRIP MACHINE (xac nanoglide mix)"]= {
Easy= {41, 35, 16, 37, 3},
Medium= {68, 56, 18, 47, 27},
Hard= {115, 84, 25, 66, 102},
},
["TRIP MACHINE EVOLUTION"]= {
Easy= {50, 46, 25, 15, 12},
Medium= {77, 61, 58, 18, 45},
Hard= {132, 111, 74, 16, 109},
Challenge= {173, 111, 80, 11, 116},
},
["TWINKLE♡HEART"]= {
Easy= {29, 30, 1, 26, 0},
Medium= {54, 38, 38, 26, 5},
Hard= {67, 53, 38, 28, 24},
Challenge= {-1, -1, -1, -1, -1},
},
["UNBELIEVABLE (Sparky remix)"]= {
Easy= {40, 27, 10, 77, 0},
Medium= {62, 55, 23, 82, 18},
Hard= {84, 105, 34, 77, 59},
},
["Until the End"]= {
Easy= {42, 28, 21, 106, 0},
Medium= {50, 50, 27, 54, 7},
Hard= {72, 64, 36, 38, 32},
},
["Wicked Plastik"]= {
Easy= {33, 24, 16, 14, 0},
Medium= {50, 48, 5, 36, 12},
Hard= {68, 72, 5, 11, 59},
},
["Wings of an Angel (Fly With Me)"]= {
Easy= {27, 29, 1, 50, 0},
Medium= {52, 50, 5, 40, 9},
Hard= {64, 72, 9, 35, 26},
},
["IF YOU WERE HERE"]= {
Easy= {39, 30, 34, 25, 3},
Medium= {47, 48, 10, 29, 7},
Hard= {57, 54, 36, 34, 24},
Challenge= {40, 30, 61, 24, 3},
},
["IF YOU WERE HERE (L.E.D.-G STYLE REMIX)"]= {
Easy= {49, 40, 21, 14, 5},
Medium= {65, 53, 30, 12, 25},
Hard= {75, 80, 29, 29, 56},
},
["only my railgun"]= {
Easy= {28, 23, 5, 56, 0},
Medium= {43, 35, 23, 84, 7},
Hard= {66, 59, 25, 35, 43},
Challenge= {40, 35, 69, 66, 38},
},
["resonance"]= {
Easy= {27, 27, 5, 16, 0},
Medium= {50, 41, 16, 48, 5},
Hard= {66, 55, 20, 43, 20},
},
["不沈艦CANDY"]= {
Easy= {34, 28, 10, 25, 0},
Medium= {51, 42, 10, 39, 9},
Hard= {85, 56, 54, 30, 46},
},
["冥"]= {
Easy= {43, 44, 25, 16, 2},
Medium= {63, 59, 21, 16, 22},
Hard= {90, 89, 45, 9, 79},
Challenge= {114, 109, 70, 17, 105},
},
["A Brighter Day"]= {
Easy= {29, 25, 1, 37, 0},
Medium= {40, 38, 20, 58, 2},
Hard= {52, 51, 25, 45, 13},
Challenge= {67, 70, 18, 41, 36},
},
["aftershock!!"]= {
Easy= {23, 26, 9, 102, 0},
Medium= {53, 52, 20, 84, 14},
Hard= {75, 65, 25, 45, 62},
},
["All My Love"]= {
Easy= {26, 26, 9, 45, 0},
Medium= {44, 39, 32, 13, 11},
Hard= {61, 52, 54, 21, 23},
},
["Anti-Matter"]= {
Easy= {67, 79, 32, 30, 3},
Medium= {89, 102, 18, 59, 20},
Hard= {117, 102, 12, 38, 35},
Challenge= {167, 129, 16, 31, 99},
},
["BALLAD THE FEATHERS"]= {
Easy= {24, 21, 5, 0, 0},
Medium= {39, 33, 9, 0, 4},
Hard= {55, 49, 10, 0, 27},
Challenge= {41, 33, 34, 0, 4},
},
["CG Project"]= {
Easy= {37, 33, 7, 11, 0},
Medium= {54, 41, 32, 34, 0},
Hard= {72, 66, 32, 27, 17},
},
["Crazy Control"]= {
Easy= {24, 17, 16, 0, 0},
Medium= {37, 34, 25, 0, 15},
Hard= {50, 47, 27, 0, 42},
Challenge= {56, 56, 29, 0, 67},
},
["Dazzlin' Darlin"]= {
Easy= {38, 24, 21, 8, 0},
Medium= {49, 43, 30, 8, 10},
Hard= {60, 55, 25, 11, 27},
},
["Dazzlin' Darlin-秋葉工房mix-"]= {
Easy= {30, 26, 3, 26, 0},
Medium= {46, 46, 25, 17, 4},
Hard= {73, 53, 30, 6, 30},
},
["Decade"]= {
Easy= {31, 24, 5, 61, 0},
Medium= {41, 37, 5, 67, 6},
Hard= {57, 49, 9, 72, 25},
},
["dirty digital"]= {
Easy= {27, 23, 3, 14, 0},
Medium= {44, 46, 29, 18, 7},
Hard= {56, 69, 21, 20, 38},
Challenge= {73, 93, 32, 5, 72},
},
["DROP"]= {
Easy= {22, 25, 5, 34, 0},
Medium= {40, 44, 20, 40, 5},
Hard= {64, 63, 36, 37, 36},
},
["Dummy"]= {
Easy= {29, 28, 0, 8, 0},
Medium= {49, 36, 5, 3, 7},
Hard= {70, 58, 0, 22, 31},
},
["FIRE FIRE"]= {
Easy= {28, 25, 14, 20, 0},
Medium= {40, 37, 23, 42, 3},
Hard= {78, 75, 20, 37, 56},
},
["Freeze"]= {
Easy= {22, 23, 1, 128, 0},
Medium= {37, 29, 12, 144, 4},
Hard= {59, 46, 16, 113, 37},
Challenge= {59, 46, 34, 113, 37},
},
["going up"]= {
Easy= {46, 35, 0, 14, 0},
Medium= {68, 52, 14, 0, 8},
Hard= {85, 70, 14, 0, 24},
Challenge= {68, 52, 41, 0, 8},
},
["GOLD RUSH"]= {
Easy= {31, 27, 5, 54, 0},
Medium= {38, 40, 29, 63, 5},
Hard= {74, 67, 25, 31, 68},
},
["Gotta Dance"]= {
Easy= {28, 24, 5, 51, 0},
Medium= {46, 42, 25, 68, 10},
Hard= {62, 48, 30, 51, 29},
},
["Heatstroke"]= {
Easy= {33, 23, 9, 58, 0},
Medium= {43, 34, 9, 61, 7},
Hard= {58, 58, 0, 29, 29},
Challenge= {43, 34, 30, 59, 7},
},
["I'm so Happy"]= {
Easy= {38, 30, 20, 55, 0},
Medium= {54, 52, 27, 54, 7},
Hard= {79, 67, 30, 81, 33},
Challenge= {123, 110, 27, 77, 104},
},
["in love wit you"]= {
Easy= {21, 24, 7, 81, 0},
Medium= {28, 37, 12, 156, 0},
Hard= {36, 37, 0, 183, 5},
},
["KIMONO♥PRINCESS"]= {
Easy= {41, 43, 20, 66, 9},
Medium= {62, 58, 53, 58, 27},
Hard= {90, 87, 61, 25, 81},
},
["KISS KISS KISS 秋葉工房 MIX"]= {
Easy= {28, 26, 10, 17, 0},
Medium= {43, 40, 29, 66, 3},
Hard= {66, 66, 16, 43, 29},
},
["La libertad"]= {
Easy= {31, 28, 16, 14, 0},
Medium= {53, 49, 23, 12, 8},
Hard= {71, 63, 14, 27, 27},
Challenge= {79, 70, 18, 27, 45},
},
["La receta"]= {
Easy= {27, 21, 7, 48, 0},
Medium= {41, 32, 29, 36, 7},
Hard= {61, 48, 18, 47, 37},
Challenge= {69, 54, 7, 34, 53},
},
["Leaving･･･"]= {
Easy= {34, 24, 0, 36, 0},
Medium= {45, 36, 1, 39, 7},
Hard= {57, 54, 16, 39, 43},
Challenge= {71, 66, 3, 49, 61},
},
["Love Again"]= {
Easy= {15, 11, 7, 69, 0},
Medium= {26, 20, 5, 78, 8},
Hard= {34, 28, 5, 89, 25},
},
["MAX LOVE"]= {
Easy= {44, 30, 0, 4, 0},
Medium= {53, 37, 9, 2, 4},
Hard= {66, 44, 23, 5, 19},
Challenge= {77, 89, 32, 8, 33},
},
["Melody Life"]= {
Easy= {31, 28, 1, 27, 0},
Medium= {46, 35, 25, 27, 0},
Hard= {60, 50, 32, 33, 11},
Challenge= {61, 50, 60, 27, 11},
},
["New Decade"]= {
Easy= {69, 103, 29, 45, 9},
Medium= {91, 117, 25, 34, 39},
Hard= {135, 124, 49, 21, 74},
Challenge= {140, 151, 83, 29, 100},
},
["oarfish"]= {
Easy= {13, 11, 9, 15, 0},
Medium= {40, 40, 3, 97, 11},
Hard= {49, 52, 9, 123, 21},
},
["Pierce The Sky"]= {
Easy= {52, 39, 9, 24, 8},
Medium= {68, 66, 18, 35, 46},
Hard= {89, 79, 29, 19, 101},
},
["Pluto The First"]= {
Easy= {42, 56, 14, 14, 39},
Medium= {79, 106, 34, 13, 104},
Hard= {115, 129, 27, 16, 122},
Challenge= {118, 129, 72, 16, 133},
},
["Poseidon(kors k mix)"]= {
Easy= {23, 24, 10, 25, 0},
Medium= {48, 49, 50, 21, 10},
Hard= {77, 62, 32, 11, 83},
},
["POSSESSION"]= {
Easy= {69, 55, 5, 44, 22},
Medium= {89, 105, 70, 26, 41},
Hard= {129, 161, 110, 22, 93},
Challenge= {146, 161, 112, 20, 100},
},
["real-high-SPEED"]= {
Easy= {25, 21, 5, 25, 0},
Medium= {31, 27, 21, 43, 2},
Hard= {43, 43, 34, 53, 14},
},
["roppongi EVOLVED ver.A"]= {
Easy= {41, 35, 7, 80, 1},
Medium= {54, 56, 30, 89, 13},
Hard= {82, 84, 29, 80, 91},
},
["roppongi EVOLVED ver.B"]= {
Easy= {40, 40, 9, 78, 2},
Medium= {57, 60, 18, 83, 23},
Hard= {82, 87, 23, 67, 97},
},
["roppongi EVOLVED ver.C"]= {
Easy= {43, 39, 10, 54, 8},
Medium= {62, 65, 20, 42, 33},
Hard= {86, 79, 23, 40, 101},
},
["roppongi EVOLVED ver.D"]= {
Easy= {44, 55, 9, 64, 9},
Medium= {60, 63, 27, 72, 39},
Hard= {88, 95, 25, 69, 110},
},
["Sacred Oath"]= {
Easy= {32, 28, 14, 62, 0},
Medium= {46, 42, 12, 79, 5},
Hard= {68, 56, 12, 79, 23},
Challenge= {75, 84, 12, 78, 35},
},
["sakura storm"]= {
Easy= {26, 30, 0, 10, 0},
Medium= {48, 53, 5, 39, 4},
Hard= {69, 61, 5, 16, 24},
Challenge= {90, 61, 85, 12, 45},
},
["Sakura Sunrise"]= {
Easy= {52, 52, 41, 27, 4},
Medium= {71, 60, 50, 21, 22},
Hard= {90, 75, 61, 25, 51},
},
["Second Heaven"]= {
Easy= {28, 31, 7, 41, 1},
Medium= {42, 43, 29, 17, 9},
Hard= {62, 49, 38, 18, 24},
Challenge= {80, 74, 5, 41, 68},
},
["She is my wife"]= {
Easy= {24, 23, 7, 46, 0},
Medium= {36, 34, 21, 67, 3},
Hard= {57, 58, 21, 48, 30},
},
["Shine"]= {
Easy= {20, 20, 0, 46, 0},
Medium= {33, 31, 12, 11, 9},
Hard= {47, 41, 12, 11, 26},
Challenge= {55, 51, 12, 52, 48},
},
["☆shining☆"]= {
Easy= {31, 30, 9, 56, 0},
Medium= {46, 46, 29, 44, 1},
Hard= {63, 53, 72, 56, 11},
},
["Shiny World"]= {
Easy= {43, 29, 3, 21, 20},
Medium= {57, 40, 16, 21, 73},
Hard= {81, 55, 3, 0, 107},
},
["Sky Is The Limit"]= {
Easy= {36, 25, 7, 17, 0},
Medium= {48, 43, 43, 48, 9},
Hard= {60, 56, 29, 42, 35},
},
["smooooch・∀・"]= {
Easy= {28, 43, 5, 24, 0},
Medium= {39, 43, 32, 47, -1},
Hard= {69, 65, 36, 20, 37},
Challenge= {57, 51, 69, 37, 14},
},
["someday..."]= {
Easy= {33, 25, 5, 49, 0},
Medium= {46, 38, 10, 77, 4},
Hard= {54, 44, 10, 67, 12},
},
["Taking It To The Sky"]= {
Easy= {27, 21, 0, 26, 0},
Medium= {38, 32, 5, 36, 4},
Hard= {46, 43, 1, 44, 12},
},
["Theory of Eternity"]= {
Easy= {40, 40, 18, 26, 0},
Medium= {55, 40, 10, 35, 10},
Hard= {72, 60, 21, 22, 29},
Challenge= {56, 53, 49, 35, 35},
},
["THIS NIGHT"]= {
Easy= {28, 26, 0, 63, 0},
Medium= {47, 40, 9, 62, 6},
Hard= {59, 53, 18, 76, 17},
},
["Valkyrie dimension"]= {
Easy= {57, 61, 40, 68, 86},
Medium= {77, 92, 25, 73, 112},
Hard= {108, 111, 14, 61, 142},
Challenge= {127, 143, 52, 77, 160},
},
["VANESSA"]= {
Easy= {44, 30, 50, 42, 0},
Medium= {72, 61, 47, 27, 44},
Hard= {117, 92, 21, 18, 105},
},
["WH1TE RO5E"]= {
Easy= {25, 37, 5, 32, 0},
Medium= {50, 49, 10, 28, 14},
Hard= {73, 87, 34, 17, 73},
},
["What Will Come of Me"]= {
Easy= {26, 23, 7, 35, 0},
Medium= {36, 34, 16, 47, 4},
Hard= {58, 64, 16, 45, 34},
},
["You are a Star"]= {
Easy= {35, 25, 9, 11, 0},
Medium= {45, 38, 30, 36, 4},
Hard= {68, 57, 29, 14, 29},
Challenge= {79, 64, 27, 21, 42},
},
["Your Angel"]= {
Easy= {24, 28, 0, 27, 0},
Medium= {43, 43, 10, 13, 6},
Hard= {66, 58, 3, 39, 25},
},
["ZETA～素数の世界と超越者～"]= {
Easy= {33, 28, 3, 40, 0},
Medium= {56, 50, 27, 20, 12},
Hard= {89, 86, 30, 21, 62},
},
["888"]= {
Easy= {42, 41, 5, 20, 0},
Medium= {82, 83, 10, 33, 27},
Hard= {124, 102, 10, 52, 60},
Challenge= {200, 112, 30, 13, 105},
},
["ΔMAX"]= {
Easy= {43, 45, 5, 6, 0},
Medium= {76, 91, 9, 18, 38},
Hard= {94, 101, 80, 14, 77},
Challenge= {98, 101, 115, 31, 100},
},
["ポリリズム"]= {
Easy= {20, 21, 7, 54, 0},
Medium= {39, 31, 12, 59, 4},
Hard= {56, 42, 41, 32, 20},
},
["Butterfly (2008 X-edit)"]= {
Easy= {34, 22, 14, 0, 0},
Medium= {40, 28, 25, 0, 3},
Hard= {67, 50, 27, 42, 42},
Challenge= {34, 22, 20, 0, 0},
},
["DUB-I-DUB (2008 X-edit)"]= {
Easy= {37, 28, 63, 30, 1},
Medium= {49, 45, 100, 8, 10},
Hard= {68, 50, 16, 26, 59},
Challenge= {40, 28, 80, 25, 1},
},
["Trickster"]= {
Easy= {23, 27, 0, 30, 0},
Medium= {44, 34, 7, 49, 6},
Hard= {56, 55, 7, 35, 17},
},
["30 Lives (Up-Up-Down-Dance Mix)"]= {
Easy= {20, 23, 10, 4, 0},
Medium= {37, 30, 1, 32, 4},
Hard= {45, 41, 38, 6, 13},
},
["革命(X-Special)"]= {

Challenge= {70, 54, 25, 27, 44},
},
["零 - ZERO -"]= {
Easy= {34, 28, 18, 15, 0},
Medium= {47, 42, 10, 35, 4},
Hard= {68, 56, 23, 20, 22},
},
["凛として咲く花の如く"]= {
Easy= {31, 27, 9, 37, 0},
Medium= {41, 40, 29, 48, 3},
Hard= {63, 54, 36, 49, 20},
},
["A Geisha's Dream"]= {
Easy= {34, 23, 20, 27, 0},
Medium= {44, 34, 40, 15, 7},
Hard= {62, 52, 36, 22, 30},
},
["AFRONOVA(X-Special)"]= {

Challenge= {97, 66, 72, 13, 40},
},
["Beautiful Inside (Cube::Hard Mix)"]= {
Easy= {20, 18, 3, 37, 0},
Medium= {38, 31, 12, 29, 7},
Hard= {51, 36, 30, 38, 18},
},
["Blue Rain"]= {
Easy= {27, 23, 5, 34, 0},
Medium= {41, 41, 10, 60, 6},
Hard= {61, 47, 14, 38, 24},
},
["CANDY☆(X-Special)"]= {

Challenge= {76, 63, 81, 47, 23},
},
["Chance and Dice"]= {
Easy= {31, 25, 1, 16, 0},
Medium= {40, 31, 27, 49, 2},
Hard= {58, 50, 32, 74, 20},
},
["Dance Celebration"]= {
Easy= {31, 21, 14, 26, 0},
Medium= {40, 32, 27, 36, 9},
Hard= {62, 54, 25, 16, 40},
Challenge= {63, 54, 43, 16, 40},
},
["Dance Celebration (System 7 Remix)"]= {
Easy= {30, 21, 3, 104, 0},
Medium= {37, 33, 102, 25, 4},
Hard= {66, 60, 12, 62, 57},
},
["Dance Dance Revolution(X-Special)"]= {

Challenge= {74, 62, 47, 59, 55},
},
["Dance Floor"]= {
Easy= {23, 20, 12, 9, 0},
Medium= {40, 34, 9, 22, 6},
Hard= {49, 60, 23, 72, 28},
},
["dazzle"]= {
Easy= {20, 16, 5, 33, 0},
Medium= {36, 28, 18, 59, 8},
Hard= {48, 44, 12, 89, 35},
},
["Dream Machine"]= {
Easy= {31, 23, 7, 24, 0},
Medium= {51, 34, 23, 21, 10},
Hard= {72, 46, 16, 17, 50},
},
["Flight of the Phoenix"]= {
Easy= {28, 24, 0, 3, 0},
Medium= {35, 30, 23, 44, 1},
Hard= {43, 42, 20, 103, 8},
Challenge= {36, 30, 41, 41, 1},
},
["Flourish"]= {
Easy= {34, 25, 12, 9, 0},
Medium= {43, 44, 25, 35, 4},
Hard= {54, 50, 52, 21, 15},
},
["Healing Vision(X-Special)"]= {

Challenge= {88, 104, 27, 33, 82},
},
["Horatio"]= {
Easy= {29, 27, 16, 17, 0},
Medium= {50, 55, 25, 36, 12},
Hard= {100, 105, 25, 15, 85},
Challenge= {101, 105, 76, 15, 80},
},
["Inspiration"]= {
Easy= {27, 24, 7, 14, 0},
Medium= {37, 30, 20, 25, 2},
Hard= {54, 42, 29, 21, 12},
},
["INTO YOUR HEART (Ruffage remix)"]= {
Easy= {31, 22, 10, 14, 0},
Medium= {45, 39, 20, 32, 9},
Hard= {63, 61, 23, 25, 31},
},
["Lift You Up"]= {
Easy= {25, 20, 3, 13, 0},
Medium= {36, 30, 10, 14, 4},
Hard= {45, 35, 7, 5, 13},
},
["LOVING YOU (Epidemik remix)"]= {
Easy= {29, 27, 5, 18, 0},
Medium= {48, 41, 14, 16, 7},
Hard= {60, 55, 16, 22, 18},
},
["Malacca"]= {
Easy= {30, 23, 5, 7, 0},
Medium= {37, 29, 14, 8, 2},
Hard= {43, 34, 14, 3, 14},
Challenge= {77, 64, 7, 3, 101},
},
["MAX 300(X-Special)"]= {

Challenge= {136, 97, 23, 30, 47},
},
["MAXX UNLIMITED(X-Special)"]= {

Challenge= {152, 108, 60, 32, 77},
},
["on the bounce"]= {
Easy= {36, 31, 9, 60, 0},
Medium= {56, 50, 14, 29, 27},
Hard= {83, 75, 60, 26, 91},
Challenge= {97, 81, 41, 35, 104},
},
["On The Break"]= {
Easy= {44, 32, 5, 18, 3},
Medium= {58, 45, 5, 18, 22},
Hard= {73, 65, 16, 18, 70},
},
["PARANOiA ETERNAL(X-Special)"]= {

Challenge= {91, 66, 36, 12, 38},
},
["PARANOIA EVOLUTION(X-Special)"]= {

Challenge= {96, 66, 41, 8, 42},
},
["PARANOiA MAX～DIRTY MIX～(X-Special)"]= {

Challenge= {85, 63, 43, 17, 26},
},
["PARANOiA Rebirth(X-Special)"]= {

Challenge= {104, 63, 30, 14, 48},
},
["PARANOiA(X-Special)"]= {

Challenge= {74, 60, 76, 48, 27},
},
["Party Lights"]= {
Easy= {25, 21, 23, 0, 0},
Medium= {37, 27, 10, 33, 7},
Hard= {52, 54, 20, 110, 20},
},
["Playa (Original Mix)"]= {
Easy= {27, 20, 0, 0, 0},
Medium= {43, 31, 27, 21, 5},
Hard= {66, 41, 14, 4, 27},
},
["puzzle"]= {
Easy= {29, 22, 7, 8, 0},
Medium= {36, 28, 29, 12, 0},
Hard= {50, 39, 18, 8, 14},
},
["S・A・G・A"]= {
Easy= {44, 33, 1, 8, 0},
Medium= {56, 58, 105, 17, 3},
Hard= {75, 67, 21, 13, 22},
},
["SABER WING"]= {
Easy= {50, 67, 14, 32, 6},
Medium= {62, 75, 70, 44, 14},
Hard= {81, 83, 47, 33, 46},
Challenge= {82, 100, 72, 32, 53},
},
["SABER WING (Akira Ishihara Headshot mix)"]= {
Easy= {60, 61, 29, 24, 4},
Medium= {74, 72, 27, 17, 24},
Hard= {92, 92, 30, 29, 81},
Challenge= {112, 106, 38, 21, 104},
},
["Slip Out"]= {
Easy= {21, 15, 16, 3, 1},
Medium= {28, 23, 18, 49, 8},
Hard= {41, 31, 34, 30, 33},
},
["Slip Out (bounce in beat mix)"]= {
Easy= {24, 22, 12, 5, 0},
Medium= {33, 31, 12, 92, 5},
Hard= {48, 35, 16, 84, 19},
},
["SP-TRIP MACHINE～JUNGLE MIX～(X-Special)"]= {

Challenge= {65, 53, 40, 22, 30},
},
["SUPER SAMURAI"]= {
Easy= {51, 41, 20, 16, 18},
Medium= {73, 55, 29, 15, 45},
Hard= {96, 105, 41, 28, 103},
},
["Taj He Spitz"]= {
Easy= {25, 17, 14, 6, 0},
Medium= {40, 35, 23, 6, 8},
Hard= {56, 40, 30, 9, 38},
},
["Taj He Spitz (Tommie Sunshine's Brooklyn Fire Re-Touch)"]= {
Easy= {31, 20, 1, 29, 0},
Medium= {43, 40, 25, 26, 7},
Hard= {67, 50, 54, 11, 53},
},
["Take A Chance"]= {
Easy= {18, 14, 1, 13, 0},
Medium= {30, 21, 12, 11, 6},
Hard= {42, 33, 14, 15, 25},
},
["The flower in your smile"]= {
Easy= {38, 31, 3, 22, 0},
Medium= {47, 46, 30, 44, 2},
Hard= {54, 46, 60, 53, 7},
},
["The legend of MAX(X-Special)"]= {

Challenge= {123, 128, 38, 18, 46},
},
["Ticket to Bombay"]= {
Easy= {31, 24, 0, 0, 0},
Medium= {40, 30, 21, 13, 10},
Hard= {56, 48, 21, 8, 22},
},
["Till the lonely's gone"]= {
Easy= {23, 21, 7, 22, 0},
Medium= {44, 37, 14, 34, 15},
Hard= {50, 59, 27, 32, 30},
},
["TimeHollow"]= {
Easy= {17, 15, 0, 47, 0},
Medium= {26, 23, 0, 24, 3},
Hard= {34, 31, 7, 24, 11},
},
["Tracers (4Beat Remix)"]= {
Easy= {36, 23, 9, 41, 0},
Medium= {47, 34, 14, 38, 9},
Hard= {62, 46, 14, 38, 26},
},
["Trigger"]= {
Easy= {39, 43, 9, 8, 2},
Medium= {69, 97, 47, 15, 52},
Hard= {92, 136, 74, 38, 103},
Challenge= {106, 147, 80, 36, 111},
},
["TRIP MACHINE CLIMAX(X-Special)"]= {

Challenge= {82, 60, 54, 24, 33},
},
["TRIP MACHINE(X-Special)"]= {

Challenge= {63, 53, 74, 40, 27},
},
["Übertreffen"]= {
Easy= {37, 28, 9, 23, 0},
Medium= {57, 50, 1, 18, 7},
Hard= {80, 72, 32, 13, 31},
},
["Waiting 4 u"]= {
Easy= {43, 29, 18, 19, 0},
Medium= {57, 43, 27, 19, 10},
Hard= {72, 65, 70, 19, 26},
Challenge= {71, 58, 87, 18, 24},
},
["will"]= {
Easy= {28, 24, 1, 25, 0},
Medium= {38, 36, 29, 36, 3},
Hard= {55, 54, 34, 39, 24},
},
["A thing called LOVE"]= {
Easy= {33, 26, 5, 11, 0},
Medium= {45, 40, 9, 18, 4},
Hard= {64, 60, 32, 11, 22},
},
["AM-3P (\"CHAOS\" Special)"]= {

Challenge= {72, 70, 38, 12, 76},
},
["Arrabbiata"]= {
Easy= {62, 37, 50, 2, 0},
Medium= {76, 56, 90, 2, 10},
Hard= {91, 74, 58, 2, 25},
},
["B4U (\"VOLTAGE\" Special)"]= {

Challenge= {79, 101, 65, 0, 78},
},
["Blind Justice ～Torn souls, Hurt Faiths ～"]= {
Easy= {31, 27, 9, 35, 0},
Medium= {47, 40, 25, 28, 6},
Hard= {64, 60, 30, 49, 20},
},
["Bloody Tears(IIDX EDITION)"]= {
Easy= {34, 27, 3, 0, 0},
Medium= {40, 27, 36, 28, 1},
Hard= {62, 55, 0, 0, 24},
},
["BRILLIANT 2U (\"STREAM\" Special)"]= {

Challenge= {86, 62, 25, 0, 80},
},
["CaptivAte～誓い～"]= {
Easy= {30, 26, 12, 31, 0},
Medium= {49, 46, 29, 31, 5},
Hard= {83, 66, 30, 31, 65},
},
["D2R (\"FREEZE\" Special)"]= {

Challenge= {33, 60, 10, 200, 12},
},
["DEAD END (\"GROOVE RADAR\" Special)"]= {

Challenge= {90, 103, 100, 100, 117},
},
["dream of love"]= {
Easy= {25, 18, 3, 18, 0},
Medium= {34, 28, 25, 31, 4},
Hard= {43, 33, 16, 2, 15},
},
["DYNAMITE RAVE (\"AIR\" Special)"]= {

Challenge= {47, 37, 160, 0, 1},
},
["Electrified"]= {
Easy= {38, 23, 0, 9, 0},
Medium= {44, 28, 23, 9, 2},
Hard= {61, 46, 10, 17, 27},
},
["Every Day, Every Night (NM STYLE)"]= {
Easy= {20, 15, 3, 0, 0},
Medium= {28, 22, 14, 22, 5},
Hard= {51, 44, 7, 13, 47},
},
["Feelings Won't Fade(Extend Trance Mix)"]= {
Easy= {39, 23, 3, 45, 0},
Medium= {53, 41, 12, 3, 14},
Hard= {81, 66, 5, 22, 64},
},
["FIRE"]= {
Easy= {26, 23, 7, 0, 0},
Medium= {43, 38, 29, 54, 4},
Hard= {79, 92, 56, 52, 33},
},
["Flow (Jammin' Ragga Mix)"]= {
Easy= {25, 21, 5, 54, 0},
Medium= {46, 43, 23, 30, 18},
Hard= {60, 64, 63, 47, 39},
},
["Fly away -mix del matador-"]= {
Easy= {33, 21, 1, 30, 0},
Medium= {50, 43, 25, 34, 14},
Hard= {76, 54, 52, 2, 56},
},
["Freeway Shuffle"]= {
Easy= {34, 24, 7, 27, 0},
Medium= {45, 42, 14, 17, 5},
Hard= {56, 48, 40, 56, 16},
Challenge= {70, 60, 9, 9, 41},
},
["GIRIGILI門前雀羅"]= {
Easy= {35, 24, 9, 4, 0},
Medium= {53, 42, 12, 9, 13},
Hard= {73, 55, 23, 4, 40},
},
["L'amour et la liberté(Darwin & DJ Silver remix)"]= {
Easy= {20, 22, 5, 0, 0},
Medium= {37, 33, 20, 35, 5},
Hard= {57, 56, 29, 63, 49},
},
["MARS WAR 3"]= {
Easy= {23, 25, 12, 9, 0},
Medium= {53, 41, 32, 16, 1},
Hard= {67, 58, 29, 31, 11},
},
["MOONSTER"]= {
Easy= {28, 23, 5, 8, 0},
Medium= {46, 34, 16, 36, 5},
Hard= {54, 40, 16, 37, 19},
},
["Music In The Rhythm"]= {
Easy= {43, 25, 27, 9, 0},
Medium= {54, 43, 14, 3, 18},
Hard= {70, 50, 10, 30, 34},
},
["NGO"]= {
Easy= {42, 39, 69, 11, 2},
Medium= {54, 58, 43, 17, 11},
Hard= {77, 78, 40, 17, 33},
Challenge= {89, 78, 100, 17, 42},
},
["PARANOiA ～HADES～"]= {
Easy= {67, 41, 70, 6, 0},
Medium= {89, 93, 69, 6, 28},
Hard= {104, 112, 72, 6, 55},
Challenge= {172, 158, 60, 6, 106},
},
["Pluto"]= {
Easy= {37, 49, 5, 2, 55},
Medium= {56, 79, 25, 9, 106},
Hard= {72, 84, 32, 19, 126},
Challenge= {99, 124, 23, 15, 158},
},
["Pluto Relinquish"]= {
Easy= {68, 76, 25, 47, 8},
Medium= {83, 145, 52, 48, 95},
Hard= {129, 158, 18, 8, 109},
Challenge= {146, 158, 58, 37, 120},
},
["Poseidon"]= {
Easy= {32, 45, 12, 2, 1},
Medium= {46, 53, 10, 6, 19},
Hard= {56, 53, 30, 14, 30},
},
["Raspberry♡Heart(English version)"]= {
Easy= {37, 26, 14, 3, 0},
Medium= {46, 26, 36, 8, 0},
Hard= {57, 46, 45, 20, 15},
Challenge= {64, 53, 74, 0, 21},
},
["Saturn"]= {
Easy= {27, 24, 20, 27, 0},
Medium= {42, 36, 34, 47, 8},
Hard= {55, 60, 29, 93, 30},
},
["Shades of Grey"]= {
Easy= {27, 28, 20, 14, 0},
Medium= {44, 49, 36, 16, 1},
Hard= {54, 56, 41, 16, 6},
},
["Silver Platform - I wanna get your heart -"]= {
Easy= {18, 23, 3, 73, 0},
Medium= {44, 40, 27, 55, 5},
Hard= {63, 58, 1, 46, 32},
},
["SOUL CRASH"]= {
Easy= {37, 29, 27, 29, 0},
Medium= {55, 41, 25, 22, 17},
Hard= {75, 59, 32, 15, 55},
},
["Star Gate Heaven (FUTURE LOVE Mix)"]= {
Easy= {41, 24, 18, 17, 0},
Medium= {53, 49, 34, 15, 14},
Hard= {75, 61, 21, 35, 35},
},
["STARS☆☆☆ (Re-tuned by HΛL) - DDR EDITION -"]= {
Easy= {32, 24, 20, 18, 0},
Medium= {55, 42, 18, 8, 15},
Hard= {59, 48, 16, 0, 23},
},
["stealth"]= {
Easy= {36, 26, 9, 21, 0},
Medium= {47, 33, 29, 34, 8},
Hard= {67, 60, 5, 50, 22},
},
["SUNKiSS♥DROP"]= {
Easy= {25, 30, 9, 4, 0},
Medium= {45, 30, 18, 13, 0},
Hard= {63, 61, 38, 23, 15},
Challenge= {69, 61, 70, 4, 21},
},
["switch"]= {
Easy= {36, 25, 14, 37, 0},
Medium= {46, 37, 25, 29, 4},
Hard= {57, 50, 27, 43, 18},
},
["Trim"]= {
Easy= {36, 32, 10, 33, 3},
Medium= {58, 65, 36, 58, 27},
Hard= {87, 82, 38, 51, 53},
},
["TRIP MACHINE PhoeniX"]= {
Easy= {34, 26, 83, 4, 7},
Medium= {60, 52, 110, 4, 39},
Hard= {86, 79, 54, 4, 96},
Challenge= {105, 79, 5, 4, 105},
},
["Trust -DanceDanceRevolution mix-"]= {
Easy= {27, 27, 14, 13, 0},
Medium= {41, 47, 23, 29, 5},
Hard= {60, 54, 43, 45, 22},
},
["Unreal"]= {
Easy= {44, 42, 113, 0, 10},
Medium= {65, 56, 107, 0, 32},
Hard= {83, 77, 87, 0, 50},
},
["Uranus"]= {
Easy= {39, 24, 27, 0, 3},
Medium= {54, 48, 10, 14, 19},
Hard= {66, 48, 29, 15, 35},
Challenge= {77, 55, 36, 0, 64},
},
["Vem brincar"]= {
Easy= {30, 22, 9, 40, 0},
Medium= {43, 33, 10, 35, 3},
Hard= {62, 56, 1, 36, 38},
},
["Venus"]= {
Easy= {25, 24, 3, 45, 0},
Medium= {39, 32, 3, 36, 0},
Hard= {56, 56, 1, 60, 13},
Challenge= {76, 64, 47, 46, 24},
},
["volcano"]= {
Easy= {33, 20, 16, 2, 0},
Medium= {50, 40, 27, 21, 0},
Hard= {83, 69, 23, 34, 23},
},
["Votum stellarum -forest #25 DDR RMX-"]= {
Easy= {21, 23, 7, 15, 0},
Medium= {43, 40, 9, 0, 9},
Hard= {60, 58, 16, 0, 28},
},
["Why not"]= {
Easy= {50, 29, 3, 24, 0},
Medium= {55, 43, 36, 24, 3},
Hard= {68, 50, 30, 33, 18},
},
["怒れる大きな白い馬"]= {
Easy= {24, 23, 0, 11, 0},
Medium= {44, 35, 9, 3, 3},
Hard= {72, 53, 1, 3, 60},
},
["カゲロウ"]= {
Easy= {27, 27, 0, 13, 0},
Medium= {43, 27, 27, 12, 0},
Hard= {56, 40, 21, 20, 16},
},
["月光蝶"]= {
Easy= {26, 18, 0, 9, 0},
Medium= {51, 36, 9, 7, 2},
Hard= {73, 54, 21, 3, 18},
},
["この子の七つのお祝いに"]= {
Easy= {40, 40, 7, 25, 22},
Medium= {63, 53, 30, 17, 66},
Hard= {94, 103, 9, 4, 104},
},
["男々道"]= {
Easy= {28, 26, 1, 0, 0},
Medium= {52, 46, 7, 0, 11},
Hard= {70, 52, 7, 0, 26},
},
["チカラ"]= {
Easy= {34, 30, 3, 0, 0},
Medium= {58, 53, 1, 36, 12},
Hard= {83, 111, 1, 0, 51},
},
["虹色"]= {
Easy= {22, 20, 12, 0, 0},
Medium= {46, 46, 12, 10, 3},
Hard= {76, 73, 1, 0, 57},
Challenge= {88, 66, 10, 22, 54},
},
["華爛漫 -Flowers-"]= {
Easy= {35, 26, 3, 3, 0},
Medium= {51, 46, 20, 3, 7},
Hard= {69, 59, 45, 5, 29},
},
["ヒマワリ"]= {
Easy= {28, 23, 10, 37, 0},
Medium= {54, 53, 12, 12, 2},
Hard= {83, 61, 43, 6, 35},
},
["夢幻ノ光"]= {
Easy= {24, 21, 10, 41, 0},
Medium= {47, 42, 29, 60, 6},
Hard= {67, 49, 23, 42, 24},
},
["A Stupid Barber"]= {
Easy= {25, 21, 21, 19, 0},
Medium= {45, 38, 25, 17, 6},
Hard= {55, 43, 32, 7, 15},
},
["AA"]= {
Easy= {40, 25, 20, 8, 0},
Medium= {59, 44, 58, 8, 21},
Hard= {79, 70, 16, 8, 66},
},
["Bad Routine"]= {
Easy= {25, 21, 12, 10, 0},
Medium= {40, 37, 21, 18, 5},
Hard= {48, 42, 25, 23, 15},
},
["Baile Le Samba"]= {
Easy= {18, 15, 3, 0, 0},
Medium= {30, 22, 47, 0, 2},
Hard= {48, 41, 3, 10, 58},
},
["BALLAD FOR YOU～想いの雨～"]= {
Easy= {14, 10, 0, 38, 0},
Medium= {31, 32, 0, 29, 48},
Hard= {47, 32, 1, 49, 99},
},
["Brazilian Anthem"]= {
Easy= {34, 21, 14, 25, 0},
Medium= {45, 37, 23, 28, 10},
Hard= {63, 48, 21, 14, 38},
},
["cachaca"]= {
Easy= {23, 21, 7, 39, 0},
Medium= {43, 42, 16, 60, 12},
Hard= {55, 58, 18, 21, 71},
},
["Can Be Real"]= {
Easy= {22, 21, 10, 11, 0},
Medium= {39, 33, 14, 23, 2},
Hard= {49, 43, 34, 22, 12},
},
["CAN'T STOP FALLIN' IN LOVE -super euro version-"]= {
Easy= {17, 19, 0, 0, 0},
Medium= {35, 32, 0, 6, 1},
Hard= {55, 38, 0, 0, 13},
},
["CENTAUR"]= {
Easy= {37, 29, 3, 47, 15},
Medium= {50, 40, 10, 23, 31},
Hard= {74, 58, 30, 9, 86},
},
["CHAOS"]= {
Easy= {39, 40, 3, 5, 117},
Medium= {54, 45, 7, 7, 142},
Hard= {71, 60, 21, 11, 177},
Challenge= {81, 81, 25, 15, 200},
},
["CURUS"]= {
Easy= {20, 15, 0, 0, 0},
Medium= {35, 30, 0, 48, 0},
Hard= {65, 69, 0, 0, 20},
},
["DoLL"]= {
Easy= {35, 28, 1, 37, 0},
Medium= {43, 35, 16, 114, 2},
Hard= {67, 85, 34, 69, 28},
Challenge= {81, 85, 29, 61, 59},
},
["Dragon Blade"]= {
Easy= {53, 40, 9, 3, 1},
Medium= {66, 60, 3, 3, 5},
Hard= {85, 69, 0, 3, 21},
},
["Fascination ～eternal love mix～"]= {
Easy= {56, 73, 43, 44, 6},
Medium= {75, 98, 81, 7, 24},
Hard= {150, 111, 34, 1, 105},
Challenge= {148, 98, 25, 0, 88},
},
["Fascination MAXX"]= {
Easy= {51, 41, 1, 26, 55},
Medium= {75, 83, 49, 4, 102},
Hard= {161, 133, 0, 3, 132},
Challenge= {174, 133, 1, 3, 134},
},
["Flow"]= {
Easy= {35, 23, 56, 63, 0},
Medium= {49, 34, 87, 33, 13},
Hard= {63, 58, 76, 5, 31},
},
["Flow (True Style)"]= {
Easy= {35, 30, 56, 107, 0},
Medium= {49, 44, 87, 57, 14},
Hard= {63, 60, 76, 5, 25},
Challenge= {75, 60, 67, 1, 38},
},
["Fly away"]= {
Easy= {21, 20, 0, 16, 0},
Medium= {40, 31, 25, 20, 9},
Hard= {58, 46, 5, 12, 33},
},
["Forever Sunshine"]= {
Easy= {24, 21, 9, 24, 0},
Medium= {37, 26, 7, 42, 1},
Hard= {47, 37, 12, 47, 13},
},
["Freedom"]= {
Easy= {31, 24, 3, 31, 0},
Medium= {42, 37, 43, 13, 2},
Hard= {56, 67, 41, 13, 18},
},
["Funk Boogie"]= {
Easy= {24, 21, 3, 13, 0},
Medium= {42, 31, 10, 27, 5},
Hard= {49, 37, 7, 33, 10},
},
["GORGEOUS 2012"]= {
Easy= {24, 22, 10, 54, 0},
Medium= {35, 39, 30, 48, 5},
Hard= {55, 50, 36, 25, 32},
},
["HAPPY☆ANGEL"]= {
Easy= {28, 30, 0, 8, 0},
Medium= {48, 30, 87, 60, 0},
Hard= {75, 60, 100, 5, 19},
},
["Healing-D-Vision"]= {
Easy= {53, 57, 12, 25, 17},
Medium= {70, 67, 41, 13, 46},
Hard= {90, 87, 92, 13, 94},
Challenge= {113, 96, 89, 13, 100},
},
["I Need You"]= {
Easy= {23, 18, 5, 14, 0},
Medium= {36, 28, 9, 24, 3},
Hard= {45, 37, 10, 6, 10},
},
["iFUTURELIST(DDR VERSION)"]= {
Easy= {33, 25, 5, 16, 0},
Medium= {45, 37, 14, 73, 9},
Hard= {60, 56, 38, 18, 46},
Challenge= {73, 75, 69, 9, 92},
},
["INNOCENCE OF SILENCE"]= {
Easy= {30, 24, 0, 42, 2},
Medium= {39, 49, 0, 42, 40},
Hard= {58, 49, 0, 42, 102},
},
["INSIDE YOUR HEART"]= {
Easy= {23, 17, 0, 34, 0},
Medium= {38, 26, 5, 13, 8},
Hard= {49, 39, 16, 10, 28},
},
["Jam & Marmalade"]= {
Easy= {33, 24, 12, 10, 0},
Medium= {49, 36, 36, 10, 6},
Hard= {58, 48, 34, 1, 19},
},
["KEEP ON MOVIN' ～DMX MIX～"]= {
Easy= {25, 21, 0, 11, 0},
Medium= {43, 38, 34, 27, 10},
Hard= {65, 55, 23, 5, 52},
},
["La Bamba"]= {
Easy= {32, 25, 36, 4, 0},
Medium= {51, 38, 78, 4, 10},
Hard= {68, 51, 63, 4, 32},
},
["LOGICAL DASH"]= {
Easy= {28, 23, 3, 30, 0},
Medium= {40, 30, 23, 58, 2},
Hard= {54, 47, 18, 18, 18},
},
["LOVE IS ORANGE"]= {
Easy= {37, 30, 10, 10, 0},
Medium= {49, 44, 10, 32, 4},
Hard= {55, 44, 14, 5, 10},
Challenge= {71, 60, 14, 17, 25},
},
["Make A Difference"]= {
Easy= {30, 21, 20, 33, 0},
Medium= {44, 37, 18, 66, 7},
Hard= {65, 54, 10, 59, 57},
},
["MARIA(I believe...)"]= {
Easy= {33, 26, 5, 85, 0},
Medium= {50, 46, 14, 32, 11},
Hard= {70, 65, 10, 21, 38},
},
["MAX 300 (Super-Max-Me Mix)"]= {
Easy= {69, 49, 25, 0, 2},
Medium= {76, 74, 69, 14, 8},
Hard= {116, 99, 107, 34, 32},
Challenge= {125, 99, 70, 106, 34},
},
["MAXIMIZER"]= {
Easy= {40, 31, 7, 24, 0},
Medium= {59, 46, 16, 34, 22},
Hard= {70, 62, 21, 52, 30},
},
["MIDNIGHT SPECIAL"]= {
Easy= {49, 60, 65, 14, 4},
Medium= {63, 68, 65, 22, 25},
Hard= {71, 68, 100, 15, 34},
},
["Mind Parasite"]= {
Easy= {30, 30, 10, 60, 0},
Medium= {43, 48, 23, 74, 8},
Hard= {66, 48, 40, 43, 23},
},
["Monkey Punk"]= {
Easy= {43, 29, 21, 38, 0},
Medium= {50, 37, 89, 26, 3},
Hard= {50, 52, 38, 84, 16},
},
["MOON"]= {
Easy= {21, 19, 0, 28, 0},
Medium= {52, 38, 27, 8, 10},
Hard= {69, 51, 21, 5, 29},
},
["murmur twins"]= {
Easy= {15, 14, 12, 0, 1},
Medium= {47, 43, 9, 2, 12},
Hard= {66, 65, 25, 0, 30},
},
["My Only Shining Star"]= {
Easy= {20, 19, 0, 0, 0},
Medium= {32, 45, 0, 5, 4},
Hard= {68, 51, 0, 0, 27},
},
["No.13"]= {
Easy= {38, 28, 5, 22, 0},
Medium= {61, 50, 29, 4, 17},
Hard= {85, 57, 20, 12, 44},
},
["PARANOiA-Respect-"]= {
Easy= {50, 48, 25, 0, 0},
Medium= {80, 97, 27, 18, 8},
Hard= {116, 97, 36, 32, 42},
},
["PASSION OF LOVE"]= {
Easy= {33, 25, 5, 67, 0},
Medium= {46, 37, 1, 36, 8},
Hard= {59, 50, 3, 29, 24},
},
["Polovtsian Dances And Chorus"]= {
Easy= {29, 24, 1, 21, 0},
Medium= {46, 42, 12, 74, 7},
Hard= {67, 48, 1, 0, 27},
},
["PUT YOUR FAITH IN ME ～SATURDAY NIGHT MIX～"]= {
Easy= {27, 19, 7, 11, 0},
Medium= {43, 29, 30, 7, 7},
Hard= {62, 54, 5, 8, 55},
},
["Quickening"]= {
Easy= {28, 24, 12, 56, 0},
Medium= {44, 37, 43, 49, 2},
Hard= {53, 43, 45, 56, 10},
},
["Quick Master"]= {
Easy= {30, 24, 7, 57, 0},
Medium= {49, 36, 29, 22, 9},
Hard= {59, 48, 21, 1, 28},
},
["rainbow flyer"]= {
Easy= {20, 18, 9, 56, 0},
Medium= {37, 37, 18, 42, 3},
Hard= {56, 49, 18, 55, 20},
},
["rainbow rainbow"]= {
Easy= {24, 29, 0, 0, 0},
Medium= {50, 58, 0, 2, 5},
Hard= {68, 58, 0, 20, 19},
},
["RED ZONE"]= {
Easy= {42, 27, 18, 40, 0},
Medium= {55, 41, 32, 40, 11},
Hard= {75, 55, 32, 22, 29},
},
["Saturday Night Love"]= {
Easy= {25, 21, 5, 18, 0},
Medium= {38, 31, 5, 19, 2},
Hard= {47, 37, 12, 26, 10},
},
["Scorching Moon"]= {
Easy= {32, 20, 25, 23, 0},
Medium= {43, 31, 49, 23, 4},
Hard= {59, 51, 32, 29, 33},
},
["SEDUCTION"]= {
Easy= {32, 27, 20, 66, 0},
Medium= {50, 48, 29, 26, 10},
Hard= {74, 76, 38, 57, 49},
},
["SEDUCTION(Vocal Remix)"]= {
Easy= {43, 31, 5, 22, 0},
Medium= {62, 47, 1, 2, 9},
Hard= {77, 63, 32, 2, 28},
},
["Ska Ska No.3"]= {
Easy= {24, 23, 18, 0, 0},
Medium= {39, 46, 18, 0, 13},
Hard= {57, 57, 0, 0, 35},
},
["Star Gate Heaven"]= {
Easy= {23, 18, 1, 11, 0},
Medium= {46, 36, 1, 3, 18},
Hard= {64, 48, 1, 3, 28},
},
["STARS☆☆☆(2nd NAOKI's style)"]= {
Easy= {36, 34, 18, 58, 1},
Medium= {43, 40, 38, 55, 5},
Hard= {58, 40, 54, 55, 15},
},
["THE SHINING POLARIS"]= {
Easy= {31, 24, 7, 20, 0},
Medium= {40, 30, 14, 22, 0},
Hard= {48, 48, 7, 72, 8},
},
["TIERRA BUENA"]= {
Easy= {26, 19, 0, 28, 0},
Medium= {41, 28, 16, 8, 10},
Hard= {56, 47, 20, 1, 34},
},
["TOMORROW"]= {
Easy= {30, 23, 1, 59, 0},
Medium= {46, 34, 1, 33, 10},
Hard= {61, 46, 29, 33, 37},
},
["Tomorrow Perfume"]= {
Easy= {27, 23, 12, 37, 0},
Medium= {45, 36, 14, 20, 3},
Hard= {53, 54, 30, 30, 12},
},
["TRUE♥LOVE"]= {
Easy= {31, 31, 0, 2, 0},
Medium= {55, 31, 43, 18, 0},
Hard= {73, 54, 63, 1, 22},
},
["Try 2 Luv. U"]= {
Easy= {23, 19, 3, 18, 0},
Medium= {34, 28, 16, 30, 2},
Hard= {46, 38, 7, 36, 12},
},
["un deux trois"]= {
Easy= {24, 21, 10, 11, 0},
Medium= {34, 32, 27, 39, 1},
Hard= {49, 37, 25, 46, 14},
},
["Under the Sky"]= {
Easy= {20, 21, 0, 0, 0},
Medium= {39, 35, 0, 23, 3},
Hard= {47, 49, 21, 14, 9},
},
["Xepher"]= {
Easy= {43, 28, 32, 51, 0},
Medium= {66, 49, 43, 12, 18},
Hard= {84, 56, 32, 16, 40},
Challenge= {110, 77, 36, 22, 100},
},
["You gotta move it (feat. Julie Rugaard)"]= {
Easy= {25, 22, 1, 40, 0},
Medium= {36, 38, 0, 59, 3},
Hard= {50, 50, 7, 54, 27},
},
["LA BAMBA"]= {
Easy= {26, 29, 10, 15, 0},
Medium= {47, 37, 16, 34, 3},
Hard= {63, 59, 38, 33, 18},
},
["蒼い衝動 ～for EXTREME～"]= {
Easy= {27, 24, 1, 23, 0},
Medium= {45, 36, 23, 21, 3},
Hard= {60, 42, 9, 11, 26},
},
["桜"]= {
Easy= {46, 42, 10, 13, 0},
Medium= {65, 64, 16, 11, 5},
Hard= {90, 96, 18, 1, 26},
Challenge= {72, 64, 9, 1, 10},
},
["大見解"]= {
Easy= {38, 26, 12, 5, 0},
Medium= {51, 39, 45, 16, 4},
Hard= {79, 52, 10, 33, 32},
Challenge= {81, 52, 43, 31, 33},
},
["三毛猫ロック"]= {
Easy= {28, 20, 20, 44, 0},
Medium= {50, 60, 16, 26, 6},
Hard= {64, 80, 20, 66, 26},
},
["A"]= {
Easy= {28, 22, 9, 6, 0},
Medium= {42, 34, 3, 13, 9},
Hard= {63, 45, 3, 14, 28},
Challenge= {64, 45, 47, 14, 33},
},
["Across the nightmare"]= {
Easy= {49, 50, 25, 0, 2},
Medium= {66, 62, 23, 15, 8},
Hard= {74, 100, 50, 22, 12},
Challenge= {88, 100, 81, 0, 23},
},
["air"]= {
Easy= {31, 21, 14, 0, 0},
Medium= {49, 32, 12, 14, 8},
Hard= {57, 37, 34, 27, 17},
},
["AM-3P -303 BASS MIX-"]= {
Easy= {27, 21, 5, 0, 0},
Medium= {44, 37, 5, 0, 14},
Hard= {51, 43, 16, 0, 19},
},
["bag"]= {
Easy= {32, 21, 0, 0, 13},
Medium= {47, 32, 9, 0, 74},
Hard= {78, 51, 1, 0, 118},
Challenge= {78, 51, 1, 0, 120},
},
["BE LOVIN"]= {
Easy= {34, 30, 16, 11, 0},
Medium= {62, 61, 29, 11, 12},
Hard= {77, 61, 23, 25, 23},
},
["Colors ～for EXTREME～"]= {
Easy= {32, 25, 21, 21, 0},
Medium= {50, 43, 16, 22, 6},
Hard= {60, 50, 10, 33, 19},
Challenge= {75, 62, 23, 11, 52},
},
["CUTIE CHASER(MORNING MIX)"]= {
Easy= {20, 20, 3, 0, 0},
Medium= {39, 26, 21, 0, 1},
Hard= {48, 36, 40, 35, 13},
},
["Dance Dance Revolution"]= {
Easy= {40, 25, 34, 0, 0},
Medium= {49, 37, 81, 2, 6},
Hard= {73, 56, 49, 0, 46},
Challenge= {73, 62, 18, 0, 30},
},
["Destiny lovers"]= {
Easy= {25, 21, 10, 7, 0},
Medium= {42, 28, 16, 36, 2},
Hard= {65, 63, 30, 34, 29},
},
["DROP THE BOMB(SyS.F. Mix)"]= {
Easy= {28, 25, 10, 28, 0},
Medium= {37, 25, 18, 17, 0},
Hard= {54, 50, 12, 63, 11},
},
["Frozen Ray ～for EXTREME～"]= {
Easy= {26, 25, 9, 25, 0},
Medium= {50, 38, 7, 12, 11},
Hard= {67, 51, 5, 3, 27},
},
["Gamelan de Couple"]= {
Easy= {37, 25, 21, 0, 0},
Medium= {41, 37, 54, 0, 1},
Hard= {72, 56, 54, 0, 67},
},
["GRADUATION ～それぞれの明日～"]= {
Easy= {22, 20, 9, 0, 0},
Medium= {35, 31, 12, 16, 4},
Hard= {47, 36, 14, 9, 15},
},
["Happy Wedding"]= {
Easy= {28, 20, 20, 1, 0},
Medium= {38, 31, 12, 24, 2},
Hard= {55, 41, 5, 18, 22},
},
["Heaven is a '57 metallic gray ～gimmix～"]= {
Easy= {37, 30, 7, 4, 0},
Medium= {52, 61, 10, 22, 10},
Hard= {69, 61, 12, 24, 54},
},
["HYPER EUROBEAT"]= {
Easy= {37, 25, 23, 28, 0},
Medium= {50, 31, 14, 59, 3},
Hard= {57, 37, 40, 41, 18},
},
["I'm gonna get you!"]= {
Easy= {27, 26, 16, 5, 0},
Medium= {44, 40, 29, 31, 1},
Hard= {64, 53, 34, 15, 24},
},
["jane jana"]= {
Easy= {37, 20, 7, 0, 0},
Medium= {40, 25, 12, 0, 7},
Hard= {71, 41, 21, 0, 35},
},
["JET WORLD"]= {
Easy= {34, 23, 3, 51, 0},
Medium= {51, 40, 36, 19, 10},
Hard= {66, 46, 23, 28, 24},
},
["Kind Lady"]= {
Easy= {32, 22, 12, 23, 0},
Medium= {40, 28, 10, 23, 3},
Hard= {54, 44, 3, 18, 14},
Challenge= {73, 56, 12, 1, 56},
},
["KISS KISS KISS"]= {
Easy= {33, 25, 9, 36, 0},
Medium= {44, 31, 29, 52, 2},
Hard= {66, 62, 29, 51, 28},
},
["Kiss me all night long"]= {
Easy= {27, 25, 5, 11, 0},
Medium= {41, 32, 18, 30, 0},
Hard= {61, 51, 34, 25, 29},
},
["L'amour et la liberté(DDR Ver.)"]= {
Easy= {33, 23, 0, 20, 0},
Medium= {48, 36, 0, 24, 8},
Hard= {60, 54, 0, 17, 34},
},
["♥Love²シュガ→♥"]= {
Easy= {31, 25, 16, 0, 0},
Medium= {44, 38, 27, 13, 2},
Hard= {55, 45, 12, 5, 18},
},
["LOVE♥SHINE"]= {
Easy= {33, 29, 23, 28, 0},
Medium= {45, 51, 25, 18, 0},
Hard= {69, 58, 50, 31, 22},
},
["Miracle Moon ～L.E.D.LIGHT STYLE MIX～"]= {
Easy= {25, 22, 3, 5, 0},
Medium= {41, 34, 16, 14, 4},
Hard= {59, 45, 25, 5, 23},
},
["PARANOIA survivor"]= {
Easy= {50, 54, 0, 10, 2},
Medium= {74, 54, 7, 11, 12},
Hard= {110, 98, 1, 9, 50},
},
["PARANOIA survivor MAX"]= {
Easy= {55, 57, 0, 5, 3},
Medium= {80, 68, 7, 6, 19},
Hard= {136, 119, 1, 5, 78},
Challenge= {181, 119, 49, 7, 100},
},
["Pink Rose"]= {
Easy= {27, 24, 10, 5, 0},
Medium= {41, 30, 29, 50, 2},
Hard= {52, 42, 27, 61, 21},
},
["SO IN LOVE"]= {
Easy= {20, 18, 0, 23, 0},
Medium= {33, 37, 18, 46, 7},
Hard= {44, 37, 29, 46, 14},
},
["STAY (Organic house Version)"]= {
Easy= {25, 20, 7, 3, 0},
Medium= {38, 31, 18, 22, 4},
Hard= {50, 41, 25, 6, 15},
},
["stoic (EXTREME version)"]= {
Easy= {27, 25, 30, 0, 0},
Medium= {56, 51, 14, 0, 9},
Hard= {70, 51, 30, 0, 24},
},
["sync (EXTREME version)"]= {
Easy= {40, 27, 3, 64, 0},
Medium= {55, 34, 10, 34, 4},
Hard= {61, 41, 29, 39, 10},
Challenge= {68, 55, 10, 17, 24},
},
["TEARS"]= {
Easy= {35, 23, 21, 28, 0},
Medium= {51, 41, 14, 20, 10},
Hard= {68, 59, 18, 20, 42},
},
["The Least 100sec"]= {
Easy= {34, 32, 10, 13, 0},
Medium= {61, 53, 25, 20, 4},
Hard= {93, 75, 5, 8, 27},
},
["The legend of MAXX"]= {
Easy= {52, 52, 16, 10, 0},
Medium= {79, 91, 43, 10, 5},
Hard= {112, 108, 67, 10, 40},
},
["TRIP MACHINE survivor"]= {
Easy= {38, 26, 3, 14, 0},
Medium= {65, 53, 1, 11, 29},
Hard= {76, 60, 1, 5, 54},
},
["Twin Bee -Generation X-"]= {
Easy= {31, 28, 9, 5, 0},
Medium= {47, 42, 29, 30, 5},
Hard= {67, 56, 36, 30, 25},
},
["V ～for EXTREME～"]= {
Easy= {30, 25, 9, 26, 0},
Medium= {45, 50, 7, 37, 4},
Hard= {63, 50, 20, 26, 20},
Challenge= {82, 81, 20, 26, 64},
},
["VANITY ANGEL"]= {
Easy= {28, 23, 0, 0, 0},
Medium= {47, 40, 0, 0, 11},
Hard= {61, 52, 0, 0, 57},
},
["xenon"]= {
Easy= {40, 26, 27, 21, 0},
Medium= {57, 46, 3, 17, 10},
Hard= {83, 72, 0, 21, 81},
},
["1998"]= {
Easy= {36, 25, 1, 3, 0},
Medium= {47, 31, 23, 7, 3},
Hard= {63, 43, 45, 9, 18},
},
["321STARS"]= {
Easy= {36, 31, 3, 11, 0},
Medium= {59, 55, 20, 18, 10},
Hard= {75, 63, 18, 16, 30},
},
["革命"]= {
Easy= {20, 24, 1, 42, 0},
Medium= {36, 42, 1, 57, 6},
Hard= {68, 54, 0, 6, 35},
Challenge= {56, 48, 1, 6, 25},
},
["AFRONOVA(FROM NONSTOP MEGAMIX)"]= {

Challenge= {77, 66, 36, 10, 19},
},
["AM-3P(AM EAST mix)"]= {

Challenge= {63, 58, 5, 4, 57},
},
["B4U(B4 ZA BEAT MIX)"]= {

Challenge= {57, 63, 10, 42, 19},
},
["BRE∀K DOWN!"]= {
Easy= {29, 31, 16, 38, 0},
Medium= {53, 31, 50, 20, 0},
Hard= {81, 63, 49, 3, 26},
},
["BRILLIANT 2U(K.O.G G3 MIX)"]= {

Challenge= {62, 56, 18, 13, 34},
},
["BURNIN' THE FLOOR (BLUE FIRE mix)"]= {

Challenge= {57, 45, 40, 16, 13},
},
["BURNING HEAT! (3 Option MIX)"]= {
Easy= {23, 20, 5, 49, 0},
Medium= {43, 41, 1, 37, 16},
Hard= {67, 61, 5, 5, 67},
},
["CANDY♡"]= {
Easy= {26, 30, 5, 24, 0},
Medium= {44, 37, 20, 40, 2},
Hard= {60, 44, 20, 14, 13},
},
["CELEBRATE NITE(EURO TRANCE STYLE)"]= {

Challenge= {63, 47, 12, 14, 29},
},
["D2R"]= {
Easy= {28, 26, 0, 10, 0},
Medium= {50, 40, 9, 18, 7},
Hard= {69, 60, 27, 0, 33},
},
["DESTINY"]= {
Easy= {29, 25, 9, 12, 0},
Medium= {53, 45, 27, 4, 13},
Hard= {67, 51, 10, 9, 34},
},
["DIVE TO THE NIGHT"]= {
Easy= {29, 25, 7, 10, 0},
Medium= {55, 38, 89, 9, 7},
Hard= {73, 51, 61, 5, 32},
},
["DROP OUT(FROM NONSTOP MEGAMIX)"]= {

Challenge= {65, 86, 30, 11, 54},
},
["ECSTASY (midnight blue mix)"]= {

Challenge= {52, 48, 21, 44, 19},
},
["HIGHER (next morning mix)"]= {

Challenge= {57, 43, 21, 50, 28},
},
["HYSTERIA 2001"]= {

Challenge= {57, 55, 47, 94, 8},
},
["i feel ..."]= {
Easy= {17, 17, 3, 47, 0},
Medium= {40, 29, 0, 25, 10},
Hard= {67, 52, 0, 10, 57},
},
["MAXX UNLIMITED"]= {
Easy= {30, 35, 41, 104, 0},
Medium= {60, 70, 29, 63, 9},
Hard= {102, 108, 29, 20, 48},
},
["MY SUMMER LOVE(TOMMY'S SMILE MIX)"]= {

Challenge= {57, 50, 25, 26, 56},
},
["rain of sorrow"]= {
Easy= {20, 23, 1, 40, 0},
Medium= {44, 34, 7, 19, 10},
Hard= {54, 52, 5, 102, 36},
},
["Secret Rendez-vous"]= {
Easy= {20, 16, 18, 9, 0},
Medium= {31, 28, 45, 22, 5},
Hard= {53, 49, 27, 52, 50},
},
["SEXY PLANET(FROM NONSTOP MEGAMIX)"]= {

Challenge= {50, 60, 67, 31, 3},
},
["Silent Hill (3rd christmas mix)"]= {

Challenge= {49, 41, 12, 110, 13},
},
["STILL IN MY HEART (MOMO MIX)"]= {

Challenge= {71, 81, 23, 6, 36},
},
["SUPER STAR(FROM NONSTOP MEGAMIX)"]= {

Challenge= {61, 47, 5, 22, 31},
},
["Sweet Sweet ♥ Magic"]= {
Easy= {28, 22, 14, 10, 0},
Medium= {51, 37, 29, 6, 10},
Hard= {72, 59, 38, 7, 33},
},
["TSUGARU"]= {
Easy= {34, 26, 27, 18, 2},
Medium= {51, 53, 38, 18, 13},
Hard= {78, 59, 20, 16, 52},
},
["TSUGARU (APPLE MIX)"]= {

Challenge= {62, 53, 9, 11, 20},
},
["WILD RUSH(FROM NONSTOP MEGAMIX)"]= {

Challenge= {48, 41, 0, 62, 19},
},
["CANDY☆"]= {
Easy= {44, 31, 0, 0, 0},
Medium= {46, 47, 14, 43, 4},
Hard= {73, 63, 70, 8, 17},
},
["exotic ethnic"]= {
Easy= {37, 31, 32, 21, 0},
Medium= {55, 39, 41, 16, 4},
Hard= {57, 47, 43, 141, 6},
},
["Healing Vision ～Angelic mix～"]= {
Easy= {54, 44, 21, 0, 2},
Medium= {75, 52, 43, 0, 25},
Hard= {94, 59, 29, 0, 49},
},
["Let the beat hit em!(CLASSIC R&B STYLE)"]= {
Easy= {30, 25, 3, 0, 4},
Medium= {39, 33, 16, 0, 10},
Hard= {43, 33, 27, 0, 14},
},
["MAX 300"]= {
Easy= {58, 48, 10, 18, 0},
Medium= {76, 72, 23, 13, 9},
Hard= {120, 97, 14, 7, 37},
},
["ORION.78～civilization mix～"]= {
Easy= {50, 50, 36, 0, 5},
Medium= {60, 66, 56, 0, 21},
Hard= {82, 66, 47, 0, 40},
},
["サナ・モレッテ・ネ・エンテ"]= {
Easy= {27, 15, 0, 0, 0},
Medium= {47, 33, 0, 0, 23},
Hard= {56, 44, 0, 0, 83},
},
["ABSOLUTE"]= {
Easy= {25, 23, 14, 0, 0},
Medium= {40, 34, 10, 0, 7},
Hard= {57, 51, 20, 0, 30},
},
["Abyss"]= {
Easy= {34, 22, 12, 0, 0},
Medium= {46, 40, 20, 0, 7},
Hard= {62, 45, 0, 0, 25},
},
["AFRONOVA PRIMEVAL"]= {
Easy= {58, 33, 25, 0, 0},
Medium= {67, 50, 41, 0, 8},
Hard= {88, 66, 38, 0, 30},
},
["BROKEN MY HEART"]= {
Easy= {43, 26, 14, 0, 0},
Medium= {54, 46, 67, 0, 7},
Hard= {69, 53, 47, 0, 26},
},
["CAN'T STOP FALLIN' IN LOVE ～SPEED MIX～"]= {
Easy= {52, 28, 5, 0, 0},
Medium= {70, 49, 7, 0, 16},
Hard= {93, 56, 5, 0, 40},
},
["DXY!"]= {
Easy= {39, 24, 54, 0, 0},
Medium= {53, 43, 56, 0, 13},
Hard= {64, 49, 67, 0, 25},
},
["ECSTASY"]= {
Easy= {35, 21, 30, 0, 0},
Medium= {46, 38, 27, 0, 9},
Hard= {57, 49, 20, 0, 25},
},
["Electro Tuned ( the SubS Mix )"]= {
Easy= {34, 20, 0, 0, 0},
Medium= {51, 41, 0, 0, 15},
Hard= {63, 51, 5, 0, 35},
},
["Healing Vision"]= {
Easy= {26, 27, 0, 0, 0},
Medium= {53, 54, 1, 0, 7},
Hard= {69, 68, 10, 0, 40},
},
["INSERTiON"]= {
Easy= {36, 23, 10, 0, 0},
Medium= {51, 46, 30, 0, 14},
Hard= {63, 52, 0, 0, 46},
},
["PARANOiA ETERNAL"]= {
Easy= {56, 50, 81, 0, 5},
Medium= {66, 66, 41, 11, 13},
Hard= {80, 66, 56, 11, 28},
},
["STILL IN MY HEART"]= {
Easy= {34, 25, 5, 0, 0},
Medium= {47, 43, 32, 0, 3},
Hard= {57, 50, 25, 0, 13},
},
["B4U"]= {
Easy= {40, 32, 7, 0, 0},
Medium= {48, 38, 20, 0, 7},
Hard= {64, 57, 16, 0, 22},
},
["BABY BABY GIMME YOUR LOVE"]= {
Easy= {17, 15, 0, 0, 0},
Medium= {23, 20, 7, 0, 0},
Hard= {37, 31, 7, 0, 13},
},
["BURNIN' THE FLOOR"]= {
Easy= {42, 25, 3, 0, 0},
Medium= {53, 38, 18, 0, 8},
Hard= {67, 51, 45, 0, 28},
},
["CAN'T STOP FALLIN' IN LOVE"]= {
Easy= {39, 25, 3, 0, 0},
Medium= {49, 25, 21, 0, 0},
Hard= {65, 57, 38, 0, 26},
},
["CELEBRATE NITE"]= {
Easy= {44, 23, 29, 0, 0},
Medium= {51, 41, 34, 0, 6},
Hard= {59, 47, 36, 0, 15},
},
["Don't Stop!～AMD 2nd MIX～"]= {
Easy= {25, 21, 0, 0, 0},
Medium= {40, 21, 0, 0, 0},
Hard= {50, 37, 0, 0, 12},
},
["DROP OUT"]= {
Easy= {37, 32, 1, 0, 0},
Medium= {63, 43, 16, 0, 1},
Hard= {81, 86, 30, 0, 11},
},
["era (nostalmix)"]= {
Easy= {31, 25, 0, 0, 0},
Medium= {47, 38, 14, 0, 10},
Hard= {73, 51, 0, 0, 40},
},
["HIGHER"]= {
Easy= {33, 21, 7, 0, 0},
Medium= {47, 38, 20, 0, 10},
Hard= {57, 43, 34, 0, 21},
},
["Holic"]= {
Easy= {46, 32, 0, 0, 8},
Medium= {54, 38, 7, 0, 13},
Hard= {79, 51, 7, 0, 36},
},
["HYSTERIA"]= {
Easy= {34, 31, 0, 0, 0},
Medium= {62, 47, 9, 0, 6},
Hard= {63, 55, 20, 0, 12},
},
["LEADING CYBER"]= {
Easy= {40, 25, 5, 0, 2},
Medium= {55, 50, 16, 0, 15},
Hard= {76, 68, 3, 0, 44},
},
["LOVE AGAIN TONIGHT～For Melissa MIX～"]= {
Easy= {39, 25, 25, 0, 0},
Medium= {51, 37, 9, 0, 9},
Hard= {61, 43, 20, 0, 19},
},
["MY SUMMER LOVE"]= {
Easy= {27, 25, 3, 0, 0},
Medium= {43, 33, 20, 0, 14},
Hard= {56, 45, 0, 0, 35},
},
["ORION.78(AMeuro-MIX)"]= {
Easy= {25, 17, 5, 0, 0},
Medium= {42, 34, 27, 0, 9},
Hard= {60, 61, 10, 0, 37},
},
["PARANOIA EVOLUTION"]= {
Easy= {51, 33, 3, 0, 0},
Medium= {63, 58, 45, 0, 8},
Hard= {74, 66, 32, 0, 23},
},
["SEXY PLANET"]= {
Easy= {44, 30, 1, 0, 0},
Medium= {52, 44, 40, 0, 4},
Hard= {60, 60, 94, 0, 17},
},
["SUPER STAR"]= {
Easy= {38, 21, 9, 0, 0},
Medium= {48, 42, 20, 0, 12},
Hard= {64, 47, 12, 0, 52},
},
["TRIP MACHINE CLIMAX"]= {
Easy= {51, 37, 38, 0, 3},
Medium= {66, 44, 43, 0, 14},
Hard= {82, 60, 40, 0, 28},
},
["WILD RUSH"]= {
Easy= {38, 20, 0, 0, 0},
Medium= {50, 35, 3, 0, 12},
Hard= {51, 56, 21, 0, 24},
},
[".59"]= {
Easy= {34, 22, 7, 0, 0},
Medium= {45, 44, 21, 0, 9},
Hard= {56, 67, 27, 0, 24},
},
["AFRONOVA"]= {
Easy= {56, 50, 50, 0, 3},
Medium= {58, 50, 70, 0, 6},
Hard= {86, 66, 61, 0, 27},
},
["AFTER THE GAME OF LOVE"]= {
Easy= {24, 21, 1, 0, 0},
Medium= {35, 26, 16, 0, 6},
Hard= {44, 34, 27, 0, 13},
},
["CUTIE CHASER"]= {
Easy= {35, 26, 16, 0, 0},
Medium= {44, 31, 18, 0, 8},
Hard= {60, 52, 36, 0, 38},
},
["DEAD END"]= {
Easy= {58, 47, 32, 0, 1},
Medium= {63, 47, 32, 0, 6},
Hard= {98, 63, 18, 0, 40},
},
["DROP THE BOMB"]= {
Easy= {44, 25, 12, 0, 0},
Medium= {52, 50, 9, 0, 8},
Hard= {66, 50, 10, 0, 23},
},
["DYNAMITE RAVE"]= {
Easy= {47, 25, 47, 0, 0},
Medium= {54, 37, 49, 0, 7},
Hard= {73, 50, 25, 0, 25},
Challenge= {71, 62, 29, 0, 34},
},
["GRADIUSIC CYBER ～AMD G5 MIX～"]= {
Easy= {56, 40, 18, 0, 7},
Medium= {64, 53, 18, 0, 22},
Hard= {77, 80, 3, 0, 70},
},
["La Señorita"]= {
Easy= {38, 30, 1, 0, 0},
Medium= {62, 45, 0, 0, 6},
Hard= {89, 60, 0, 0, 34},
},
["La Señorita Virtual"]= {
Easy= {55, 45, 12, 0, 6},
Medium= {68, 52, 3, 0, 15},
Hard= {82, 60, 56, 0, 28},
},
["LOVE THIS FEELIN'"]= {
Easy= {46, 51, 27, 0, 14},
Medium= {50, 58, 34, 0, 17},
Hard= {52, 71, 43, 0, 25},
},
["PARANOiA Rebirth"]= {
Easy= {60, 47, 29, 0, 5},
Medium= {68, 55, 65, 0, 12},
Hard= {91, 63, 10, 0, 34},
},
["Silent Hill"]= {
Easy= {36, 20, 14, 0, 0},
Medium= {45, 41, 12, 0, 6},
Hard= {59, 41, 29, 0, 19},
},
["think ya better D"]= {
Easy= {35, 28, 1, 0, 1},
Medium= {40, 39, 10, 0, 5},
Hard= {56, 45, 1, 0, 17},
},
["TRIP MACHINE～luv mix～"]= {
Easy= {46, 46, 14, 0, 14},
Medium= {56, 46, 56, 0, 25},
Hard= {68, 53, 41, 0, 26},
},
["BAD GIRLS"]= {
Easy= {30, 25, 10, 0, 2},
Medium= {38, 30, 54, 0, 5},
Hard= {45, 35, 43, 0, 14},
Challenge= {65, 56, 56, 0, 49},
},
["Boom Boom Dollar (Red Monster Mix)"]= {
Easy= {34, 22, 5, 0, 0},
Medium= {44, 39, 32, 0, 7},
Hard= {61, 44, 10, 0, 26},
Challenge= {67, 56, 101, 21, 94},
},
["stomp to my beat"]= {
Easy= {42, 33, 27, 0, 5},
Medium= {42, 38, 38, 0, 5},
Hard= {48, 44, 76, 0, 12},
Challenge= {74, 55, 29, 0, 63},
},
["AM-3P"]= {
Easy= {43, 32, 21, 0, 7},
Medium= {50, 32, 21, 0, 14},
Hard= {63, 43, 27, 0, 26},
},
["BRILLIANT 2U"]= {
Easy= {43, 43, 12, 0, 2},
Medium= {47, 43, 102, 0, 2},
Hard= {60, 50, 56, 0, 14},
Challenge= {60, 43, 27, 35, 21},
},
["BRILLIANT 2U(Orchestra Groove)"]= {
Easy= {45, 43, 21, 0, 3},
Medium= {49, 50, 50, 0, 12},
Hard= {62, 43, 18, 0, 20},
Challenge= {86, 50, 30, 0, 41},
},
["e-motion"]= {
Easy= {33, 29, 43, 0, 1},
Medium= {40, 41, 54, 0, 8},
Hard= {46, 59, 32, 60, 28},
},
["GENOM SCREAMS"]= {
Easy= {49, 43, 36, 0, 6},
Medium= {57, 50, 83, 0, 14},
Hard= {69, 62, 34, 72, 49},
},
["KEEP ON MOVIN'"]= {
Easy= {35, 27, 16, 0, 0},
Medium= {50, 43, 21, 0, 13},
Hard= {51, 43, 14, 0, 29},
},
["MAKE IT BETTER (So-REAL Mix)"]= {
Easy= {32, 24, 69, 0, 1},
Medium= {44, 39, 36, 0, 15},
Hard= {56, 54, 32, 0, 73},
Challenge= {52, 49, 67, 88, 73},
},
["PARANOiA KCET ～clean mix～"]= {
Easy= {55, 44, 74, 0, 3},
Medium= {61, 52, 38, 0, 10},
Hard= {74, 52, 30, 0, 19},
Challenge= {89, 75, 74, 20, 53},
},
["PARANOiA MAX～DIRTY MIX～"]= {
Easy= {61, 55, 67, 0, 5},
Medium= {69, 63, 56, 0, 11},
Hard= {81, 63, 56, 0, 30},
},
["PUT YOUR FAITH IN ME"]= {
Easy= {31, 30, 1, 0, 2},
Medium= {34, 34, 3, 0, 5},
Hard= {39, 34, 18, 0, 9},
},
["PUT YOUR FAITH IN ME (Jazzy Groove)"]= {
Easy= {38, 30, 0, 0, 4},
Medium= {47, 34, 5, 0, 14},
Hard= {51, 44, 3, 0, 43},
Challenge= {61, 55, 60, 25, 66},
},
["SP-TRIP MACHINE～JUNGLE MIX～"]= {
Easy= {49, 40, 18, 0, 9},
Medium= {56, 46, 21, 0, 16},
Hard= {62, 53, 14, 0, 23},
},
["KUNG FU FIGHTING"]= {
Easy= {26, 19, 12, 0, 0},
Medium= {31, 24, 25, 0, 0},
Hard= {37, 33, 20, 0, 10},
Challenge= {49, 43, 32, 50, 39},
},
["MAKE IT BETTER"]= {
Easy= {28, 29, 61, 0, 1},
Medium= {40, 39, 30, 0, 11},
Hard= {48, 54, 27, 0, 41},
},
["PARANOiA"]= {
Easy= {54, 37, 61, 0, 2},
Medium= {65, 60, 56, 0, 13},
Hard= {81, 60, 60, 0, 31},
},
["TRIP MACHINE"]= {
Easy= {49, 40, 27, 0, 3},
Medium= {53, 53, 34, 0, 7},
Hard= {65, 53, 27, 0, 25},
},
	},
}
